[{"id":10000,"type":0,"title":"Robert Adamson","text":"Robert Adamson was born in Sydney in 1943 and grew up in Neutral Bay and on the Hawkesbury River, New South Wales. From 1970 to 1985 he edited Australia’s New Poetry magazine, and in 1988, with Juno Gemes, he established Paper Bark Press, one of Australia’s leading poetry publishers. He is the inaugural CAL chair of poetry at UTS (University of Technology, Sydney). In 2011 he was awarded the Patrick White Prize and the Blake Prize for Poetry. His many award-winning publications include an autobiography, Inside Out (2004), two books of autobiographical fiction, and nearly 20 books of poetry, including Reading the River: Selected Poems (2004) and The Kingfisher’s Soul (2009) from Bloodaxe. His latest Australian publication is The Golden Bird: New & Selected Poems (Black Inc, 2008).","links":[]},{"id":10001,"type":0,"title":"Fleur Adcock","text":"Fleur Adcock writes about men and women, childhood, identity, roots and rootlessness, memory and loss, animals and dreams, as well as our interactions with nature and place. Her poised, ironic poems are remarkable for their wry wit, conversational tone and psychological insight, unmasking the deceptions of love or unravelling family lives. Born in New Zealand in 1934, she spent the war years in England, returning with her family to New Zealand in 1947. She emigrated to Britain in 1963, working as a librarian in London until 1979. In 1977-78 she was writer-in-residence at Charlotte Mason College of Education, Ambleside. She was Northern Arts Literary Fellow in 1979-81, living in Newcastle, becoming a freelance writer after her return to London. She received an OBE in 1996, and the Queen’s Gold Medal for Poetry in 2006 for Poems 1960-2000 (Bloodaxe, 2000).Fleur Adcock published three pamphlets with Bloodaxe: Below Loughrigg (1979), Hotspur (1986) and Meeting the Comet (1988), as well as her translations of medieval Latin lyrics, The Virgin & the Nightingale (1983). All her collections were then published by Oxford University Press until they shut down their poetry list in 1999, after which Bloodaxe published her collected poems Poems 1960-2000 (2000), followed by Dragon Talk (2010) and Glass Wings (2013). Poems 1960-2000 is a Poetry Book Society Special Commendation and Glass Wings is a Poetry Book Society Recommendation. ","links":[]},{"id":10002,"type":0,"title":"John Agard","text":"Poet, performer, anthologist, John Agard was born in Guyana and came to Britain in 1977. His many books include six collections from Bloodaxe, From the Devil’s Pulpit (1997), Weblines (2000), We Brits (2006), Alternative Anthem: Selected Poems (2009), Clever Backbone (2009), and Travel Light Travel Dark (2013). He is the winner of the Queen's Gold Medal for Poetry for 2012, presented to him by The Queen on 12 March 2013.He won the Casa de las Américas Prize in 1982, a Paul Hamlyn Award in 1997, and a Cholmondeley Award in 2004. We Brits was shortlisted for the 2007 Decibel Writer of the Year Award, and he has won the Guyana Prize twice, for his From the Devil's Pulpit and Weblines. As a touring speaker with the Commonwealth Institute, he visited nearly 2000 schools promoting Caribbean culture and poetry, and has performed on television and around the world. In 1989 he became the first Writer in Residence at London’s South Bank Centre, who published A Stone’s Throw from Embankment, a collection written during that residency. In 1998 he was writer-in-residence for the BBC with the Windrush project, and Bard at the Beeb, a selection of poems written during that residency, was published by BBC Learning Support. He was writer in residence at the National Maritime Museum in Greenwich in 2007.He is popular writer for children and younger readers, with titles including Get Back Pimple (Viking), Laughter is an Egg (Puffin), Grandfather’s Old Bruk-a-down Car (Red Fox), I Din Do Nuttin (Red Fox), Points of View with Professor Peekaboo (Bodley Head) and We Animals Would Like a Word with You (Bodley Head), which won a Smarties Award. Einstein, The Girl Who Hated Maths, a collection inspired by mathematics, and Hello H2O, a collection inspired by science, were published by Hodder Children’s Books and illustrated by Satoshi Kitamura. Frances Lincoln Children’s Books published his recent titles The Young Inferno (2008), his retelling of Dante, also illustrated by Satoshi Kitamura, which won the CLPE Poetry Award 2009, and Goldilocks on CCTV (2011). His anthology Hello New (2000), published by Orchard Books, was chosen by the Poetry Society as its Children’s Poetry Bookshelf Best Anthology. He collaborated with Bob Cattell on Butter-Finger (Frances Lincoln, 2005) and Shine On, Butter-Finger (Frances Lincoln, 2007), two cricket novels for children to which he contributed calypso cricket poems. He has also written plays. He lives with the poet Grace Nichols and family in Lewes in East Sussex, and they received the CLPE Poetry Award 2003 for their children's anthology Under the Moon and Over the Sea (Walker Books). ","links":[]},{"id":10003,"type":0,"title":"Moniza Alvi","text":"Moniza Alvi was born in Pakistan and grew up in Hertfordshire. After working for many years as a secondary school teacher in London, she is now a freelance writer and tutor, and lives in Wymondham, Norfolk. Her latest books are At the Time of Partition (Bloodaxe Books, 2013), her new book-length poem; Homesick for the Earth, her versions of the French poet Jules Supervielle (Bloodaxe Books, 2011); Europa (Bloodaxe Books, 2008); and Split World: Poems 1990-2005 (Bloodaxe Books, 2008), which includes poems from her five previous collections, The Country at My Shoulder (1993), A Bowl of Warm Air (1996), Carrying My Wife (2000), Souls (2002) and How the Stone Found Its Voice (2005). The Country at My Shoulder was shortlisted for the T.S. Eliot and Whitbread poetry prizes, and Carrying My Wife was a Poetry Book Society Recommendation. Europa was shortlisted for the T.S. Eliot Prize. Moniza Alvi received a Cholmondeley Award in 2002. At the Time of Partition is a Poetry Book Society Choice and is shortlisted for the 2013 T. S. Eliot Prize. ","links":[]},{"id":10004,"type":0,"title":"Elizabeth Alexander","text":"Elizabeth Alexander is a leading American poet whose work has been inspired by a wide range of influence, from history, literature, art and music, dreams and stories to the ‘rich infinity’ of the African American experience. She was born in New York City and grew up in Washington, DC. She is a poet, essayist, playwright, teacher and scholar of African-American literature and culture, and has given readings and lectures on African-American literature and culture in many countries. She has published four collections in the States: The Venus Hottentot (1990), Body of Life (1996), Antebellum Dream Book (2001) and American Sublime (2005), as well as a collection of essays on African American artistic life through literature, painting, film and popular media, The Black Interior (Graywolf, 2004). Her first British publication, American Blue: Selected Poems 2006), draws on all these. The anthology Bloodaxe Poetry Introductions: 1 (2006) includes a selection of her poems with extracts from an interview and an essay on African American poetry. Miss Crandall's School for Young Ladies & Little Misses of Color, a collaboration with poet Marilyn Nelson and artist Floyd Cooper, was published by Worksong in 2007. She has been filmed reading a selection of her work for the DVD-anthology In Person: 30 Poets (Bloodaxe, 2008). Elizabeth Alexander lives in New Haven, Connecticut, and is Professor of African-American Studies at Yale University. In January 2009 she read the inaugural poem for the swearing-in of President Barack Obama. ","links":[]},{"id":10005,"type":0,"title":"Taha Muhammad Ali","text":"Taha Muhammad Ali was born in 1931 in the village of Saffuriyya, Galilee. At 17 he fled to Lebanon with his family after the village came under heavy bombardment during the Arab-Israeli war of 1948. A year later they slipped back across the border and settled in Nazareth, where he lived until his death in 2011. An autodidact, he owned a souvenir shop now run by his sons near Nazareth’s Church of the Annunciation. In Israel, in the West Bank and Gaza, and in Europe and in America, audiences were powerfully moved by Taha Muhammad Ali’s poems of political complexity and humanity. He published several collections of poetry and one volume of short stories. His edition So What: New & Selected Poems 1971-2005 (Bloodaxe Books, 2007) was a Poetry Book Society Recommended Translation. Adina Hoffman's acclaimed biography of Taha Muhammad Ali, My Happiness Bears No Relation to Happiness: A Poet’s Life in the Palestinian Century (Yale University Press, 2009), won the 2010 Jewish Quarterly Wingate Prize. ","links":[]},{"id":10006,"type":0,"title":"Gillian Allnutt","text":"Gillian Allnutt was born in London but spent much of her childhood in Newcastle upon Tyne, and now lives in Co. Durham. Her collections Nantucket and the Angel and Lintel were both shortlisted for the T.S. Eliot Prize, and Lintel was a Poetry Book Society Choice. Her Bloodaxe retrospective, How the Bicycle Shone: New & Selected Poems (2007), draws on six published books plus a new collection, Wolflight, and was a Poetry Book Society Special Commendation. Her latest collection is indwelling (2013). She has also published Berthing: A Poetry Workbook (NEC\/Virago, 1991), and was co-editor of The New British Poetry (Paladin, 1988) and formerly poetry editor of City Limits. She received the Northern Rock Foundation Writer's Award in 2005. ","links":[]},{"id":10007,"type":0,"title":"Maram al-Massri ","text":"Maram al-Massri was born in Latakia, Syria, in 1962, and has lived in France since 1982. She has published three collections in Arabic, and her poems have been translated into many languages, with books published in French and Spanish. ","links":[]},{"id":10008,"type":0,"title":"Simon Armitage","text":"Simon Armitage was born in 1963 in Huddersfield, England. After studying Geography at Portsmouth Polytechnic, he worked with young offenders before gaining a postgraduate qualification in social work at Manchester University. He worked as a probation officer in Oldham until 1994.His poetry books include Zoom! (Bloodaxe Books, 1989), Xanadu (Bloodaxe Books, 1992), and later collections published by Faber, including Kid (1992), and CloudCuckooLand (1997). He won an Eric Gregory Award in 1988. Zoom! was a Poetry Book Society Choice and was shortlisted for a Whitbread Poetry Award. He was named 'Most Promising Young Poet' at the inaugural Forward Poetry Prize in 1992, won the Sunday Times Young Writer of the Year Award in 1993, and was Poet in Residence for the New Millennium Experience Company in 1999. Mister Heracles (2000), an adaptation of Euripides' Heracles, was commissioned by the West Yorkshire Playhouse. His Selected Poems was published by Faber in 2001, followed by The Universal Home Doctor (2002) and a new verse adaptation of Homer's Odyssey in 2006. Simon Armitage has worked extensively in film, radio and television. He wrote and presented Xanadu (1992), a 'poem film for television', broadcast by BBC television as part of the 'Words on Film' series, and his film about the American poet Weldon Kees was broadcast by the BBC in 1993. He also wrote and narrated Saturday Night, a documentary about Leeds, and Drinking for England, both broadcast by the BBC in 1996 as part of the 'Modern Times' series. Moon Country (1996), written with Glyn Maxwell, retraced a visit to Iceland in 1936 by the poets W.H. Auden and Louis MacNeice, and was adapted as a six-part series, Second Draft from Saga Land, broadcast by BBC Radio 3. Out of the Blue (2008) collects three pieces written in response to the anniversaries of three conflicts: a film-poem about 9\/11; a piece commissioned by Channel 5 for VE Day and a radio poem on Cambodia 30 years after the rise of the Khmer Rouge.He is also the author of All Points North (1998), a collection of essays about the north of England and Gig (2008), a memoir of a life of music and poetry, and two novels Little Green Man (2001) and White Stuff (2004).Simon Armitage is currently a Senior Lecturer at Manchester Metropolitan University. He became a Fellow of the Royal Society of Literature in 2004. His latest collection of poetry is Tyrannosaurus versus the Corduroy Kid (2006). ","links":[]},{"id":10009,"type":0,"title":"Neil Astley","text":"Neil Astley is editor of Bloodaxe Books, which he founded in 1978. His books include novels, poetry collections and anthologies, most notably the Bloodaxe Staying Alive trilogy: Staying Alive (2002), Being Alive (2004) and Being Human (2011), which were followed by Essential Poems from the Staying Alive Trilogy (2012).His other anthologies (all these from Bloodaxe) are Pleased to See Me: 69 very sexy poems (2002), Do Not Go Gentle: poems for funerals (2003), Passionfood: 100 Love Poems (2005\/2014), Soul Food: nourishing poems for starved minds [with Pamela Robertson-Pearce] (2007), Earth Shattering: ecopoems (2007), the DVD-book In Person: 30 Poets filmed by Pamela Robertson-Pearce (2008), The World Record: international voices from Southbank Centre's Poetry Parnassus (with Anna Selby, 2012), The Hundred Years' War: modern war poems (2014) and Funny Ha-Ha, Funny Peculiar: a book of strange & comic poems (2014).He has published two novels, The End of My Tether (Flambard, 2002; Scribner, 2003), which was shortlisted for the Whitbread First Novel Award, and The Sheep Who Changed the World (Flambard, 2005). In 2012 Candlestick Press published his selection of Ten Poems About Sheep in its renowned pamphlet series.He received an Eric Gregory Award for his poetry and was given a D.Litt from Newcastle University for his work with Bloodaxe Books. He lives in Northumberland.","links":[]},{"id":10010,"type":0,"title":"Tiffany Atkinson","text":"Tiffany Atkinson was born in Berlin in 1972 to an army family, and has lived in Wales since moving to Cardiff to take a PhD in Critical Theory. She now lectures in English and Creative Writing at Aberystwyth University. She won the Cardiff Academi International Poetry Competition in 2001. Her first collection, Kink and Particle (Seren, 2006), a Poetry Book Society Recommendation, won the Jerwood Aldeburgh First Collection Prize and was shortlisted for the Glen Dimplex New Writers Award. Catulla et al (Bloodaxe Books, 2011), her second collection, was shortlisted for the Roland Mathias Poetry Award (Wales Book of the Year) in 2012 and was a TLS Book of the Year. Her third collection, So Many Moving Parts, is due from Bloodaxe in 2014. ","links":[]},{"id":10011,"type":0,"title":"Attila the Stockbroker ","text":"John Baine (21 October 1957, Southwick, Sussex, England), better known by his stage name Attila the Stockbroker, is a punk poet, and a folk punk musician and songwriter. He performs solo and as the leader of the band Barnstormer. He describes himself as a \"sharp tongued, high energy social surrealist poet and songwriter.\" He has performed over 2,700 concerts, published six books of poems, and released 30+ recordings (CDs, LPs and singles). ","links":[]},{"id":10012,"type":0,"title":"Annemarie Austin","text":"Annemarie Austin was born in Devon and grew up on the Somerset Levels and in Weston-super-Mare, where has lived for most of her life. She won the Cheltenham Literature Festival Poetry Competition in 1980, and her first collection, The Weather Coming (1987), was a Poetry Book Society Recommendation. Very: New & Selected Poems (Bloodaxe Books, 2008) includes work from all her collections, including On the Border (1993), The Flaying of Marsyas (1995), Door upon Door (1999) and Back from the Moon (2003). A new collection, Track, is due from Bloodaxe in 2014. ","links":[]},{"id":10013,"type":0,"title":"Josephine Balmer","text":"Josephine Balmer was born in Hampshire in 1959. She studied Classics and Ancient History at University College, London, and has worked as a continuing education lecturer in Classics and Comparative Literature. She is a freelance writer and translator. She has published four books with Bloodaxe: her translation Sappho: Poems and Fragments (1992) and the companion anthology, Classical Women Poets (1996), and her new translation Catullus: Poems of Love and Hate, published in 2004 with Chasing Catullus: poems, translations & transgressions. Her latest collection, The Word for Sorrow, for which she was awarded a Wingate Foundation Scholarship, was published by Salt in 2009. She has written widely on poetry and translation for publications such as the Observer, The Independent on Sunday, The Times Literary Supplement and the New Statesman, and is reviews editor of Modern Poetry in Translation. Chair of the Translators’ Association from 2002 to 2005, she is a present judge of The Times\/Stephen Spender Prize for poetry in translation and has recently been awarded a PhD by Publication in Literature and Creative Writing at the University of East Anglia. She lives in Crowborough, East Sussex and in Cornwall. ","links":[]},{"id":10014,"type":0,"title":"Elizabeth Bartlett","text":"Elizabeth Bartlett (1924-2008) was born in Deal, in the mining region of Kent. She left school at 15 shortly before the start of the Second World War, to start work in a factory making hypodermic needles. Married during the War, she helped support her family with various jobs, working for 16 years as a medical secretary, and later in the home help service and as a tutor. She lived in Burgess Hill, West Sussex.Despite early success at the age of 19, in Tambimuttu’s Poetry London, she did not publish again until her mid-50s. Her first retrospective volume, A Lifetime of Dying: Poems 1942-1979 (Peterloo Poets, 1979), covered mainly work written in the latter two decades. She went on to publish four collections in the 1980s and early 90s: Strange Territory (Peterloo Poets, 1983), The Czar Is Dead (Rivelin Grapheme, 1986), Instead of a Mass (Headland, 1991) and Look, No Face (Redbeck Press, 1991). In 1995 Bloodaxe published Two Women Dancing: New & Selected Poems, edited by Carol Rumens, which was a Poetry Book Society Recommendation. This was followed by two later collections of poems written in her late 70s, Appetites of Love (2001) and Mrs Perkins and Oedipus (2004), both from Bloodaxe. In 2005 the Poetry Archive issued her CD, Elizabeth Bartlett Reading from her poems. Elizabeth Bartlett died in 2008, age 84. ","links":[]},{"id":10015,"type":0,"title":"Paul Batchelor ","text":"Paul Batchelor was born in Northumberland in 1977. In 2003 he received an Eric Gregory Award from the Society of Authors, and in 2004 he was given the Andrew Waterhouse Award by New Writing North. In 2005 he was a winner of the Poetry Business Prize; his pamphlet To Photograph a Snow Crystal was published by Smith\/Doorstop in 2006. His first full-length collection, The Sinking Road (Bloodaxe, 2008), was shortlisted for The Jerwood Aldeburgh First Collection Prize 2008 and the Glen Dimplex Prize for Best First Collection. His poem 'Comeuppance' won the Edwin Morgan International Poetry Competition in 2009. He did his PhD at Newcastle University on the work of Barry MacSweeney, and his critical anthology, Reading Barry MacSweeney, is due from Bloodaxe in 2013. His second collection, A Night In, is due in 2014. Paul Batchelor lives in Manchester and is a freelance reviewer. ","links":[]},{"id":10016,"type":0,"title":"Suzanne Batty ","text":"Suzanne Batty was born in Plymouth, 20 minutes after her twin sister, and upside down. Her family moved to suburban Manchester when she was two. She worked with young homeless people in London before studying English at Sussex University; she then worked variously as a gardener, a youth worker, a welfare rights advisor and suffered for several years as a civil servant. Although she has always written, Suzanne did not start writing poetry seriously until her 30s. She was one of the winners of the Poetry Business pamphlet competition in 1997 with Shrink (Smith\/Doorstop), and received a writer’s bursary from North West Arts in 1999. She is a founder member of urban poetry project The A6 Poets, and lives in Manchester, where she writes, teaches writing, performs her work, edits the poetry magazine Rain Dog and digs her allotment. She is also studying for an MA at Sheffield Hallam University. Her first collection, The Barking Thing was published by Bloodaxe in 2007. ","links":[]},{"id":10017,"type":0,"title":"Martin Bell","text":"Martin Bell was born in Hampshire in 1918. He was the leading member of the 'lost generation' of English poets whose careers were interrupted by the War. He was a prominent member of The Group during the fifties, and a major influence on younger poets like Peter Redgrove and Peter Porter. His poetry reached a wide audience during the sixties through Penguin Modern Poets, and in 1967 he published his Collected Poems,1937-1966, his first and last book. Bell was also a champion and brilliant translator of French Surrealist poets. He died in poverty in Leeds in 1978. ","links":[]},{"id":10018,"type":0,"title":"Connie Bensley","text":"Connie Bensley was born in south-west London, and has always lived there, apart from wartime evacuation. Until her retirement she worked as a secretary to doctors and to an M.P. and as a medical copywriter. Her latest book from Bloodaxe is Finding a Leg to Stand On: New & Selected Poems (2012), which presents new work with poems drawn from six previous collections: Progress Report and Moving In, originally published by Peterloo Poets, and four later books published by Bloodaxe: Central Reservations (1990), Choosing To Be a Swan (1994), The Back & the Front of It (2000) and Private Pleasures (2007). ","links":[]},{"id":10019,"type":0,"title":"Sara Berkeley","text":"Sara Berkeley was born in Dublin, Ireland in 1967.","links":[]},{"id":10020,"type":0,"title":"James Berry","text":"James Berry was born in 1924 and brought up in a tiny seaside village in Jamaica. He learnt to read before he was four years old, mostly from the Bible, which he often read aloud to his mother’s friends. When he was 17, he went to work in America, but hated the way black people were treated there, and returned to Jamaica after four years. In 1948, he made his way to Britain, and took a job working for British Telecom.One of the first black writers in Britain to achieve wider recognition, Berry rose to prominence in 1981 when he won the National Poetry Competition. His numerous books include two seminal anthologies of Caribbean poetry, Bluefoot Traveller (1976) and News for Babylon (Chatto, 1984). His latest book, A Story I Am In: Selected Poems (Bloodaxe Books, 2011), draws on five collections of poetry, including Fractured Circles (1979) and Lucy’s Letters and Loving (1982) from New Beacon Books, Chain of Days (Oxford University Press, 1985), and Hot Earth Cold Earth (1995) and Windrush Songs (2007) from Bloodaxe. Windrush Songs was published to mark the 200th anniversary of the abolition of the slave trade. He has published several books of poetry and short stories for children (from Hamish Hamilton, Puffin and Walker Books), and won many literary prizes, including the Smarties Prize (1987), the Signal Poetry Award (1989) and a Cholmondeley Award (1991). He was awarded the OBE in 1990. He lives in London. ","links":[]},{"id":10021,"type":0,"title":"Elizabeth Bishop","text":"Elizabeth Bishop is one of the greatest poets of the 20th century. When she died in 1979, she had only published four collections, yet had won virtually every major American literary award, including the Pulitzer Prize. She maintained close friendships with poets such as Marianne Moore and Robert Lowell, and her work has always been highly regarded by other writers. In surveys of British poets carried out in 1984 and 1994 she emerged as a surprising major choice or influence for many, from Andrew Motion and Craig Raine to Kathleen Jamie and Lavinia Greenlaw.A virtual orphan from an early age, Elizabeth Bishop was brought up by relatives in New England and Nova Scotia. The tragic circumstances of her life - from alcoholism to repeated experiences of loss in her relationships with women - nourished an outsider's poetry notable both for its reticence and tentativeness. She once described a feeling that 'everything is interstitial' and reminds us in her poetry - in a way that is both radical and subdued - that understanding is at best provisional and that most vision is peripheral.Since her death, a definitive edition of Elizabeth Bishop's Complete Poems (1983) has been published, along with The Collected Prose (1984), her letters in One Art (1994), her paintings in Exchanging Hats (1996) and Brett C. Millier's important biography (1993). In America, there have been numerous critical studies and books of academic essays, but in Britain only studies by Victoria Harrison (1995) and Anne Stevenson (1998) have done anything to raise Bishop's critical profile. ","links":[]},{"id":10022,"type":0,"title":"Robyn Bolam","text":"Robyn Bolam (formerly Marion Lomax) was born in 1953 in Newcastle, and grew up in Northumberland. She gained her doctorate from the University of York in 1983, and her study of Elizabethan and Jacobean drama was published by CUP in 1987. She has edited four plays by John Ford (OUP, 1995) and The Rover by Aphra Behn (New Mermaids, 1995), and is now Professor of English at St Mary's University College, Strawberry Hill, where she has taught since 1987. In 1981 she received a Gregory Award from the Society of Authors, and won first prize in the Cheltenham Festival poetry competition. Her libretto for the opera Beyond Men and Dreams (composer Bennett Hogg) was performed by the Royal Opera House Garden Venture in 1991. In 1993 she held a Hawthornden International Fellowship. She has published three books of poems with Bloodaxe, The Peepshow Girl (1989) and Raiding the Borders (1996), both under her former name of Marion Lomax and New Wings: Poems 1977-2007 (2007), a Poetry Book Society Recommendation. Her anthology Eliza's Babes: Four Centuries of Women's Poetry in English was published by Bloodaxe in 2003.","links":[]},{"id":10023,"type":0,"title":"Martin Booth","text":"Booth was born in Lancashire, but was brought up mainly in Hong Kong, where he first attended Kowloon Junior School, the Peak School then King George V School, and left in 1964.He made his name as a poet and as a publisher, producing elegant volumes by British and American poets, including slim volumes of work by Sylvia Plath and Ted Hughes. His own books of verse include The Knotting Sequence (1977), named for the village in which Booth was living at the time. The book features a series of lyrics in which he seeks links between the present and the Saxon past, and the man called Knot who gave his name to the village. Booth also accumulated a library of contemporary verse, which allowed him to produce anthologies and lectures.In the late 1970s Booth turned mainly to writing fiction. His first successful novel, Hiroshima Joe, was published in 1985. The book is based on what he heard from a man he met as a boy in Hong Kong and contains passages set in that city during the Second World War.Booth was a veteran traveller who retained an enthusiasm for flying, also expressed in his poems, such as \"Kent Says\" and In Killing the Moscs. His interest in observing and studying wildlife resulted in a book about Jim Corbett, a big-game hunter and expert on man-eating tigers.Many of Booth's works were linked to the British imperial past in China, Hong Kong and Central Asia. Booth was also fond of the United States, where he had many poet friends, and of Italy, which features in many of his later poems and in his novel A Very Private Gentleman (1990). These interests form a thread through his later novels, travel books and biographies.Booth's novel Industry Of Souls was shortlisted for the 1998 Booker Prize.Booth died of cancer in Devon in 2004, shortly after completing Gweilo, a memoir of his Hong Kong childhood written for his own children.The 2010 film The American, starring George Clooney, was based on his novel A Very Private Gentleman. ","links":[]},{"id":10024,"type":0,"title":"Karin Boye","text":"Karin Boye, Sweden's greatest woman poet, is one of the trio of great Scandinavian women poets, along with Edith Södergran and Mirjam Tuominen - all three published in English by Bloodaxe Books. Born in 1900, she was a poet of ideas, and wrote a powerful prophetic novel, Kallocain. Her involvement in the radical literary and artistic movement Clarté during the 1920s led to her interest in psychoanalysis, which influenced her literary work as well as her personal development during the latter years of her life. Intellectually and emotionally, she was far ahead of her time, and her controversial writings included the novel Crisis, in which she depicted the religious turmoil of her adolescence and her discovery of her own bisexuality. Her poetry has a strenuously angular quality which reflects - with naked candour - the harsh realities of her tragic inner struggle, which was eventually to lead to her suicide in 1941. ","links":[]},{"id":10025,"type":0,"title":"Patrick Brandon","text":"Patrick Brandon was born in London in 1965. He studied painting at Norwich School of Art, and exhibits regularly, most recently at the Royal Academy Summer Exhibition. In 2003 he was shortlisted for the Jerwood Drawing Prize. A recipient of a New Writing Ventures bursary in 2006, he won the Essex Poetry Prize in 2005, and received commendations in the Wigtown Poetry Prize 2005, and in the National Poetry Competition 2007. A Republic of Linen (Bloodaxe Books, 2009) is his first book of poems. He lives in Bristol with his partner and two young children. ","links":[]},{"id":10026,"type":0,"title":"Kamau Brathwaite","text":"Kamau Brathwaite is the founder secretary of the Caribbean Artists Movement and editor of Savacou. He is Professor of Social and Cultural History at the University of the West Indies, and Professor of Comparative Literature at New York University. ","links":[]},{"id":10027,"type":0,"title":"Fran Brearton ","text":"Fran Brearton is lecturer in English at Queen’s University Belfast. Her study The Great War in Irish Poetrywas published by Oxford University Press in 2000, and she co-edited Last before America: Irish and American Writing (Blackstaff, 2001). She was the 2004 British Academy Chatterton Lecturer on English Poetry. ","links":[]},{"id":10028,"type":0,"title":"Jean 'Binta' Breeze","text":"Jean ‘Binta’ Breeze is a poet, actress, dancer, choreographer, film writer and theatre director. She has released five poetry books, Riddym Ravings (Race Today), Spring Cleaning (Virago), and On the Edge of an Island, The Arrival of Brighteye and The Fifth Figure (all Bloodaxe), as well as several records and CDs, including Tracks with the Dennis Bovell Dub Band and Riding On De Riddym: selected spoken works (57 Productions). Third World Girl: Selected Poems (with DVD) is published by Bloodaxe in 2011. She has performed her work throughout the world, including tours of the Caribbean, North America, Europe, South East Asia and Africa, and now divides her time between Jamaica and Leicester. She received a NESTA Award in 2003. ","links":[]},{"id":10029,"type":0,"title":"Zoë Brigley","text":"Zoë Brigley was born in 1981 and grew up in Caerphilly in the Rhymney Valley. She won an Eric Gregory Award in 2003 and received an Academi bursary in 2005. Her first book of poems, The Secret (Bloodaxe Books, 2007), was a Poetry Book Society Recommendation, and was longlisted for the Dylan Thomas Prize in 2008. Her second collection, Conquest (Bloodaxe Books, 2012), is a Poetry Book Society Recommendation. She is also the co-editor of a volume of scholarly essays, Feminism, Literature and Rape Narratives (Routledge, 2010), and a collection of women’s poetry, Bluebeard’s Wives (Heaventree, 2007). She has taught creative writing at Warwick University and at University of Northampton, where she is a Research Fellow, and is currently living in Pennsylvania, USA. ","links":[]},{"id":10030,"type":0,"title":"Eleanor Brown","text":"Eleanor Brown was born in 1969, and grew up in Scotland. After reading English Literature at York University, she became a menial in the Banqueting Department of a Cambridge hotel, and then a Pizza Express waitress. She later travelled in France, where she lived for a while in a convent; after working as a barmaid in a North London pub for several years, she served time as a legal secretary before taking up her present post of Writing Fellow at the University of Strathclyde. In 1997 her first collection Maiden Speech was shortlisted for the Mail on Sunday\/John Llewellyn Rhys Prize, and her new version of Sophocles' play Philoctetes was staged by Inigo at the Cockpit Theatre in London. Eleanor Brown was one of the five young poets in Bloodaxe's 1997 New Blood promotion. ","links":[]},{"id":10031,"type":0,"title":"Basil Bunting","text":" Basil Bunting is one of the most important British poets of the 20th century. Acknowledged since the 1930s as a major figure in Modernist poetry, first by Pound and Zukofsky and later by younger writers, the Northumbrian master poet had to wait over 30 years before his genius was finally recognised in Britain - in 1966, with the publication of Briggflatts, which Cyril Connolly called 'the finest long poem to have been published in England since T.S. Eliot's Four Quartets'. Born in Northumberland in 1900, Bunting lived in Paris in the 20s, where Ezra Pound rescued him from jail and fixed him up with a job on the Transatlantic Review. He later followed Pound to Italy - giving up his job to Hemingway - where Yeats knew him as 'one of Pound's more savage disciples'. For the next 30 years he led a sometimes wild and always varied life - in Italy, England, Berlin, Tenerife, America and Persia - as a struggling, penniless writer, a music critic, sea captain, RAF officer, Times correspondent and Chief of Political Intelligence in Tehran. During these years he built up a reputation in America as the best English poet of his generation, at the same time as his poetry was neglected in Britain. In 1954 he returned to Northumberland, and worked for several years as a sub-editor on the Newcastle Evening Chronicle. It was not until the publication of Briggflatts that his genius was finally recognised. He died in 1985. Complete Poems (2000) was reissued by Bloodaxe for Bunting's centenary and includes his original Collected Poems alongside the posthumous Uncollected Poems. It also contains a new introduction by Richard Caddel. A companion double-cassette recording of his own reading of his poems, Briggflatts & Other Poems, was also published by Bloodaxe at the same time.A new Bloodaxe edition of Briggflatts (June 2009) includes a CD with an audio recording Bunting made of Briggflatts in 1967 and a DVD of Peter Bell’s 1982 film portrait of Bunting. As well as his own notes to the poem, the book includes his seminal essay on sound and meaning in poetry, ‘The Poet’s Point of View’ (1966). ","links":[]},{"id":10032,"type":0,"title":"Matthew Caley","text":"Matthew Caley’s Thirst (Slow Dancer, 1999) was shortlisted for the Forward Prize for Best First Collection. Since then he has been Poet-in-Residence at the Poetry Society café and commended (3rd and 2nd) in separate National Poetry Competitions. His second full-length collection, The Scene of My Former Triumph (Wrecking Ball Press, 2005), was followed by a third, Apparently (2010), from Bloodaxe Books. He has also co-edited Pop Fiction: The Song in Cinema with Stephen Lannin (Intellect, 2005). In a previous life – in Newcastle – he designed record sleeves including Prefab Sprout’s debut, Swoon. He now lives, works and writes in London. ","links":[]},{"id":10033,"type":0,"title":"Ciaran Carson","text":"Ciaran Carson is Literature and Traditional Arts Officer with the Arts Council of Northern Ireland. His other books include two collections from Bloodaxe, The Irish for No and Belfast Confetti. ","links":[]},{"id":10034,"type":0,"title":"Martin Carter","text":"Martin Carter’s poetry was first published in Britain in 1954 by the leftwing publishing house Lawrence & Wishart when publication in colonial British Guiana wasn’t possible, and later by New Beacon Books. He appeared in E.A. Markham’s seminal anthology Hinterland (Bloodaxe, 1989) as one of the father figures of modern Caribbean poetry. Two editions of Selected Poems by Martin Carter have been published, one in Guyana in 1997 and another in Britain by Peepal Tree in 1999. Stewart Brown’s critical anthology All Are Involved: The Art of Martin Carter also appeared from Peepal Tree in 1999. ","links":[]},{"id":10035,"type":0,"title":"Dan Chiasson","text":"Dan Chiasson was born in Burlington, Vermont, and educated at Amherst College and Harvard University, where he completed a PhD in English. A widely published literary critic, Chiasson is a regular reviewer for The New Yorker and The New York Times Book Review, poetry editor of the Paris Review, and has published a critical study, One Kind of Everything: Poem and Person in Contemporary America, with the University of Chicago Press in 2007. His Bloodaxe selection Natural History and other poems (2006) drew on two collections published in the US, The Afterlife of Objects (University of Chicago Press, 2002) and Natural History (Alfred A. Knopf, 2005). His latest collection is Where's the Moon, There's the Moon (Alfred A. Knopf, US \/ Bloodaxe Books, UK, 2010).He has received a Guggenheim Fellowship for poetry, a Pushcart Prize and a Whiting Writers’ Award, and teaches at Wellesley College. He lives in Sudbury, Massachusetts. ","links":[]},{"id":10036,"type":0,"title":"Polly Clark","text":"Polly Clark was born in Toronto in 1968 and brought up in Lancashire, Cumbria and the Borders of Scotland. She has worked variously as a zookeeper, a teacher of English in Hungary and in publishing at Oxford University Press. In 1997 she won an Eric Gregory Award for her poetry. Her first collection, Kiss (Bloodaxe Books, 2000), was a Poetry Book Society Recommendation. Her second, Take Me With You (Bloodaxe Books, 2005), a Poetry Book Society Choice, was shortlisted for the T.S. Eliot Prize. Farewell My Lovely (Bloodaxe Books, 2009) is her third collection. She has also published short stories. Polly now lives on the West Coast of Scotland and is a Royal Literary Fund Fellow at Edinburgh University. ","links":[]},{"id":10037,"type":0,"title":"Brendan Cleary","text":"Brendan Cleary lives in exile from Co. Antrim in Newcastle, where he edited and survived The Echo Room. He works as a part-time lecturer, performance poet and stand-up comic, and has appeared several times on the Mark Radcliffe Show on Radio One. His last book-length collection, The Irish Card, was published by Bloodaxe in 1993. ","links":[]},{"id":10038,"type":0,"title":"Jack Clemo","text":"As a young man, Jack Clemo lived in poverty amidst the bleak clay wastelands of Cornwall. He was also stone deaf, and after writing two visionary novels and his autobiographical Confession of a Rebel, he lost his sight in 1955. His Selected Poems (1988) and Approach to Murano (1993) show the development of his poetry from a puritanical anti-nature stance to a later, mellower outlook. The Cured Arno is his last collection, which he had only just completed at the time of his death in 1994.","links":[]},{"id":10039,"type":0,"title":"Harry Clifton","text":"Harry Clifton was born in Dublin in 1952, but has travelled widely in Africa and Asia, as well as more recently in Europe. He won the Patrick Kavanagh award in 1981 and has been the recipient of fellowships in Germany, France, the United States and Australia.He has published six collections of poems, including The Desert Route: Selected Poems 1973-88 and Night Train through the Brenner, all from Gallery Press, with The Desert Route co-published by Bloodaxe Books in Britain. On the Spine of Italy, his prose study of an Abruzzese mountain community, was published by Macmillan in 1999. A collection of his short fiction, Berkeley’s Telephone, appeared from Lilliput Press in 2000. His collection Secular Eden: Paris Notebooks 1994-2004 was published by Wake Forest in 2007 and won the Irish Times Poetry Now award. His most recent collection is The Winter Sleep of Captain Lemass, published by Bloodaxe Books in Britain and Ireland, and by Wake Forest University Press in the USA. The Holding Centre: Selected Poems 1974-2004 is due from Bloodaxe in 2014.He has taught in Bremen and Bordeaux universities, as well as Trinity College and University College Dublin. He returned to Ireland in 2004 and was Ireland Professor of Poetry in 2010-13. ","links":[]},{"id":10040,"type":0,"title":"Stewart Conn","text":"Stewart Conn was born in Glasgow in 1936 and grew up in Ayrshire, the setting for much of his early poetry. Since 1977 he has lived in Edinburgh, where until 1992 he was based as BBC Scotland's head of radio drama. He was Edinburgh’s first Makar or Poet Laureate in 2002-05.His poetry books include Stolen Light: Selected Poems (1999), Ghosts at Cockcrow (2005) and The Breakfast Room (2010) from Bloodaxe, with The Touch of Time: New & Selected Poems due in 2014. His other publications include a memoir, Distances (Scottish Cultural Press, 2001), and two anthologies, 100 Favourite Scottish Poems (SPL\/Luath Press, 2006), a TLS Christmas choice, and 100 Favourite Scottish Love Poems (Luath Press, 2008).He has won three Scottish Arts Council book awards, travel awards from the Society of Authors and the English-Speaking Union, and the Institute of Contemporary Scotland’s first Iain Crichton Smith award for services to literature. An Ear to the Ground was a Poetry Book Society Choice, Stolen Light was shortlisted for Saltire Scottish Book of the Year, and The Breakfast Room won the Scottish Mortgage Investment Trust Book Awards Poetry Book of the Year Prize. ","links":[]},{"id":10041,"type":0,"title":"David Constantine","text":"David Constantine has published ten books of poetry, five translations and a novel with Bloodaxe. His poetry titles include Something for the Ghosts (2002), which was shortlisted for the Whitbread Poetry Award; Collected Poems (2004), a Poetry Book Society Recommendation; Nine Fathom Deep (2009); and Elder. His Bloodaxe translations include editions of Henri Michaux and Philippe Jaccottet; his Selected Poems of Hölderlin, winner of the European Poetry Translation Prize; his version of Hölderlin’s Sophocles; and his translation of Hans Magnus Enzensberger’s Lighter Than Air, winner of the Corneliu M. Popescu Prize for European Poetry Translation. His other books include A Living Language: Newcastle\/Bloodaxe Poetry Lectures (2004) and his translation of Goethe’s Faust in Penguin Classics (2005, 2009). He won the Frank O’Connor International Short Story Award in 2013 for his collection Tea at the Midland (Comma Press), and is the first English writer to win this prestigious international award. He is a freelance writer and translator, a Fellow of the Queen’s College, Oxford, and was co-editor of Modern Poetry in Translation from 2004 to 2013. ","links":[]},{"id":10042,"type":0,"title":"Jane Cooper","text":"Cooper was born in Atlantic City, New Jersey, spent her early childhood in Jacksonville, Florida, and then moved with her family to Princeton in the mid-1930s. She attended Vassar College from 1942 to 1944, and earned a B.A. from the University of Wisconsin in 1946. In 1953–54 Cooper took a year off to get an M.A. at the University of Iowa, where she studied with Robert Lowell, and John Berryman in the Iowa Writers' Workshop.Cooper joined the faculty of Sarah Lawrence College, in 1950, and remained as a teacher and poet in residence until her retirement in 1987. She held the post of New York State Poet from 1995 to 1997. She died on October 26, 2007, of complications due to Parkinson's Disease. ","links":[]},{"id":10043,"type":0,"title":"Julia Copus","text":"Julia Copus was born in London in 1969, grew up in Hampshire and now lives in Somerset. She has published two collections with Bloodaxe, The Shuttered Eye (1995), which was shortlisted for the Forward Prize for Best First Collection, and In Defence of Adultery (2003) – both of these Poetry Book Society Recommendations.She has received many awards for her poetry, including an Eric Gregory Award, an Arts Council of England Writer’s Award, a Hawthornden Fellowship, and a BBC\/Gulbenkian Foundation writer’s bursary. She won first prize in the National Poetry Competition in 2003 with ‘Breaking the Rule’, and won the Forward Prize for Best Single Poem in 2010 with 'An Easy Passage'. Her radio plays include Eenie Meenie Macka Racka (2003), winner of the BBC’s prestigious Alfred Bradley Award, and The Enormous Radio (2008). She tutors regularly for the Arvon Foundation and The Poetry School and is an Advisory Fellow for the Royal Literary Fund and an Honorary Fellow at the University of Exeter. ","links":[]},{"id":10044,"type":0,"title":"Jeni Couzyn","text":"Jeni Couzyn published her Selected Poems, Life by Drowning, with Bloodaxe in 1985, drawing on work from her collections Flying (1970), Monkeys’ Wedding (1972), Christmas in Africa (1975) and House of Changes (1978), as well as new poems. She edited The Bloodaxe Book of Contemporary Women Poets (1985) and the Livewire teenage anthology Singing Down the Bones (Women’s Press, 1989). She lives in London. ","links":[]},{"id":10045,"type":0,"title":"Hart Crane","text":"Harold Hart Crane (July 21, 1899 – April 27, 1932) was an American poet. Finding both inspiration and provocation in the poetry of T. S. Eliot, Crane wrote modernist poetry that was difficult, highly stylized, and ambitious in its scope. In his most ambitious work, The Bridge, Crane sought to write an epic poem, in the vein of The Waste Land, that expressed a more optimistic view of modern, urban culture than the one that he found in Eliot's work. In the years following his suicide at the age of 32, Crane has been hailed by playwrights, poets, and literary critics alike (including Robert Lowell, Derek Walcott, Tennessee Williams, and Harold Bloom), as being one of the most influential poets of his generation.","links":[]},{"id":10046,"type":0,"title":"Fred D' Aguiar","text":"Fred D’Aguiar was born in London in 1960, and grew up in Guyana, returning to Britain at the age of 12. His first two collections, Mama Dot (1985) and Airy Hall (1989), were published by Chatto, Mama Dot winning a Poetry Book Society Recommendation, and Airy Hall the Guyana Prize for Poetry. In 1992 his poem-film Sweet Thames was shown in BBC 2’s Words on Film series, winning the Race in the Media Award, and his play A Jamaican Airman Foresees His Death, was staged at the Royal Court Theatre. He has held the Judith E. Wilson Fellowship at the University of Cambridge and was Northern Arts Literary Fellow in Newcastle and Durham. He now lectures at the University of Miami.","links":[]},{"id":10047,"type":0,"title":"Amanda Dalton","text":"Amanda Dalton is a poet and playwright. Born in Coventry, she was a deputy headteacher for five years. After organising writers’ courses for four years for the Arvon Foundation at Lumb Bank, she is now Education Director at the Royal Exchange Theatre, Manchester. Her first book-length collection, How to Disappear (Bloodaxe Books, 1999), was shortlisted for the Forward Prize for Best First Collection and chosen as a Next Generation Poets title by the Poetry Book Society in 2004. Her second collection, Stray, is published by Bloodaxe in 2012. Her radio drama includes Room of Leaves (1998) for BBC Radio 4, which was shortlisted for the Prix Italia award, and The Cabinet of Dr Caligari (2011) for BBC Radio 3. She lives in Hebden Bridge. ","links":[]},{"id":10048,"type":0,"title":"Ailbhe Darcy","text":"Ailbhe Darcy was born in Dublin in 1981 and brought up there, and currently lives in South Bend, Indiana. She has published her poetry in Ireland, Britain and the US, and co-edits Moloch, an online magazine of new art and writing. Selections of her work are included in the Bloodaxe anthologies Identity Parade and Voice Recognition, and in her pamphlet A Fictional Dress (tall-lighthouse, 2009). Imaginary Menagerie (Bloodaxe Books, 2011), her first book-length collection, is shortlisted for Ireland's dlr Strong Award at Poetry Now \/ Mountains to the Sea. ","links":[]},{"id":10049,"type":0,"title":"Imtiaz Dharker","text":"Born in Pakistan, Imtiaz Dharker grew up a Muslim Calvinist in a Lahori household in Glasgow and eloped with a Hindu Indian to live in Bombay. She now lives between India, London and Wales. She is an accomplished artist and documentary film-maker, and has published four books with Bloodaxe, Postcards from god (including Purdah) (1997), I Speak for the Devil (2001), The terrorist at my table (2006) and Leaving Fingerprints (2009), all including her own drawings. ","links":[]},{"id":10050,"type":0,"title":"Peter Didsbury","text":"Peter Didsbury was born in 1946 in Fleetwood, Lancashire. He moved to Hull at the age of six, and read English and Hebrew at Oxford. After teaching English in Hull for eight years, he turned to the past for work as well as for inspiration, and since been been an archaeologist for many years. He has published three collections with Bloodaxe The Butchers of Hull (1982), and The Classical Farm (1987) and That Old-Time Religion (1994). He won a Cholmondeley Award for The Classical Farm, which was a Poetry Book Society Recommendation, as was That Old-Time Religion. His New and Collected Poems is due from Bloodaxe in 2003. ","links":[]},{"id":10051,"type":0,"title":"Stephen Dobyns","text":"Stephen Dobyns is a leading American poet, novelist and crime writer. From his first collection Concurring Beasts, through Black Dog, Red Dog and Cemetery Nights (available from Bloodaxe), to Body Traffic, Dobyns has consistently written poems which are ‘brave, ravenous, intensely moving, and utterly his own’ (Thomas Lux). His Velocities: New and Selected Poems (Bloodaxe, 1996) draws on all these books. His later collections Common Carnage and Pallbearers Envying the One Who Rides are also published in Britain by Bloodaxe. His twenty novels (some of these available in Britain) include ten in his Charlie Bradshaw detective series set in Saratoga Springs, and the celebrated Cold Dog Soup. His novel The Church of Dead Girls, published by Viking, has sold over 120,000 copies in Britain. His last novel, Boy in the Water, was published by Viking in 1999.","links":[]},{"id":10052,"type":0,"title":"Katie Donovan","text":"Katie Donovan was born in 1962 and grew up on a farm in Co. Wexford, but for most of her life she has lived in Dun Laoghaire, a suburb of Dublin. She was educated at Trinity College Dublin and the University of California at Berkeley. She lived in Hungary for a year before returning to Ireland where she was a journalist with the Irish Times for 13 years. She qualified as an Amatsu practitioner (a form of Japanese osteopathy) and combines this work with teaching Creative Writing at IADT, the Institute of Art, Design and Technology in Dun Laoghaire. She has two children, Phoebe and Felix. Her latest book of poetry, Rootling: New & Selected Poems (Bloodaxe Books, 2010), draws on three previous collections, Watermelon Man (1993), Entering the Mare (1997) and Day of the Dead (2002), together with a whole collection of new work. She is the author of Irish Women Writers: Marginalised by Whom? (Raven Arts Press, 1988), and has co-edited two anthologies, Dublines (with Brendan Kennelly), published by Bloodaxe Books in 1996, and Ireland's Women: Writings Past and Present (with A. Norman Jeffares and Brendan Kennelly), published by Kyle Cathie (Britain) and Gill and Macmillan (Ireland) in 1994. ","links":[]},{"id":10053,"type":0,"title":"Maura Dooley","text":"Maura Dooley was born in Truro, grew up in Bristol, and after working for some years in Yorkshire now lives in London. She is a freelance writer and lectures at Goldsmiths’ College. She edited Making for Planet Alice: New Women Poets (1997) and The Honey Gatherers: A Book of Love Poems (2002) for Bloodaxe, and How Novelists Work (2000) for Seren. Life Under Water (Bloodaxe Books, 2008) is her first new collection since Sound Barrier: Poems 1982-2002 (Bloodaxe Books, 2002), which drew on collections including Explaining Magnetism (1991) and Kissing a Bone (1996), both Poetry Book Society Recommendations. Kissing a Bone was shortlisted for the T.S. Eliot Prize and Life Under Water has been shortlisted for the T. S. Eliot Prize 2008. ","links":[]},{"id":10054,"type":0,"title":"Tishani Doshi","text":"Tishani Doshi is an award-winning poet and dancer of Welsh-Gujarati descent. She was born in Madras, India, in 1975. She received her masters in writing from the Johns Hopkins University in America and worked in London in advertising before returning to India in 2001 to work with the choreographer Chandralekha, with whom she performed on many international stages. An avid traveller, she has been trekking in the Ethiopian Bale Mountains, visited Antarctica with a group of high-school students, and documented the largest transvestite gathering in Koovakam. She has written about her travels in newspapers such as the Guardian, International Herald Tribune, The Hindu and the Financial Times. She won an Eric Gregory Award for her poetry in 2001. In 2006, she won the All-India Poetry Competition, and her debut collection, Countries of the Body (Aark Arts), won the Forward Prize for Best First Collection. Her first novel, The Pleasure Seekers (Bloomsbury, 2010), was longlisted for the Orange Prize and shortlisted for the Hindu Fiction Award, and has been translated into several languages. Her second poetry collection, Everything Begins Elsewhere, is published by Bloodaxe Books in 2012. Tishani Doshi divides her time between Cheyyur, Tamil Nadu, and elsewhere. She frequently moonlights as a dancer. ","links":[]},{"id":10055,"type":0,"title":"Freda Downie","text":"Freda Downie (1929-93) was born in London, and spent her early years living in a temporary wooden house on the outskirts at Shooters Hill, from where she roamed the lanes and woods of the nearby Kent countryside. She was educated in Britain and Australia, and latterly lived in Berkhamsted in Hertfordshire. She worked for music publishers and art agents for many years, and only began publishing her poems in the 1970s, in limited editions. Two full collections, A Stranger Here (1977) and Plainsong (1981) followed from Secker & Warburg. She completed a further collection, Forty Poems, which was not published. Her Collected Poems, edited by George Szirtes, was published posthumously by Bloodaxe Books in 1995. In 2003 Bloodaxe published her memoir, There'll Always Be an England: a poet's childhood, 1929-1945, written in the last year of her life, covers the most vivid and formative times in her early life, which included evacuation to Northamptonshire in September 1939, a return to London in time for the Battle of Britain and the Blitz; then the family’s hazardous sea voyage from November 1941 to February 1942 around the Cape to her father’s war work in Australia, and the return in 1944 across the Pacific and though the Panama Canal to a London under threat from the V1 and V2 bombs. ","links":[]},{"id":10056,"type":0,"title":"Nick Drake","text":"Nick Drake was born in 1961. He lives and works in London. His first book-length collection, The Man in the White Suit (Bloodaxe Books, 1999), was a Poetry Book Society Recommendation, won the Forward Prize for Best First Collection in 1999, and was selected for the Next Generation Poets promotion in 2004. From The Word Go was published by Bloodaxe Books in 2007. His most recent projects include a stage adaptation of Philippe Petit’s To Reach the Cloud; the screenplay for the Australian film Romulus, My Father, starring Eric Bana, which won Best Film at the Australian Film Awards; Success, a play for the National Theatre's Connections project; and a trilogy of historical novels (Nefertiti, shortlisted for CWA Best Historical Crime Novel, Tutankhamun and Egypt: The Book of Chaos which Mammoth Screen are developing for TV). He is a screenwriter, and is also working the composer Tansy Davies and director Deborah Warner on an opera for ENO. In September 2010 he was invited to join Cape Farewell's trip to the Arctic to explore climate change, and from that journey arose a commission from United Visual Artists to create poems and texts for their ground-breaking installation High Arctic at the National Maritime Museum (2011). Those poems, together with others inspired by the Arctic and its voices, are gathered in his collection The Farewell Glacier (Bloodaxe Books, 2012).","links":[]},{"id":10057,"type":0,"title":"Ian Duhig","text":"Ian Duhig was born in London of Irish Catholic parents, and now lives in Leeds. He won the National Poetry Competition twice, in 1987 and 2001. He has published three collections with Bloodaxe, The Bradford Count (1991), which was selected for the New Generation Poets promotion, The Mersey Goldfish (1995), which was shortlisted for the T.S. Eliot Prize, and Nominies (1998), a Poetry Book Society Special Commendation. He won the Forward Prize for Best Poem in 2001. ","links":[]},{"id":10058,"type":0,"title":"Helen Dunmore","text":"Helen Dunmore is a poet, novelist, short story and children’s writer. Her poetry books have been given the Poetry Book Society Choice and Recommendations, Cardiff International Poetry Prize, Alice Hunt Bartlett Award and Signal Poetry Award, and Bestiary was shortlisted for the T.S. Eliot Prize. Her poem 'The Malarkey' won the 2010 National Poetry Competition. Her latest Bloodaxe poetry titles are Out of the Blue: Poems 1975-2001 (2001), Glad of These Times (2007), and The Malarkey (2012). She has published eleven novels and three books of short stories with Penguin, including A Spell of Winter (1995), winner of the Orange Prize for Fiction Talking to the Dead (1996), The Siege (2001), Mourning Ruby (2003), House of Orphans (2006) and The Betrayal (2010), as well as The Greatcoat (2012) with Hammer. She is a Fellow of the Royal Society of Literature, and lives in Bristol. ","links":[]},{"id":10059,"type":0,"title":"Douglas Dunn","text":"Douglas Dunn is a major Scottish poet, editor and critic, whose Elegies (1985), a moving account of his first wife’s death, became a critical and popular success. Author of over ten collections of poetry, he has also edited several anthologies, including The Faber Book of Twentieth-Century Scottish Poetry (2000). He was Professor in the School of English at the University of St Andrews from 1991, and was awarded an OBE in 2003. ","links":[]},{"id":10060,"type":0,"title":"G. F. Dutton","text":"G.F., G.J., G.J.F. or Geoffrey Dutton (1924-2010) was born in on the Welsh borders of Anglo-Scots parentage and brought up in the Scottish diaspora. Apart from much global travelling, he lived thereafter lived with wife and family in Scotland, the passionate austerities of which compel his poetry – helped by many other lifetime environments, including mountain, sea, forest, industrial tenement, hillside shack, various arts and the intercontinental circuses of biomolecular research.Major publications fed by what he calls ‘this metaphorical imperative’ cover solo longdistance wildwater snorkel swimming (Swimming Free, Heinemann & St Martins Press, 1972); mountaineering – his ‘classics of wit and humour’ The Ridiculous Mountains (Diadem) and Nothing So Simple as Climbing (Hodder) were combined as third edition in The Complete Doctor Stories (Bâton Wicks 1999 reprint); and his 44-year ‘ecological dialogue’ with a few rocky windblasted East Highland acres led to various articles, radio and TV features and the acclaimed pair Harvesting the Edge (prose and verse, Menard Press 1995, Scottish Arts Council [SAC] Award) and Some Branch Against the Sky (prose, David & Charles and Timber Press 1997). He wrote much poetry on these explorations but published it rarely: his first collection pamphlet, 31 Poems (Old Fire Station Poets, Oxford, 1977) was followed by three book-length collections, Camp One (Macdonald, 1978: SAC Award), Squaring the Waves (Bloodaxe Books, 1986: SAC Award) and The Concrete Garden (Bloodaxe Books, 1991: Poetry Book Society Recommendation), and what was to be his swansong, The Bare Abundance: Selected Poems 1975-2001 (Bloodaxe Books, 2002: Poetry Book Society Recommendation). ","links":[]},{"id":10061,"type":0,"title":"Lauris Edmond","text":"Lauris Edmond is one of New Zealand's most distinguished poets. Her career has been extraordinarily compressed. Born in 1924, she did not publish her first collection in 1975. Since then, eleven major titles have appeared, plus \"An Autobiography\" in three volumes. Her Selected Poems won the Commonwealth Poetry Prize in 1985.","links":[]},{"id":10062,"type":0,"title":"Menna Elfyn","text":"Menna Elfyn is one of the foremost Welsh-language writers. As well as being an award-winning poet, she has published plays, libretti and children’s novels, and co-edited The Bloodaxe Book of Modern Welsh Poetry (2003) with John Rowlands.Her books include two bilingual selections, Eucalyptus: Detholiad o Gerddi \/ Selected Poems 1978-1994 (Gomer Press, 1995), and Perfect Blemish: New & Selected Poems \/ Perffaith Nam: Dau Ddetholiad & Cherddi Newydd 1995-2007 (Bloodaxe Books, 2007), a Welsh-only selection Merch Perygl: Cerddi 1976-2011 (Gomer Press, 2011), and her latest bilingual collection, Murmur (Bloodaxe Books, 2012), a Poetry Book Society Recommended Translation.When not travelling the world for readings and residencies, she lives in Llandysul. She was Wales’s National Children’s Laureate in 2002, and is Creative Director in the School of Cultural Studies at the University of Wales, Trinity Saint David. ","links":[]},{"id":10063,"type":0,"title":"Ruth Fainlight","text":" Ruth Fainlight was born in New York City in 1931. She was educated in the United States and England, and has lived in England since the age of 15, mostly in London. She lived in Spain for four years in her 20s, and has spent long periods in France and Morocco. Her first poetry collection, Cages, was published in 1966. She was Poet in Residence at Vanderbilt University, Nashville, Tennessee, in 1985 and 1990. She was Writing Tutor (for libretti) at the Performing Arts Labs, International Opera and Music Theatre Labs in the UK in 1997-99.Her New & Collected Poems (Bloodaxe Books, 2010) covers work written over 50 years, drawing on over a dozen books as well as a whole new collection, translations and libretti. Four of those collections were originally published by Bloodaxe, including Sugar-Paper Blue (1997), which was shortlisted for the Whitbread Poetry Award. Other collections were published by Macmillan, Hutchinson and Sinclair-Stevenson.Ruth Fainlight's collections of short stories include Daylife and Nightlife (André Deutsch, 1971) and Dr Clock's Last Case and Other Stories (Virago, 1994). As a poet, short-story writer and translator, she has contributed to many anthologies. Her own work has been translated into Portuguese, French, Spanish, Italian and Romanian, and she has herself published translations from the Portuguese of the poetry of Sophia de Mello Breyner, and from the Spanish of several Latin American poets represented in her New & Collected Poems.She has also written four libretti: The Dancer Hotoke (1991), a chamber opera with music by Erika Fox, performed as part of the Royal Opera's 'Garden Venture' in 1991 and shortlisted for the Laurence Olivier Award for Outstanding Achievement in Opera; The European Story (based on her poem of the same title, 1993), also commissioned by the Royal Opera House; and Bedlam Britannica, which was commissioned by Channel 4 Television for the series War Cries in 1995; and The Bride in Her Grave. Her translation (with Robert J. Littman) of The Theban Plays by Sophocles (Oedipus the King, Oedipus at Colonus and Antigone) was published in 2009 in the Johns Hopkins University Press's New Translations from Antiquity series.She lives in London, and was married to the late Alan Sillitoe for over 50 years. She collaborated with him on an adaptation of Lope de Vega's play Fuenteovejuna, commissioned by the National Theatre and published as All Citizens Are Soldiers.She has received the Hawthorden Award and the Cholmondeley Award for Poetry, and is a Fellow of the Royal Society of Literature.An audio CD, Ruth Fainlight Reading from her Poems, was issued by The Poetry Archive in 2008. ","links":[]},{"id":10064,"type":0,"title":"Helen Farish","text":"Helen Farish was born in Cumbria in 1962, where she now lives. She has been a Fellow at Hawthornden International Centre for Writers and was the first female Poet in Residence at the Wordsworth Trust (2004-05). She has also been a Visiting Lecturer at Sewanee University, Tennessee, and a Visiting Scholar at the University of New Hampshire. She lectures at Lancaster University in the department of English and Creative Writing. Her debut collection Intimates (Cape, 2005), a Poetry Book Society Recommendation, was shortlisted for the T.S. Eliot Prize and won the Forward Prize for Best First Collection. Her audio CD Helen Farish reading from her poems was released by the Poetry Archive in 2009. Her second poetry book, Nocturnes at Nohant, is published by Bloodaxe Books in 2012. ","links":[]},{"id":10065,"type":0,"title":"Gillian Ferguson","text":"Gillian Ferguson is a popular writer for Scotland on Sunday - most recently the paper's TV critic. Her debut collection covers the intricacies of the natural world, shedding light on the still more curious human sphere. ","links":[]},{"id":10066,"type":0,"title":"Roy Fisher","text":"Roy Fisher has published over 30 poetry books, and has been the subject of numerous critical essays and several studies, including The Thing About Roy Fisher: Critical Essays on the Poetry of Roy Fisher, edited by Peter Robinson and John Kerrigan (Liverpool University Press, 2000), and of The Unofficial Roy Fisher, edited by Peter Robinson (Shearsman Books, 2010). He has published four books with Bloodaxe. The Dow Low Drop: New & Selected Poems (1996) was superseded by his later retrospective, The Long and the Short of It: Poems 1955-2005 (2005), and followed by his most recent collection, Standard Midland (2010), published on his 80th birthday, which was shortlisted for the Costa Poetry Award. An expanded edition, The Long and the Short of It: Poems 1955-2010 – including Standard Midland – was published in 2012. His first US Selected Poems, edited by August Kleinzahler, was published by Flood Editions in 2011.Born in 1930 in Handsworth, Birmingham, he retired as Senior Lecturer in American Studies from Keele University in 1982. He is a freelance writer and jazz musician, and lives in Derbyshire. ","links":[]},{"id":10067,"type":0,"title":"Tony Flynn","text":"Tony Flynn has published three collections of poems – A Strange Routine, and Body Politic with Bloodaxe Books, and his most recent New and Selected Poems, The Mermaid Chair, from Dream Catcher Books. He has received a number of literary awards for his work.","links":[]},{"id":10068,"type":0,"title":"Cheryl Follon ","text":"Cheryl Follon was born in Ayrshire, where she grew up. She studied Law and then English and Scottish Literature at Glasgow University before taking an MPhil in Creative Writing at Trinity College Dublin, and now teaches at a college of further education in Glasgow. She has received two writer’s bursaries from the Scottish Arts Council, and has published two collections with Bloodaxe, All Your Talk (2004) and Dirty Looks (2010). Her essay on the Mojave desert was shortlisted for the Shiva Naipaul Memorial Prize for travel writing in 2012. ","links":[]},{"id":10069,"type":0,"title":"Carolyn Forché","text":" Carolyn Forché was born in Detroit, Michigan in 1950. She has taught at several universities, and is now Director of the Lannan Center for Poetry and Poetics and holds the Lannan Chair in Poetry at Georgetown University in Washington, D.C. Her many honours include fellowships from the Guggenheim Foundation, the Lannan Foundation and the National Endowment for the Arts, and the Edita and Ira Morris Hiroshima Foundation Award, given in 1997 for using her poetry as a ‘means to attain understanding, reconciliation, and peace within communities and between communities’.Her first collection, Gathering the Tribes (1976), was selected for the Yale Series of Younger Poets by Stanley Kunitz. Her second book, The Country Between Us (1981), drew on her experiences in El Salvador during the civil war, and won the Poetry Society of America's Alice Fay di Castagnola Award, and was the Lamont Poetry Selection of the Academy of American Poets. Her later collections have drawn upon work written over many years: The Angel of History (HarperCollins, USA; Bloodaxe Books, 1994), Blue Hour (HarperCollins, USA; Bloodaxe Books, 2003), and In the Lateness of the World (due out in 2014).Her anthology, Against Forgetting: Twentieth-Century Poetry of Witness, was published by W.W. Norton in 1993, and her translations include Mahmoud Darwish's Unfortunately, It Was Paradise: Selected Poems (with Munir Akash, 2003), Claribel Alegría's Flowers from the Volcano (1983), and Robert Desnos's Selected Poetry (with William Kulik, 1991). ","links":[]},{"id":10070,"type":0,"title":"Janet Frame","text":" Janet Frame was born in Dunedin in 1924. As well as her poetry, she published eleven novels, five collections of stories, a children’s book and a three-volume autobiography (adapted by Jane Campion into her film An Angel at My Table). Her posthumous second collection The Goose Bath was published in New Zealand in 2006. It won the prize for best book of poetry at the annual (Montana) New Zealand Book Awards in 2007.  2008 saw the publication of Storms Will Tell: Selected Poems from Bloodaxe, and from Virago, Towards Another Summer, a previously unpublished short novel, written in London in 1963, and first published in New Zealand in 2007. Janet Frame won numerous literary awards at home and abroad, was made a CBE in 1983 for services to literature, and received New Zealand’s highest civil honour in 1990 when she was made a Member of the Order of New Zealand. In 2003 she was among the inaugural recipients of the Prime Minister’s Award for Literary Achievement, was named an Arts Foundation of New Zealand Icon Artist, and was a contender for the Nobel Prize for Literature. She died in 2004 ","links":[]},{"id":10071,"type":0,"title":"Linda France","text":"Linda France edited the Bloodaxe anthology Sixty Women Poets (1993), and published five collections with Bloodaxe. A freelance writer, she has worked on several collaborations with visual artists. She lives in Northumberland.","links":[]},{"id":10072,"type":0,"title":"Tess Gallagher","text":"Tess Gallagher was born in Port Angeles, Washington, the daughter of a logger and longshoreman. A poet, essayist, fiction writer and playwright, she has published many books, including four poetry titles in Britain with Bloodaxe: My Black Horse: New & Selected Poems (1995), Portable Kisses (1996), Dear Ghosts, (2007) and Midnight Lantern: New & Selected Poems (2012). She has published two collections of stories, The Lover of Horses (1986) and At the Owl Woman Saloon (1997), and two books of essays, A Concert of Tenses: Essays on Poetry (1986) and Soul Barnacles: Ten More Years with Ray (2000). She co-authored two screenplays with Raymond Carver, and later contributed to the making of the Robert Altman film Short Cuts, based on Carver’s work. She has also written introductions to books such as A New Path to the Waterfall and All of Us by Raymond Carver and Carver Country. She spends parts of each year in the West of Ireland, near Sligo, where she bought lambs to save them from the butcher and has since begun weaving wall hangings from their fleeces. Her collection of oral stories from Ireland, Barnacle Soup, co-authored with Irish painter and storyteller Josie Gray, was published by Blackstaff Press in 2007. ","links":[]},{"id":10073,"type":0,"title":"Miriam Gamble","text":"Miriam Gamble was born in Brussels in 1980 and grew up in Belfast. She studied at Oxford and at Queen’s University Belfast, where she completed a PhD in contemporary British and Irish poetry. She won an Eric Gregory Award in 2007, and the Ireland Chair of Poetry Bursary Award in 2010. Her pamphlet, This Man's Town, was published by tall-lighthouse in 2007. Her first book-length collection, The Squirrels Are Dead, was published by Bloodaxe Books in 2010 and won her a Somerset Maugham Award in 2011. She lives in Edinburgh, and works as a subtitler for the hard of hearing.","links":[]},{"id":10074,"type":0,"title":"Roger Garfitt","text":"Roger Garfitt was born in 1944 and has been a freelance writer ever since winning the Gregory Award in 1974. He was married to the late Frances Horovitz, whose Collected Poems he edited in 1985. From 1985 to 1992 he spent much of his time in Colombia, where he reported for Granta and the London Review of Books. He is now remarried and living in Shropshire. His autobiography, The Horseman's Word (Cape), was published in April 2011. Carcanet have published three previous collections of his poetry, most recently Given Ground (Poetry Book Society Recommendation, 1989). ","links":[]},{"id":10075,"type":0,"title":"Elizabeth Garrett","text":"Elizabeth Garrett was born in London, and grew up in Channel Islands. Her first book of poems, The Rule of Three (Bloodaxe, 1991), was selected for the New Generation Poets promotion in 1994. She works for the Voltaire Foundation in Oxford.","links":[]},{"id":10076,"type":0,"title":"Deborah Garrison","text":"Deborah Garrison was born in Ann Arbor, Michigan, and educated at Brown University and New York University. For 15 years she worked on the editorial staff of The New Yorker and is now the poetry editor at Alfred A. Knopf and a senior editor at Pantheon Books. She lives with her husband and three children in Montclair, New Jersey. She has published two collections, A Working Girl Can’t Win (Faber, 1999) and The Second Child (Bloodaxe Books, 2008).","links":[]},{"id":10077,"type":0,"title":"Jack Gilbert","text":"Jack Gilbert (1925-2012) was born in Pittsburgh, Pennsylvania. He was educated in Pittsburgh and San Francisco, where he later participated in Jack Spicer’s famous ‘Poetry as Magic’ Workshop at San Francisco State College in 1957. Initially associated with the Beats, he left America after winning the Yale Younger Poets Prize with Views of Jeopardy in 1962, eking out a living for many years on Greek islands, most notably Paros. His second collection, Monolithos, appeared twenty years later in 1982, winning him the Stanley Kunitz Prize and the American Poetry Review Prize, but he made his strongest impression on American readers with two later collections, The Great Fires (1994) and Refusing Heaven (2005), winner of the prestigious National Book Critics Circle Award. His final collection, The Dance Most of All (2009), was followed by his Collected Poems from Knopf in 2012. Monolithos (1982) and Refusing Heaven (2005) were nominated for the Pulitzer Prize, and Refusing Heaven was a finalist for the Los Angeles Times Book Prize. His other honours included a Lannan Literary Award and a grant from the National Endowment for the Arts. His only UK edition, Transgressions: Selected Poems (Bloodaxe Books, 2006), covers his collections from Views of Jeopardy to Refusing Heaven. Gilbert was the 1999-2000 Grace Hazard Conkling writer-in-residence at Smith College and a visiting professor and writer-in-residence at the University of Tennessee in 2004. ","links":[]},{"id":10078,"type":0,"title":"Pamela Gillilan","text":"Pamela Gillilan won the Cheltenham Festival poetry competition in 1979. Her Selected Poems, All-Steel Traveller (1994) includes work from her first book, That Winter, which was shortlisted for the Commonwealth Poetry Prize as the UK’s best first collection. It does not cover The Turnspit Dog. Her last collection The Rashomon Syndrome was published by Bloodaxe in 1998. She died in 2001.","links":[]},{"id":10079,"type":0,"title":"Chris Greenhalgh","text":"Chris Greenhalgh won a Gregory Award in 1992. He has published three collections with Bloodaxe: Stealing the Mona Lisa (1994), Of Love, Death and the Sea-Squirt (2000), and now The Invention of Zero (2007). His novel Coco and Igor, for which he has written a screenplay, was published by Headline in 2002. Born in Manchester, he lived for several years in Italy and Athens before returning to the UK to complete a doctoral thesis on postmodern American poetry. He is currently Academic Deputy Head of Sevenoaks School in Kent.","links":[]},{"id":10080,"type":0,"title":"John Greening","text":"John Greening was born on the banks of the River Thames and spent his early years in Kew, then moved to a house in Hounslow which was directly under the main flightpath to Heathrow (see NIGHTFLIGHTS). He studied at Swansea and for a year at the University of Mannheim where he spent more time teaching himself about English poetry than he did in studying German. While taking his MA at Exeter, he corresponded with Ted Hughes who managed to convince him that his poetry had some merit. He began to publish with journals such as Emma Tennant’s Bananas and South-West Review. He married Jane Woodland in 1978 and (after a spell as a part-time children’s conjuror) joined BBC Radio Three to work as Hans Keller’s Clerk, New Music. Keller gave him an empty office and let him spend much of his time writing.In 1979 the couple volunteered for VSO and worked for two years in Aswan, Upper Egypt, which was the focus of WESTERNERS, John Greening’s first collection. Upon their return, he taught Vietnamese Boat People in Scotland and was awarded a Scottish Arts Council Writer’s Bursary. He also wrote a play about Robert Louis Stevenson, which won Best New Play (the Ind Coop award) at the Edinburgh Festival. Since 1983, he has lived in ‘Huntingdonshire’ (technically Cambridgeshire) with his wife and two daughters, where he teaches at Kimbolton School.In 1987, Ted Hughes and Seamus Heaney selected his long poem, ‘The Coastal Path’ to be among the top six from over 30,000 submissions for the Observer\/Arvon poetry competition. Shortly after this, his second major collection The Tutankhamun Variations (following a pamphlet, WINTER JOURNEYS (1984)) appeared from Bloodaxe. Since then, his poetry has been widely published and among other prizes he has been awarded the Bridport (judged by Roger Garfitt) in 1998 Otto Hahn in Huntingdonshire and in 2002 the TLS Centenary Prize for one of his recent Iceland poems. Other books followed: FOTHERINGHAY AND OTHER POEMS (1995), THE COASTAL PATH (1996), THE BOCASE STONE (1996), culminating in a ‘New and Selected’ from Rockingham in 1998: NIGHTFLIGHTS. More recently, he has published two long poems GASCOIGNE’S EGG (2000) and OMM SETY (2001)) and THE HOME KEY (Shoestring, 2003). He received an award from the Society of Authors to fund research into his next book, ICELAND SPAR, which is about his father’s wartime years in Iceland and an extended selection of his work was published in 2009: HUNTS: POEMS 1979-2009 [add link] In 2008 he received a Cholmondeley Award and in 2010 received a Hawthornden Fellowship and was made a Fellow of the English Association. John Greening's next collection, TO THE WAR POETS, will appear from Oxford Poets (Carcanet) in June 2013.John Greening has written many plays (one about the Lindbergh kidnap was produced in the USA in 2002) and has had short stories published in Peter Ackroyd’s PEN anthology and elsewhere.He recently produced studies of Yeats, the War Poets, Ted Hughes, Thomas Hardy, Edward Thomas and the Elizabethan Love Poets, all from Greenwich Exchange, who also produced his most recent book, POETRY MASTERCLASS. A book about American poetry since 1963 remains unpublished. He is editing an anthology of poems about classical composers. He is a regular reviewer for the TLS and London Magazine and has written for other journals such as PN Review, Poetry Wales, The Hudson Review (USA) and Quadrant (Australia). His poems have appeared in the TLS, The Independent, The Observer, The Spectator and one of his collections has been translated into French by Myriam Davenel. His work has featured several times on Radio Three; he appeared on a BBC Wales television documentary about Dylan Thomas’s friendship with Vernon Watkins. He lectured on Watkins at the 1999 Dylan Thomas Festival, gave the 2001 Jon Silkin Memorial Lecture as part of the Indian King Festival and spoke on First World War Poets at the 2005 Ledbury Festival. His song-cycle, ‘Falls’ to music by Paul Mottram was premiered by the Dunedin Consort at the Wigmore Hall in June 2000 and has since been on tour in Scotland and Canada. John Greening has for the past three years been asked by the Society of Authors to judge the Eric Gregory Awards for poets under thirty. ","links":[]},{"id":10081,"type":0,"title":"Andrew Greig","text":"Andrew Greig is one of the leading Scottish writers of his generation. He has published eight collections of poetry, most of these with Bloodaxe, including The Order of the Day (Poetry Book Society Choice, 1990), This Life, This Life: New & Selected Poems 1970-2006 (2006), and As Though We Were Flying (2011), which was shortlisted in the poetry section of the Scottish Mortgage Investment Trust Book Awards in 2012. His most recent poetry titles are Getting Higher: the complete mountain poems (Polygon, 2011) and Found at Sea (Polygon, 2013).Known as ‘the poet laureate of climbing’, he publishes his collected poems of mountain adventures real and metaphorical as Getting Higher with Birlinn in 2011. Two books on his Himalayan expeditions have become classics in their field, as have Preferred Lies (a meditation on golf, self-recovery, Scotland) and At the Loch of the Green Corrie (fishing for Norman MacCaig, catching much else besides). His seven novels include That Summer (Faber, 2000), The Return of John Macnab (Headline, 1996) and its late sequel Romanno Bridge (Quercus, 2008), In Another Light (Weidenfeld & Nicolson, 2004), which was Saltire Scottish Book of the Year, and most recently, Fair Helen (Quercus, 2013). He lives in Edinburgh and Orkney with his wife, novelist Lesley Glaister. ","links":[]},{"id":10082,"type":0,"title":"Jane Griffiths","text":"Jane Griffiths was born in Exeter in 1970, and brought up in Holland. After reading English at Oxford, where her poem 'The House' won the Newdigate Prize, she worked as a book-binder in London and Norfolk. Returning to Oxford, she completed her doctorate on the Tudor poet John Skelton and worked on the Oxford English Dictionary for two years. After teaching English Literature at St Edmund Hall, Oxford, and then at the universities of Edinburgh and Bristol, she now teaches at Wadham College, Oxford. She won an Eric Gregory Award for her poetry in 1996. Her book Another Country: New & Selected Poems (Bloodaxe Books, 2008), included a new collection, Eclogue Over Merlin Street (2008), together with large selections from her previous two Bloodaxe collections, A Grip on Thin Air (2000) and Icarus on Earth (2005), and was shortlisted for the Forward Prize for Best Collection. Her latest collection is Terrestrial Variations (Bloodaxe Books, 2012). ","links":[]},{"id":10083,"type":0,"title":"Philip Gross","text":" Philip Gross is Professor of Creative Writing at Glamorgan University. His latest collection is Later, due from Bloodaxe in September 2013. He has published seven other books with Bloodaxe, including Deep Field (2011), a Poetry Book Society Recommendation, which was shortlisted for the Roland Mathias Poetry Award (Wales Book of the Year); The Water Table (2009), winner of the T.S. Eliot Prize; The Egg of Zero (2006); Mappa Mundi (2003), a Poetry Book Society Recommendation; and Changes of Address: Poems 1980-1998 (2001), his selection from earlier books including The Ice Factory, Cat’s Whisker, The Son of the Duke of Nowhere, I.D. and The Wasting Game. His book I Spy Pinhole Eye (Cinnamon Press, 2009), a collaborative work with photographer Simon Denison, won the Wales Book of the Year Award 2010. He is also the author of ten highly-praised novels for young people.His poetry for children includes Manifold Manor, The All-Nite Café (winner of the Signal Award 1994), Scratch City and Off Road To Everywhere (winner of the CLPE Award 2011). Since The Song of Gail and Fludd (1991) he has published nine more novels for young people, most recently The Storm Garden (2006).Born in Cornwall, he lived in Bristol and Bath for many years, and now lives in Penarth in South Wales. ","links":[]},{"id":10084,"type":0,"title":"Jen Hadfield","text":"Jen Hadfield lives in Shetland where she works as a poet and writing tutor. Her first collection Almanacs (Bloodaxe Books, 2005) was written in Shetland and the Western Isles in 2002 thanks to a bursary from the Scottish Arts Council, and it won an Eric Gregory Award in 2003, which enabled her to work on her second collection, Nigh-No-Place (Bloodaxe Books, 2008), in Canada and Shetland. She went on to win the T.S. Eliot Prize for Nigh-No-Place, which was also a Poetry Book Society Recommendation as well as being shortlisted for the Forward Prize for Best Collection. She has also received a Dewar Award to produce a solo exhibition of Shetland ex-votos in the style of sacred Mexican folk art, incorporating rubrics of very short fiction, and won the Edwin Morgan Poetry Competition in 2012. ","links":[]},{"id":10085,"type":0,"title":"Maggie Hannan","text":"Maggie Hannan was born in 1962 in Wiltshire, and lived in Derbyshire, Cumbria and Newcastle before moving to Hull. She won a Gregory Award in 1990. Her poems have since been published in many important anthologies, including No Holds Barred, The Gregory Anthology, The New Lake Poets, The New Poetry, Making for Planet Alice and New Blood. Published by Bloodaxe in 1995, Liar, Jones was shortlisted for the Forward Prize for Best First Collection","links":[]},{"id":10086,"type":0,"title":"Choman Hardi","text":"Choman Hardi has published three books of poetry in Kurdish, but now writes in English, and Life for Us is her first English collection. She studied philosophy and psychology at Oxford and later at University College London, and has recently completed doctorate research at the University of Kent on the mental health of Kurdish women refugees between the clash of cultures.","links":[]},{"id":10087,"type":0,"title":"Kerry Hardie","text":"Kerry Hardie was born in 1951 and grew up in County Down. She now lives in County Kilkenny with her husband, the writer Seán Hardie. Her poems have won many prizes, including the Michael Hartnett Award for Poetry in 2005. Her poems have featured in six Bloodaxe anthologies: Staying Alive, Being Alive, Being Human, The Poetry Cure, The New Irish Poets and Modern Women Poets.She has published five collections with Gallery Press in Ireland: A Furious Place (1996), Cry for the Hot Belly (2000), The Sky Didn’t Fall (2003), The Silence Came Close (2006) and Only This Room (2009). Her latest book of poetry is Selected Poems (Gallery Press, Ireland & Bloodaxe Books, Britain, 2011). Her first novel, Hannie Bennet’s Winter Marriage appeared in 2000; her second, The Bird Woman was published in 2006. Kerry Hardie is a member of Aosdána. ","links":[]},{"id":10088,"type":0,"title":"Jackie Hardy","text":"Jackie Hardy works as a tutor and assessor in adult education. She was a prize winner of the Bloodaxe Books\/Evening Chronicle Poetry Competition in 1988, and her poems have since appeared in many magazines. For the last five years she has edited Blithe Spirit, the journal of the British Haiku Society. She lives in the Tyne Valley in Northumberland.","links":[]},{"id":10089,"type":0,"title":"Tony Harrison","text":"Tony Harrison is Britain's leading film and theatre poet. He has written for the National Theatre in London, the New York Metropolitan Opera and for the BBC and Channel 4 television. He was born in Leeds, England in 1937 and was educated at Leeds Grammar School and Leeds University, where he read Classics and took a diploma in Linguistics.He became the first Northern Arts Literary Fellow (1967-68), a post he held again in 1976-77, and was resident dramatist at the National Theatre (1977-78). His work there included adaptations of Molière's The Misanthrope and Racine's Phaedra Britannica.His first collection of poems, The Loiners (1970), was awarded the Geoffrey Faber Memorial Prize in 1972, and his acclaimed version of Aeschylus's The Oresteia (1981) won him the first European Poetry Translation Prize in 1983. Bloodaxe published his Dramatic Verse 1973-1985 in hardback in 1985, with a paperback following from Penguin under the title Theatre Works 1973-1985.He published several poetry titles with Bloodaxe, including A Kumquat for John Keats (1981), U.S. Martial (1981), v. (1985\/1989), The Fire-Gap (1985), A Cold Coming (1991), The Gaze of the Gorgon (1992) and Permanently Bard: Selected Poetry (1995). The Gaze of the Gorgon (1992) won the Whitbread Poetry Award. Neil Astley's critical anthology Tony Harrison (1991) included several essays and texts collected or published there for the first time.Harrison's adaptation of the English Medieval Mystery Plays cycle was first performed at the National Theatre in 1985. Many of his plays have been staged away from conventional auditoria: The Trackers of Oxyrhyncus was premièred at the ancient stadium at Delphi in 1988; Poetry or Bust was first performed at Salts Mill, Saltaire in Yorkshire in 1993; The Kaisers of Carnuntum premiered at the ancient Roman amphitheatre at Carnuntum in Austria; and The Labours of Herakles was performed on the site of the new theatre at Delphi in Greece in 1995. His translation of Victor Hugo's The Prince's Play was performed at the National Theatre in 1996.His films using verse narrative include v., broadcast by Channel 4 television in 1987 and winner of a Royal Television Society Award; Black Daisies for the Bride, winner of the Prix Italia in 1994; and The Blasphemers' Banquet, screened by the BBC in 1989, an attack on censorship inspired by the Salman Rushdie affair. He co-directed A Maybe Day in Kazakhstan for Channel 4 in 1994 and directed, wrote and narrated The Shadow of Hiroshima, screened by Channel 4 in 1995 on the 50th anniversary of the dropping of the first atom bomb. The published text, The Shadow of Hiroshima and Other Film\/Poems (Faber, 1995), won the Heinemann Award in 1996. He wrote and directed his first feature film Prometheus in 1998. In 1995 he was commissioned by The Guardian newspaper to visit Bosnia and write poems about the war.His most recent poetry collection, Under the Clock (Penguin, 2005), was followed by Collected Poems (Viking, 2007) and Collected Film Poetry (Faber, 2007). His latest book is Fram (Faber, 2008), a work for theatre premièred at the National Theatre in 2007.Tony Harrison lives in Newcastle upon Tyne. ","links":[]},{"id":10090,"type":0,"title":"J. S. Harry","text":"J.S. Harry was born in 1939 in South Australia, and has lived in Sydney for most of her life. She has worked as an editor for Radio National and has held a residency at Australian National University. She has published eight collections of poetry, including the deer under the skin (1971), Hold, for a little while, and turn gently (1979), A Dandelion for Van Gogh (1985), The Life on Water and the Life Beneath (1995), Selected Poems (1995), winner of the NSW Premier's Award for Poetry, Sun Shadow, Moon Shadow (2000), If…And the Movable Ground (2004), and her complete collection of Peter Henry Lepus rabbit poems, Not Finding Wittgenstein (Giramondo, Australia, 2007; Bloodaxe Books, UK, 2012).","links":[]},{"id":10091,"type":0,"title":"Kevin Hart","text":"Kevin Hart was born in 1954 in the village of Ockenden near London, and grew up in London and Brisbane. He has published several books of poetry in Britain, Australia and America, including Flame Tree: Selected Poems (Bloodaxe Books, 2002) and his latest collection, Young Rain (Bloodaxe Books, 2009). His award-winning poetry has been translated into several languages, including Chinese. He is also the author of several volumes of literary criticism and theology. He teaches in the Department of Religious Studies at the University of Virginia in Charlottesville. ","links":[]},{"id":10092,"type":0,"title":"Robert Hass","text":"Robert Hass was born in 1941 in San Francisco. He served as US Poet Laureate in 1995-97. His many awards include a Pulitzer Prize and a National Book Award for Time and Materials (2007), and the National Book Critics Circle Award for Sun Under Wood (1996). His first collection Field Guide was selected by Stanley Kunitz for the Yale Younger Poets Series in 1973. His latest book of poetry is The Apple Trees at Olema: New & Selected Poems (Ecco, USA, 2010; Bloodaxe Books, UK, 2011). Hass also worked with Czeslaw Milosz to translate a dozen books of Milosz’s poetry, including Treatise on Poetry and, most recently, A Second Space. His translations of the Japanese haiku masters have been collected in The Essential Haiku: Versions of Basho, Buson, and Issa. His books of essays include Twentieth Century Pleasures: Prose on Poetry (1984) and Now and Then: The Poet’s Choice Columns (2007). He lives in northern California with his wife, the poet Brenda Hillman, and teaches at the University of California at Berkeley. ","links":[]},{"id":10093,"type":0,"title":"Geoff Hattersley","text":"Geoff Hattersley was born in South Yorkshire in 1956. His many collections of poetry include Port of Entry (Littlewood 1989), Don’t Worry (Bloodaxe 1994), Harmonica (Wrecking Ball 2003), and Back of Beyond (Smith Doorstop 2006).His poems have been broadcast on local and national radio and have been used as part of syllabuses in schools, universities, and with The Open University. He is an experienced reader of his poetry and has performed and recorded musical arrangements of his poems.He edited The Wide Skirt Press from 1986 until 1998, publishing 30 issues of the magazine and 24 books and pamphlets. He is an experienced creative writing tutor and was a Royal Literary Fund Writing Fellow at Huddersfield University. A new collection, Outside the Blue Hebium, was published by Smith Doorstop Books in July 2012. ","links":[]},{"id":10094,"type":0,"title":"Adrian Henri","text":"Adrian Henri (10 April 1932 – 20 December 2000) was a British poet and painter best remembered as the founder of poetry-rock group the Liverpool Scene and as one of three poets in the best-selling anthology The Mersey Sound, along with Brian Patten and Roger McGough. The trio of Liverpool poets came to prominence in that city's Merseybeat zeitgeist of the 1960s and 1970s. He was described by Edward Lucie-Smith in British Poetry since 1945 as the \"theoretician\" of the three. His characterisation of popular culture in verse helped to widen the audience for poetry among 1960s British youth. He was influenced by the French Symbolist school of poetry and surrealist art.","links":[]},{"id":10095,"type":0,"title":"W. N. Herbert","text":"W.N. Herbert is a highly versatile poet who writes both in English and Scots. Born in Dundee, he established his reputation with two English\/Scots collections from Bloodaxe, Forked Tongue (1994) and Cabaret McGonagall (1996), followed by The Laurelude (1998), The Big Bumper Book of Troy (2002), Bad Shaman Blues (2006) and Omnesia (2013). He has also published a critical study, To Circumjack MacDiarmid (OUP, 1992). His practical guide Writing Poetry was published by Routledge in 2010. He co-edited Strong Words: modern poets on modern poetry (Bloodaxe Books, 2000) with Matthew Hollis, and Jade Ladder: Contemporary Chinese Poetry (Bloodaxe Books, 2012) with Yang Lian. Born in Dundee, he is Professor of Poetry and Creative Writing at Newcastle University and lives in a lighthouse overlooking the River Tyne at North Shields. Twice shortlisted for the T.S. Eliot Prize, his collections have also been shortlisted for the Forward Prize, McVities Prize, Saltire Awards and Saltire Society Scottish Book of the Year Award. Four are Poetry Book Society Recommendations. ","links":[]},{"id":10096,"type":0,"title":"Tracey Herd","text":"Tracey Herd was born in 1968 in East Kilbride but has lived on the east coast of Scotland for most of her life. She studied at Dundee University, where she was Creative Writing Fellow in 1998-2001. In 1993 she won an Eric Gregory Award, and in 1995 a Scottish Arts Council Bursary. In 2002 she collaborated on a short opera, Descent, with the composer Gordon McPherson for Paragon Ensemble which was performed at the Traverse Theatre in Glasgow. In 2004 she received a second Scottish Arts Council bursary. She is a freelance writer who worked for some years as a bookseller, and has latterly been a Royal Literary Fund Fellow. Her first collection, No Hiding Place (Bloodaxe Books, 1996) was shortlisted for the Forward Prize for Best First Collection. Her second collection, Dead Redhead (2001), was a Poetry Book Society Recommendation. Her third collection is due from Bloodaxe in 2014. ","links":[]},{"id":10097,"type":0,"title":"Dorothy Hewett","text":"Dorothy Coade Hewett (21 May 1923 – 25 August 2002) was an Australian feminist poet, novelist, librettist and playwright. She was also a member of the Communist Party of Australia, though she clashed on many occasions with the party's leadership.","links":[]},{"id":10098,"type":0,"title":"Rita Ann Higgins","text":"Rita Ann Higgins was born in 1955 in Galway, where she still lives. One of 13 children, she left school at 14, and was in her late 20s when she started writing poetry. She has since published nine books of poetry, including Sunny Side Plucked (Poetry Book Society Recommendation) (1996), An Awful Racket (2001), Throw in the Vowels: New & Selected Poems (2005) and Ireland Is Changing Mother (2011) from Bloodaxe, and Hurting God: Prose & Poems (2010) from Salmon. Throw in the Vowels was reissued in 2010 with an audio CD of her reading her poems. Her plays include Face Licker Come Home (1991), God of the Hatch Man (1992), Colie Lally Doesn’t Live in a Bucket (1993), Down All the Roundabouts (1999), The Plastic Bag (2008) and The Empty Frame (2008). Her many awards include a Peadar O’Donnell Award in 1989 and several Arts Council bursaries, and she is a member of Aosdána. ","links":[]},{"id":10099,"type":0,"title":"Selima Hill","text":"Selima Hill grew up in a family of painters in farms in England and Wales, and has lived in Dorset for the past 25 years. She received a Cholmondeley Award in 1986, and was a Royal Literary Fund Fellow at Exeter University in 2003-06. She won first prize in the Arvon International Poetry Competition with part of The Accumulation of Small Acts of Kindness (1989), one of several extended sequences in Gloria: Selected Poems (Bloodaxe Books, 2008), which also includes work from Saying Hello at the Station (1984), My Darling Camel (1988), A Little Book of Meat (1993), Aeroplanes of the World (1994), Violet (1997), Bunny (2001), Portrait of My Lover as a Horse (2002), Lou-Lou (2004) and Red Roses (2006). Violet was a Poetry Book Society Choice and was shortlisted for all three of the UK’s major poetry prizes, the Forward Prize, T.S. Eliot Prize and Whitbread Poetry Award. Bunny won the Whitbread Poetry Award, was a Poetry Book Society Choice and was also shortlisted for the T.S. Eliot Prize. Lou-Lou and The Hat were Poetry Book Society Recommendations. Her most recent collections from Bloodaxe are The Hat (2008), Fruitcake (2009), and People Who Like Meatballs (2012), which was shortlisted for both the Forward Poetry Prize and the Costa Poetry Award. ","links":[]},{"id":10100,"type":0,"title":"Ellen Hinsey","text":"Ellen Hinsey has published three books of poems: Update on the Descent (Bloodaxe Books, 2009), a 2007 National Poetry Series Finalist; The White Fire of Time (Wesleyan University Press, USA, 2002; Bloodaxe Books, UK, 2003); and Cities of Memory (1996), winner of the Yale Younger Poets Award. She also edited and co-translated Tomas Venclova’s The Junction: Selected Poems (Bloodaxe Books, 2008). Her poems, essays and translations have appeared widely in publications such as The New York Times, The New Yorker, Poetry Review, Poetry and The Irish Times. Her translations of contemporary French fiction and memoir are published with Riverhead\/Penguin Books. Her other awards include a Berlin Prize Fellowship, a Rona Jaffe Foundation Writer’s Award and a Lannan Foundation Award. She has lived in Paris since 1987, and teaches writing and literature at Skidmore College’s program and the French graduate school, the École Polytechnique. ","links":[]},{"id":10101,"type":0,"title":"Jane Hirshfield","text":"Jane Hirshfield was born in 1953 in New York and lives in northern California. Her first book of poetry published in the UK was Each Happiness Ringed by Lions: Selected Poems (Bloodaxe Books, 2005), which draws on her collections Alaya (1982), Of Gravity & Angels (1988), The October Palace (1994), The Lives of the Heart (1997) and Given Sugar, Given Salt (2001). This was followed by two later collections, After (Bloodaxe Books, 2006), a Poetry Book Society Choice, which was shortlisted for the T.S. Eliot Prize, and Come, Thief (Bloodaxe Books, 2012). In 2008 Bloodaxe published Jane Hirshfield's lectures Hiddenness, Surprise, Uncertainty: Three Generative Energies of Poetry (Newcastle\/ Bloodaxe Poetry Lectures).Jane Hirshfield edited the bestselling anthology Women in Praise of the Sacred (1994), and co-translated The Ink Dark Moon: Poems by Ono No Komachi and Izumi Shikibu (1988) – another bestseller in the States – and, with Robert Bly, Mirabai: Ecstatic Poems (2004). Her own poetry was translated into Polish by Czeslaw Milosz, who also wrote the introduction to her Polish Selected Poems. She has won numerous literary awards. ","links":[]},{"id":10102,"type":0,"title":"Tony Hoagland","text":"Tony Hoagland was born in 1953 in Fort Bragg, North Carolina. His father was an Army doctor, and Hoagland grew up on various military bases throughout the South. He currently teaches at the University of Houston.His first collection, Sweet Ruin (1992), won the Brittingham Prize in Poetry. His second, Donkey Gospel (1998), won the James Laughlin Award of The Academy of American Poets. The third, What Narcissism Means to Me (2003), was shortlisted for a National Book Circle Critics Award. His first UK book of poems, What Narcissism Means to Me: Selected Poems (Bloodaxe Books, 2005) drew upon these three collections, and was followed by Unincorporated Persons in the Late Honda Dynasty (2010). He has also published Real Sofistikashun: Essays on Poetry and Craft (Graywolf Press, USA, 2006).He won the 2008 Jackson Poetry Prize, awarded by Poets & Writers magazine. In 2005 he received the O.B. Hardison Jr. Prize, awarded by the Folger Shakespeare Library; this is the only national prize to recognise a poet's teaching as well as his art. Hoagland also received the 2005 Mark Twain Award, given by the Poetry Foundation in recognition of a poet's contribution to humour in American poetry; of this award Stephen Young said, 'There is nothing escapist or diversionary about Tony Hoagland’s poetry. Here’s misery, death, envy, hypocrisy, and vanity. But the still sad music of humanity is played with such a light touch on an instrument so sympathetically tuned that one can’t help but laugh. Wit and morality rarely consort these days; it’s good to see them happily, often hilariously reunited in the winner’s poetry.' ","links":[]},{"id":10103,"type":0,"title":"Jane Holland","text":"Jane Holland was born in Ilford in 1966. After university and a time living in France, she moved to the Isle of Man, where she had two children and became a snooker champion, an ex-wife, a fallen star and a magazine editor. She won an Eric Gregory Award for her poetry in 1996. A selection of her poetry appears in Maura Dooley's Bloodaxe anthology of new women poets, Making for Planet Alice (1997) ","links":[]},{"id":10104,"type":0,"title":"Matthew Hollis","text":"Matthew Hollis was born in 1971 in Norwich, and now lives in London. He won an Eric Gregory Award in 1999. He is co-editor of 101 Poems Against War (Faber, 2003) and Strong Words: Modern Poets on Modern Poetry (Bloodaxe Books, 2000), and editor of the Selected Poems of Edward Thomas (Faber, 2011). He is poetry editor at Faber & Faber. After its shortlisting for the Forward Prize for Best First Collection, his first full-length collection Ground Water (Bloodaxe Books, 2004) was shortlisted for the Guardian First Book Award (the first time for a poetry book) and for the Whitbread Poetry Award. Ground Water was also a Poetry Book Society Recommendation. His biography, Now All Roads Lead to France: The Last Years of Edward Thomas (Faber, 2011), won the Costa Biography Award, the H.W. Fisher Biography Award and the Royal Society of Literature Jerwood Award for Non-Fiction, and was BBC Radio 4 Book of the Week. ","links":[]},{"id":10105,"type":0,"title":"Frances Horovitz","text":"Frances Horovitz (1938-85) was greatly loved and respected not only as a poet, but also as a broadcaster and performer of poetry. She was one of the finest poetry readers this country produced, possessing a rare ability to hear a poem and become its voice. She published four collections of poems, including Water Over Stone (Enitharmon Press, 1980) and Snow Light, Water Light (Bloodaxe Books, 1983). She died in 1983, aged 45, after a long illness. Her Collected Poems (1985) was edited by her husband, the poet and critic Roger Garfitt, with a new edition issued in 2011 with an audio CD of her reading her work included. ","links":[]},{"id":10106,"type":0,"title":"John Hughes","text":"John Hughes was born in Belfast in 1962. He was educated at St Patrick's High School, Downpatrick, and studied English and Scholastic Philosophy at Queen's University, Belfast. After working for a film workshop in Belfast, he lived in New York for three years. He now lives and works in Belfast. His poems have been published in many magazines and anthologies, including Poets from the North of Ireland and The New Younger Irish Poets from Blackstaff Press.","links":[]},{"id":10107,"type":0,"title":"Frieda Hughes","text":" Frieda Hughes was born in London in 1960, grew up in Devon, and after living in various parts of England and Australia now lives on the Welsh Borders. She wrote and painted from an early age, and for many years has been a painter and children’s writer. She has published four poetry collections with Bloodaxe, Wooroloo (1999), Stonepicker (2001), Waxworks (2002) and The Book of Mirrors (2009). She received a NESTA Award in 2002 to help her work on Forty-five, her portrait of her life in 45 poems and paintings, the poems from which were published by HarperCollins in the US in 2006.Her first children’s book, Getting Rid of Edna, was published by Heinemann (UK) and Harper & Row (USA) in 1984. Four other titles followed from Simon and Schuster: The Meal a Mile Long (1989) and Waldorf and the Sleeping Granny (1990), which she also illustrated; followed byThe Thing in the Sink (1992) and Rent-a-Friend (1994). Her most recent titles are The Tall Story (MacDonald Young Books, 1997) and Three Scary Stories (HarperCollins, 2001). ","links":[]},{"id":10108,"type":0,"title":"Paul Hyland","text":"Paul Hyland is an award-winning poet and travel writer who lives in Dorchester. His many publications include English topographical classics, travel books about Central Africa, India and Iberia, and most recently the acclaimed historical work Ralegh's Last Journey. He also wrote Bloodaxe's indispensable Getting into Poetry, described by Suzy Feay in Time Out as 'essential reading - the guide to the contemporary poetry scene', He performs the Art of the Impossible as a professional magician ","links":[]},{"id":10109,"type":0,"title":"Helen Ivory","text":"Helen Ivory was born in Luton in 1969 and began to write poems at Norwich School of Art in 1997, under the tuition of George Szirtes. She won an Eric Gregory Award in 1999 and then disappeared into a field in the Norfolk countryside to look after two thousand free-range hens. When she emerged ten or so years later, she had two collections with Bloodaxe Books and had helped, with her own bare hands, to build several houses.She is a poet and artist, a freelance creative writing tutor and academic director for creative writing for continuing education at the University of East Anglia, an editor for The Poetry Archive, editor of the webzine Ink Sweat and Tears, and co-organiser with Martin Figura of Café Writers in Norwich.She has published four collections with Bloodaxe Books, The Double Life of Clocks (2002), The Dog in the Sky (2006), The Breakfast Machine (2010) and Waiting for Bluebeard (2013). She was awarded an Arts Council writer’s bursary in 2005 and in 2008 an Author’s Foundation Grant. ","links":[]},{"id":10110,"type":0,"title":"Sarah Jackson","text":"Sarah Jackson was born in 1977, grew up in Berkshire and now lives in Nottingham. Her pamphlet Milk (Pighog, 2008) was shortlisted for the Michael Marks Award and her work appears in a number of magazines and anthologies, including Voice Recognition: 21 Poets for the 21st Century (Bloodaxe Books, 2009) and The Best British Poetry 2011 (Salt, 2011). She was awarded Arts Council funding in 2009 and has been shortlisted for the Arvon International Poetry Competition (2010) and the Edwin Morgan Prize (2011). Sarah completed a doctorate at the University of Sussex in 2009 and now lectures at Nottingham Trent University, where she runs the MA in Creative Writing. Pelt (Bloodaxe Books, 2012), her first book-length collection, won the Seamus Heaney Centre Prize for Poetry, and was longlisted for the Guardian First Book Award. ","links":[]},{"id":10111,"type":0,"title":"Kathleen Jamie","text":"Kathleen Jamie was born in Renfrewshire in 1962, and studied philosophy at Edinburgh University. She has published several collections of poetry, including Black Spiders (Salamander Press, 1982), A Flame in Your Heart, with Andrew Greig (Bloodaxe Books, 1986), The Way We Live (Bloodaxe Books, 1987), The Autonomous Region: poems and photographs from Tibet, with Sean Mayne Smith (Bloodaxe Books, 1993), The Queen of Sheba (Bloodaxe Books, 1994), Jizzen (Picador, 1999), The Tree House (Picador, 2004) and The Overhaul (Picador, 2012), as well as Mr and Mrs Scotland Are Dead: Poems 1980-1994 (Bloodaxe Books, 2002), which was shortlisted for the Griffin Poetry Prize.The Tree House won the 2004 Forward Poetry Prize and the 2005 Scottish Arts Council Book of the Year Award. The Overhaul won the 2012 Costa Poetry Award. She has received several other awards for her poetry, including a Somerset Maugham Award, the Forward Poetry Prize for Best Single Poem, a Paul Hamlyn Award and a Creative Scotland Award, and has twice won the Geoffrey Faber Memorial Prize. She also writes non-fiction. A travel book about Northern Pakistan, The Golden Peak (Virago, 1992), was updated and reissued by Sort Of Books as Among Muslims: Meetings at the Frontiers of Pakistan, in 2002. Findings (2005), a collection of essays and observations on her native Scotland, was followed by Sightlines (2012), essays based on a second set of journeys, both from Sort Of Books.She lives in Fife, and is a Fellow of the Royal Society of Literature. After teaching for many years at the University of St Andrews, she took up her present post of Professor of Creative Writing at the University of Stirling in 2011. ","links":[]},{"id":10112,"type":0,"title":"Linton Kwesi Johnson","text":"Linton Kwesi Johnson (aka LKJ) (born in Jamaica, 24 August 1952) is a UK-based dub poet. In 2002 he became the second living poet, and the only black poet, to be published in the Penguin Modern Classics series. His performance poetry involves the recitation of his own verse in Jamaican Patois over dub-reggae, usually written in collaboration with renowned British reggae producer\/artist Dennis Bovell. His middle name, \"Kwesi\", is Ghanaian.","links":[]},{"id":10113,"type":0,"title":"Jenny Joseph","text":" Jenny Joseph was born in Birmingham in 1932. She was first published by John Lehmann in the 1950s. Her first book of poems, The Unlooked-for Season (1960), won her an Eric Gregory Award, and she won a Cholmondeley Award for her second collection, Rose in the Afternoon (1974). Two further collections followed from Secker & Warburg, The Thinking Heart (1978) and Beyond Descartes (1983). Her Selected Poems was published by Bloodaxe Books in 1992, drawing on these four books. She is best-known for her poem 'Warning', a dramatic monologue in which a young woman talks of her fantasies of old age, voted Britain's favourite modern poem in a BBC poll in 2006. First published in Rose in the Afternoon, 'Warning' is included in her Bloodaxe Selected Poems: to view of her reading the poem, click on that page. Her other books include: Persephone (Bloodaxe Books, 1986), winner of the James Tait Black Memorial Prize; Beached Boats (Enitharmon Press, 1991), a collaboration with photographer Robert Mitchell; Ghosts and other company (Bloodaxe Books, 1995); a book of prose, Extended Similes (Bloodaxe Books, 1997), All the Things I See (Macmillan Children’s Books, 2000); a gardening memoir, Led by the Nose: A Garden of Smells (Souvenir Press, 2002); a collection of new and later selected poems, Extreme of things (Bloodaxe Books, 2006); and Nothing Like Love (Enitharmon Press, 2010), a selection of her love poems.She lives in Gloucestershire. ","links":[]},{"id":10114,"type":0,"title":"Sylvia Kantaris","text":"Sylvia Kantaris was born in 1936 in Derbyshire Peak District. She studied French at Bristol University, taught in Bristol and London, and then spent ten years in Australia, where she taught French at Queensland University, had two children, and wrote her M.A. and Ph.D. theses on French surrealism. Her articles on surrealism and poems were published widely in Australia and England in major periodicals and anthologies, including The Penguin Book of Modern Australian Verse. She was the joint winner of the Poetry Magazine Award in 1969.In 1974 she settled in Helston, Cornwall, and from 1976 to 1984 tutored Twentieth Century Poetry for the Open University. In 1986 she was appointed Cornwall’s first Writer in the Community, and in 1989 received an honorary D.Litt. from Exeter University.Her first two books of poems, Time & Motion (Prism\/Poetry Society of Australia, 1975) and the Tenth Muse (Peterloo Poets, 1983), were both reissued by Menhir Press in 1986. Her third collection, The Sea at the Door (Secker & Warburg, 1985), is no longer available. She has published two joint collections with other poets, News from the Front with D.M. Thomas (Arc, 1983), and The Air Mines of Mistila with Philip Gross (Bloodaxe Books, 1988), a poetry Book Society Choice.Her latest titles are Dirty Washing: New & Selected Poems (Bloodaxe Books, 1989), including work from all her previous books except The Air Mines of Mistila, and a new collection, Lad's Love (Bloodaxe Books, 1993). ","links":[]},{"id":10115,"type":0,"title":"Kapka Kassabova","text":"Kapka Kassabova was born in 1973 and grew up in Bulgaria until she was 16. Her family emigrated first to Britain, then to New Zealand where she lived until 2004. She now lives in the Scottish Highlands as a cultural mongrel working on a simplified version of her East European-Kiwi-Scots accent. She has published two poetry collections with Bloodaxe in the UK, Someone else’s life (2003), including work from two collections published in New Zealand as well as new poems, and Geography for the lost (2007). She has also published three novels, Reconnaissance (Penguin NZ, 1999), winner of the 2000 Commonwealth Writer’s Prize for Asia-Pacific, Love in the Land of Midas (Penguin NZ, 2001) and Villa Pacifica (Alma Books, 2010), and two memoirs, Street Without a Name (Portobello, 2008), a coming of age story at the end of Communism, and Twelve Minutes of Love: a tango story (Portobello, 2011). ","links":[]},{"id":10116,"type":0,"title":"Jackie Kay","text":"Jackie Kay was an adopted child of Scottish\/Nigerian descent brought up by white parents in Glasgow. She is one of Britain’s best-known poets, appearing frequently on radio and TV programmes on poetry and culture. In 2007 Bloodaxe published Darling: New & Selected Poems, which included almost all of her four previous books of poetry from Bloodaxe, The Adoption Papers (1991), Other Lovers (1993), Off Colour (1998) and Life Mask (2005). Her epic poem The Lamplighter, adapted for both radio and stage, was published by Bloodaxe in 2008, was followed by Fiere from Picador in 2011. Jackie Kay's fiction and non-fiction (from Picador) has been massively popular: her novel Trumpet (1998), two collections of short stories, Why Don’t You Stop Talking? (2002) and Wish I Was Here (2006), and her memoir Red Dust Road (2010), which won the Scottish Mortgage Investment Trust Book of the Year Award in 2011. She won the Somerset Maugham Award with Other Lovers, the Guardian Fiction Prize for Trumpet, Decibel Writer of the Year for Wish I Was Here and has twice won the Signal Poetry Award for her children’s poetry. Her fourth book of poetry for children, Red Cherry, Red, was published by Bloomsbury in 2007. The Adoption Papers is a set text on numerous school and university courses. She lives in Manchester, and was awarded an MBE for services to literature in 2006. She is Professor of Creative Writing at Newcastle University, and co-edited the anthology Out of Bounds (Bloodaxe Books \/ Newcastle University, 2012) with James Procter and Gemma Robinson. ","links":[]},{"id":10117,"type":0,"title":"Garrison Keillor","text":"Garrison Keillor is the host and writer of radio’s A Prairie Home Companion, and wrote the screenplay for Robert Altman’s film A Prairie Home Companion in which he also appears. A member of the American Academy of Arts and Letters, he is the author of Lake Wobegon Days (1985), The Book of Guys (1993), Love Me (2003), and and a trilogy of Lake Wobegon novels, Pontoon, Liberty and Pilgrims. Born in Anoka, Minnesota, in 1942, he graduated from the University of Minnesota, and lives in St Paul and New York.77 Love Sonnets (Common Good Books, USA, 2009; Bloodaxe Books, UK, 2011) is his first collection of his own poetry; he reads all the poems on two CDs issued separately from the book by Highbridge in the US but included with Bloodaxe's UK edition. ","links":[]},{"id":10118,"type":0,"title":"Brendan Kennelly","text":" Brendan Kennelly is one of Ireland’s most distinguished and best loved poets, as well as a renowned teacher and cultural commentator. Born in 1936 in Ballylongford, Co. Kerry, he was Professor of Modern Literature at Trinity College, Dublin for over 30 years, and retired from teaching in 2005.He has published more than 30 books of poetry, including Familiar Strangers: New & Selected Poems 1960-2004 (2004), which includes the whole of his book-length poem The Man Made of Rain (1998). He is best-known for two controversial poetry books, Cromwell, published in Ireland in 1983 and in Britain by Bloodaxe in 1987, and his epic poem The Book of Judas (1991), which topped the Irish bestsellers list: a shorter version was published by Bloodaxe in 2002 as The Little Book of Judas. His third epic, Poetry My Arse (1995), did much to outdo these in notoriety. All these remain available separately from Bloodaxe, along with his more recent titles: Glimpses (2001), Martial Art (2003), Now (2006), Reservoir Voices (2009), The Essential Brendan Kennelly: Selected Poems, edited by Terence Brown and Michael Longley, with audio CD (2011), and Guff (2013).His drama titles include When Then Is Now (2006), a trilogy of his modern versions of three Greek tragedies (all previously published by Bloodaxe): Sophocles’ Antigone and Euripides’ Medea and The Trojan Women. His Antigone and The Trojan Women were both first performed at the Peacock Theatre, Dublin, in 1986 and 1993 respectively; Medea premièred in the Dublin Theatre Festival in 1988, toured in England in 1989 and was broadcast by BBC Radio 3. His other plays include Lorca’s Blood Wedding (Northern Stage, Newcastle & Bloodaxe, 1996).His translations of Irish poetry are available in Love of Ireland: Poems from the Irish (Mercier Press, 1989). He has edited several anthologies, including The Penguin Book of Irish Verse (1970\/1981), Ireland’s Women: Writings Past and Present, with Katie Donovan and A. Norman Jeffares (Gill & Macmillan, 1994), and Dublines, with Katie Donovan (Bloodaxe Books, 1995), and published two early novels, The Crooked Cross (1963) and The Florentines (1967).His Journey into Joy: Selected Prose, edited by Åke Persson, was published by Bloodaxe in 1994, along with Dark Fathers into Light, a critical anthology on his work edited by Richard Pine. John McDonagh’s critical study Brendan Kennelly: A Host of Ghosts was published in The Liffey Press’s Contemporary Irish Writers series in 2004. ","links":[]},{"id":10119,"type":0,"title":"Jane Kenyon","text":"The work of America’s Jane Kenyon (1947-95) is one of poetry’s rarest and most heart-breaking gifts. After fighting depression for most of her life, Jane Kenyon died from leukaemia at the age of 47. Her quietly musical poems are intensely moving, compassionate meditations intently probing the life of the heart and spirit. Observing and absorbing small miracles in everyday life, these apparently simple poems grapple with fundamental questions of human existence. They are psalms of love and death, God and nature, joy and despair. ","links":[]},{"id":10120,"type":0,"title":"Galway Kinnell","text":"Galway Kinnell was born in Providence, Rhode Island, in 1927. He made his living mostly from teaching from 1949 to 2005, in France, Iran and Australia as well as at colleges and universities across America. He was Erich Maria Remarque Professor of Creative Writing at New York University for many years, and served as a Chancellor of the Academy of American Poets from 2001 to 2007. In 1982 his Selected Poems won a Pulitzer Prize and a National Book Award. An updated and expanded edition was published as Selected Poems by Bloodaxe in Britain in 2001. He has also published several translations, including books by Goll, Lorca, Rilke and Villon, and Yves Bonnefoy’s On the Motion and Immobility of Douve in the Bloodaxe Contemporary French Poets series (1992). His latest collection, Strong Is Your Hold, published with an audio CD in 2007 by Bloodaxe, includes his long poem 'When the Towers Fell', a requiem for those who died in the World Trade Center on 9\/11 in direct view of his New York apartment. He now lives only in a remote part of northern Vermont, in the house he bought as a wreck in the 60s, where he has written much of his work. ","links":[]},{"id":10121,"type":0,"title":"John Kinsella","text":"Born in 1963, John Kinsella has published a dozen books of poetry in Australia, and three in Britain. His Poems 1980-1994 is published by Bloodaxe simultaneously with the Hunt, whole The Silo: A Pastoral Symphony is available seperately, from Arc. He lives in Cambridge and divides his time between Britain and Australia; he is a By-Fellow of Churchill College.","links":[]},{"id":10122,"type":0,"title":"Helen Kitson","text":"Helen Kitson is an award-winning poet and short story writer. She was born in Leicester and lives in Worcester with her husband and two children. She is an Open University student, studying towards a BA in Humanities with Art History. She began writing poetry seriously in 1990, having fallen in love with Sylvia Plath’s poetry at the age of seventeen. ","links":[]},{"id":10123,"type":0,"title":"Stephen Knight","text":"Stephen Knight's first collection, Flowering Limbs, was a Poetry Book Society Choice, and was shortlisted for the Mail on Sunday\/John Llewllyn Rhys Prize. Dream City Cinema was shortlisted for the T.S. Eliot Prize. Born in Swansea, Knight now lives in London where he works as a freelance writer and theatre director.","links":[]},{"id":10124,"type":0,"title":"Arun Kolatkar","text":" Arun Kolatkar was born in 1931 in Kolhapur, Maharashtra, India. He grew up in a traditional patriarchal Hindu extended family, describing their crowded home as 'a house of cards…the rooms had mudfloors which had to be plastered with cowdung every week to keep them in good repair'. He was educated at Rajaram High School in Kolhapur, where lessons were taught in Marathi, and at the J.J. School of Art in Bombay, also attending art schools in Kolhapur and Pune, graduating in 1957. He spent several years trying to make a living before turning to work as an art director and graphic designer for several advertising agencies in Bombay, achieving great success in this field.He wrote prolifically, in both Marathi and English, publishing in magazines and anthologies from 1955, but did not bring out a book of poems before Jejuri (1976), which won him the Commonwealth Poetry Prize and was later published in the US in the NYRB Classics series (2005). His third Marathi publication, Bhijki Vahi, won a Sahitya Akademi Award in 2004. A reclusive figure all his life, he lived without a telephone, and was hesitant about publishing his work. It was only after he was diagnosed with cancer that two further volumes of his poetry in English were brought out by friends, Kala Ghoda Poems and Sarpa Satra in 2004. He died not long afterwards. A further posthumous selection, The Boatride and Other Poems (2008), edited by Arvind Krishna Mehrotra, contained his previous uncollected English poems as well as translations of his Marathi poems; among the book's surprises were his translations of bhakti poetry, song lyrics, and a long love poem, the only one he wrote, cleverly disguised as light verse. His Collected Poems in English (Bloodaxe Books, 2010), edited by Arvind Krishna Mehrotra, brings together work from all those volumes. ","links":[]},{"id":10125,"type":0,"title":"Jean Hanff Korelitz","text":"Jean Hanff Korelitz (born May 16, 1961) is an American novelist and essayist. Korelitz was born and raised in New York City. After graduating from Dartmouth College with a major in English she continued her studies at Clare College, Cambridge. At Cambridge, she was awarded the Chancellor's Gold Medal. While living in England Korelitz met Irish poet Paul Muldoon. The couple married on August 30, 1987, and went on to have two children: Dorothy (born 1992) and Asher (born 1999). From 1990 on they have lived in Princeton, NJ, where Muldoon has long taught creative writing. ","links":[]},{"id":10126,"type":0,"title":"Li-Young Lee","text":"Li-Young Lee has published three collections in the States, Rose (1986), winner of the Delmore Schwartz Memorial Award, The City in Which I Love You (1991), the 1990 Lamont Poetry Selection, and Book of My Nights (2001), as well as a memoir, The Winged Seed: A Remembrance (1995), which received an American Book Award from the Before Columbus Foundation. He has received many other awards, including fellowships from the National Endowment for the Arts, the Lannan Foundation, and the John Simon Guggenheim Memorial Foundation, and the Writer’s Award from the Mrs Giles Whiting Foundation. He lives in Chicago, Illinois. From Blossoms: Selected Poems (Bloodaxe Books, 2007) is his first British publication. ","links":[]},{"id":10127,"type":0,"title":"Denise Levertov","text":"Denise Levertov (1923-97) was born in Essex, and educated at home by her father, a Russian Jewish immigrant, who became an Anglican priest, and by her Welsh mother. She sent her poems as a child to T S Eliot, who admired and encouraged her. In 1948, she emigrated to America, where she was acclaimed by Kenneth Rexroth in The New York Times as 'the most subtly skilful poet of her generation, the most profound, the most modest, the most moving,' and during the following decades she became 'a poet who may just be the finest writing in English today' (Kirkus Reviews). Throughout her life, she worked also as a political activist, campaigning tirelessly for civil rights and environmental causes, and against the Vietnam War, the Bomb and US-backed regimes in Latin America. ","links":[]},{"id":10128,"type":0,"title":"Philip Levine","text":" Philip Levine was born in 1928 in Detroit, where he studied at Wayne University. After working as a labourer, he settled in Fresno, California, and also lived in other countries for some time, including Spain. He taught at Fresno until his retirement, and now divides his time between Fresno and Brooklyn, New York. Levine has received many awards for his poetry, including the National Book Award (1980 & 1991), and the Pulitzer Prize in 1995 for The Simple Truth. He has published 17 collections of poems and two books of essays, and was appointed US Poet Laureate in 2011 at the age of 83. Stranger to Nothing: Selected Poems (Bloodaxe Books, UK, 2006) covers his American collections from On the Edge (1963) to Breath (2004). It is his first UK publication since Secker published an earlier Selected Poems in 1984. He has since published a later collection, News of the World (Knopf, 2009). ","links":[]},{"id":10129,"type":0,"title":"Gwyneth Lewis","text":"Gwyneth Lewis was Wales’s National Poet from 2005 to 2006, the first writer to be given the Welsh laureateship. Her first six books of poetry in Welsh and English were followed by Chaotic Angels (2005) from Bloodaxe, which brings together the poems from her English collections, Parables & Faxes, Zero Gravity and Keeping Mum, and by A Hospital Odyssey (2010), and Sparrow Tree (2011), winner of the Roland Mathias Poetry Award (Wales Book of the Year) in 2012. Her other books include Sunbathing in the Rain: A Cheerful Book about Depression (Flamingo, 2002) and Two in a Boat: A Marital Voyage (Fourth Estate, 2005) and The Meat Tree: new stories from the Mabinogion (Seren, 2010). Her Welsh collection, Y Llofrudd Iaith (Barddas, 2000), won the Welsh Arts Council Book of the Year Prize, and her last English collection, Keeping Mum was shortlisted for the same prize. Both Zero Gravity and Keeping Mum were Poetry Book Society Recommendations. Gwyneth Lewis composed the words on the front of the Wales Millennium Centre in Cardiff, opened in 2004. She lives in Cardiff. ","links":[]},{"id":10130,"type":0,"title":"Yang Lian","text":"Yang Lian was one of the original Misty Poets who reacted against the strictures of the Cultural Revolution. Born in Switzerland, the son of a diplomat, he grew up in Beijing and began writing when he was sent to the countryside in the 1970s. On his return he joined the influential literary magazine Jintian (Today). His work was criticised in China in 1983 and formally banned in 1989 when he organised memorial services for the dead of Tiananmen while in New Zealand. He was a Chinese poet in exile from 1989 to 1995, finally settling in London in 1997. Translations of his poetry include three collections with Bloodaxe, Where the Sea Stands Still (1999), a Poetry Book Society Recommended Translation, Concentric Circles (2005), and Lee Valley Poems (2009), as well as his long poem Yi (Green Integer, USA, 2002) and Riding Pisces: Poems from Five Collections (Shearsman, 2008), a compilation of earlier work. He is co-editor with W.N. Herbert of Jade Ladder: Contemporary Chinese Poetry (Bloodaxe Books, 2012), and was awarded the International Nonino Prize in 2012.","links":[]},{"id":10131,"type":0,"title":"Joanne Limburg","text":"Joanne Limburg was born in London in 1970, and studied Philosophy at Cambridge. She has since gained an MA in Psychoanalytic Studies, and now works as an Associate Lecturer for the Open University. She won an Eric Gregory Award for her poetry in 1998, and her first book, Femenismo (Bloodaxe, 2000), was shortlisted for the Forward Prize for Best First Collection. Her second collection, Paraphernalia (Bloodaxe, 2007), was a Poetry Book Society Recommendation. Her latest book is The Woman Who Thought Too Much (Atlantic Books, 2010), a memoir about OCD, anxiety and poetry.","links":[]},{"id":10132,"type":0,"title":"Jackie Litherland ","text":"S.J. Litherland's work encompasses love, politics, loss, and philosophy. She has six published collections of poetry, The Long Interval (Bloodaxe 1986), Flowers of Fever (Iron Press 1992), The Apple Exchange (Flambard 1999), The Work of the Wind (Flambard 2006), The Homage (Iron Press 2006) and The Absolute Bonus of Rain (Flambard 2010).Her highly praised The Work of the Wind is a four-part book about her years with the poet Barry MacSweeney and The Homage is a sequence of poems about cricket and former England captain Nasser Hussain which was nominated for Cricket Book of the Year. Her work has appeared in various anthologies, most notably in New Women Poets (Bloodaxe 1993), Forward Book of Poetry 2001 and North by North East (Iron 2006). She was co-editor of The Poetry of Perestroika (Iron) and has edited many books. She has received two Northern Writers' Awards, 1994, 2000. Originally from Warwickshire, she has lived in Durham City since 1965, bringing up a son and daughter and working as a journalist (as Jackie Levitas). Now a part-time tutor and mentor in creative writing, she is also a founding member of Vane Women writers collective and press. She has four grandsons. ","links":[]},{"id":10133,"type":0,"title":"Marion Lomax","text":"Marion Lomax was born in 1953 in Newcastle, and grew up in Northumberland. After living in Berkshire for many years, she now divides her time between London and Aberdeen. She gained her doctorate from the University of York in 1983, and her study of Elizabethan and Jacobean drama was published by CUP in 1987. She has edited four plays by John Ford (OUP, 1995) and The Rover by Aphra Benn (New Mermaids, 1995), and is now Professor of English at St Mary's University College, Strawberry Hill, where she has taught since 1987. In 1981, she received an Eric Gregory Award from the Society of Authors, and won first prize in the Cheltenham Festival Poetry Competition. Her libretto for the opera Beyond Men and Dreams (composer, Bennett Hogg) was performed by the Royal Opera House Garden Venture in 1991. In 1993, she held a Hawthornden International Fellowship. Her first book of poems, The Peepshow Girl, appeared from Bloodaxe in 1989. ","links":[]},{"id":10134,"type":0,"title":"Edna Longley","text":"Edna Longley is a Professor Emerita in the School of English, Queen’s University Belfast. Her publications include an edition of Edward Thomas’s prose writings, A Language Not To Be Betrayed (1981) from Carcanet, and four critical books: Louis MacNeice: A Study (1988) from Faber, and Poetry in the Wars (1986), The Living Stream: Literature & Revisionism in Ireland (1994) and Poetry & Posterity (2000) from Bloodaxe. She also edited The Bloodaxe Book of 20th Century Poetry (2000) and Edward Thomas: The Annotated Collected Poems (Bloodaxe, 2008). ","links":[]},{"id":10135,"type":0,"title":"Hannah Lowe","text":"Hannah Lowe was born in Ilford to an English mother and Jamaican-Chinese father. She has lived in London, Brighton and Santa Cruz, California. She studied American Literature at the University of Sussex and has a Masters degree in Refugee Studies. She has worked as a teacher of literature and creative writing, and is currently studying for a PhD. Her pamphlet The Hitcher (The Rialto, 2011) was widely praised. Her first book-length collection Chick (Bloodaxe Books, 2013) is shortlisted for both the Forward Prize for Best First Collection and the Fenton Aldeburgh First Collection Prize. ","links":[]},{"id":10136,"type":0,"title":"Roddy Lumsden","text":"Roddy Lumsden’s first book Yeah Yeah Yeah (1997) was shortlisted for Forward and Saltire prizes. His second collection The Book of Love (2000), a Poetry Book Society Choice, was shortlisted for the T.S. Eliot Prize. Mischief Night: New & Selected Poems (Bloodaxe Books, 2004) was a Poetry Book Society Recommendation. His latest collections are Third Wish Wasted (2009) and Terrific Melancholy (2011). His anthology Identity Parade: new British and Irish poets was published by Bloodaxe Books in 2010. He is a freelance writer, specialising in quizzes and word puzzles, and has held several residencies, including ones with the City of Aberdeen, St Andrews Bay Hotel, and as “poet-in-residence” to the music industry when he co-wrote The Message, a book on poetry and pop music (Poetry Society, 1999). His other books include Vitamin Q: a temple of trivia, lists and curious words (Chambers Harrap, 2004). Born in St Andrews, he lived in Edinburgh before moving to London. ","links":[]},{"id":10137,"type":0,"title":"Mairi MacInnes","text":"Mairi MacInnes was born in 1925 in Co. Durham and educated in Yorkshire and at Somerville College, Oxford. In 1954 she married the American scholar and writer John McCormick and went to live with him in West Berlin, then an enclave in Communist East Germany, and from 1959 to 1988 in America, except for years in Mexico and Spain. She and her husband now live in York, England. They have four children and two grandchildren. In the US, she published two collections, and won National Endowment in the Arts, New Jersey Arts and Ingram-Merrill Fellowships.","links":[]},{"id":10138,"type":0,"title":"Kona Macphee","text":"Kona Macphee was born in London and grew up in Australia, where she worked as a waitress, shop assistant and apprentice motorbike mechanic. She studied musical composition at the Sydney Conservatorium, violin at the University of Sydney, and computer science and robotics at Monash University, later taking an M.Sc. at Cambridge as a Commonwealth Scholar. She received an Eric Gregory Award for her poetry in 1998, and has published three collections with Bloodaxe, Tails (2004); Perfect Blue (2010), winner of the Geoffrey Faber Memorial Prize in 2011; and What Long Miles (2013). She is a freelance writer and software developer, and lives in Crieff, Perthshire. ","links":[]},{"id":10139,"type":0,"title":"Barry MacSweeney","text":" Barry MacSweeney was born in 1948 in Newcastle. After leaving school at 16, he worked as a journalist, mainly in Newcastle, Kent, Bradford and South Shields. He published numerous collections, including an earlier Selected Poems in The Tempers of Hazard, published and destroyed by Paladin in 1993.The Book of Demons (Bloodaxe Books, 1997), was a Poetry Book Society Recommendation. He won a Paul Hamlyn Award in 1997. He died in 2000. Two posthumous books appeared after his death, both in 2003, Wolf Tongue: Selected Poems 1965-2000 from Bloodaxe Books, and Horses in Boiling Blood: MacSweeney, Apollinaire: a collaboration, a celebration, from Equipage. ","links":[]},{"id":10140,"type":0,"title":"Jennifer Maiden","text":"Jennifer Maiden was born in 1949 in Penrith, New South Wales, where she still lives. After starting to publish in the late 1960s, she took a BA at Macquarie University, and has been an active presence in the Sydney literary scene for the past four decades. Her first UK publication, Intimate Geography: Selected Poems 1991-2010 (Bloodaxe Books, 2012) draws on her four most recent collections: Acoustic Shadow (Penguin Australia, 1993), Mines (Paper Bark, 1999), Friendly Fire (Giramondo, 2005) and Pirate Rain (Giramondo, 2010). She has published ten other books of poetry in Australia along with two novels, the second of which, Play With Knives, was translated into German as Ein Messer im Haus (dtv, 1994).Among her many accolades are the NSW Premier's Kenneth Slessor Prize for Poetry (she is the only writer to have won this three times, most recently for Pirate Rain), the C.J. Dennis Prize for Poetry, the Harri Jones Memorial Prize, the H.M. Butterly-F.Earle Hooper Award (University of Sydney), the Grenfell Henry Lawson Festival Prize, the FAW Christopher Brennan Award for lifetime achievement in poetry, Melbourne Age Poetry Book of the Year (twice), and Melbourne Age Book of the Year.As well as writing and running writers' workshops with a variety of literary, community and educational organisations, she has co-written (with Margaret Cunningham) a manual of questions to facilitate writing by torture and trauma victims. She has had residencies at the Australian National University, the University of Western Sydney, Springwood High School and the New South Wales Torture and Trauma Rehabilitation Service, and has been awarded several Fellowships by the Australia Council. ","links":[]},{"id":10141,"type":0,"title":"Maitreyabandhu","text":"Maitreyabandhu was born Ian Johnson in 1961, in Henley-in-Arden, Warwickshire. His parents ran a coach firm on the High Street. Initially trained as a nurse at the Walsgrave Hospital, Coventry, he went on to study fine art at Goldsmiths College, London, alongside Sarah Lucas and Damien Hirst. He started attending classes at the London Buddhist Centre (LBC) in 1986, and moved into a residential community above the LBC in 1987. He was ordained into the Triratna Buddhist Order in 1990 and given the name Maitreyabandhu. Since then he has lived and worked at the LBC, teaching Buddhism and meditation. He has written two books on Buddhism, Thicker than Blood: Friendship on the Buddhist Path (2001) and Life with Full Attention: a Practical Course in Mindfulness (2009), both with Windhorse Publications. His forthcoming book, The Journey and the Guide, also with Windhorse, is due in 2014. In 2010 he founded Poetry East, a poetry venue exploring the relationship between spiritual life and poetry, and attracting many of Britain's foremost poets, including Jo Shapcott, David Constantine, Don Paterson and Sean O’Brien.Maitreyabandhu has won the Keats-Shelley Prize, the Basil Bunting Award, the Geoffrey Dearmer Prize, and the Ledbury Festival Poetry Competition. His first pamphlet The Bond won the Poetry Business Book and Pamphlet Competition (2010) and was shortlisted for the Michael Marks Award. Vita Brevis, his second pamphlet, won the iOTA Shots Award (2011). His first book-length collection, The Crumb Road, is published by Bloodaxe in 2013 and is a Poetry Book Society Recommendation. He has published articles exploring the relationship between spiritual life and poetry in Poetry Review, Magma, Agenda, Assent, and In Their Own Words: Contemporary Poets on their Poetry (Salt, 2012). His poems have been anthologised in both the UK and USA. ","links":[]},{"id":10142,"type":0,"title":"Gerald Mangan","text":"Glasgow-born Mangan has lived and worked in various parts of Scotland and Ireland, and in France, where he now resides. He is a poet, cartoonist, playwright and journalist, having been resident playwright at Theatre Workshop in Edinburgh in the mid-1970s, and later poet-in-residence at Dundee College of Arts; he now writes and illustrates for the Times Literary Supplement and other journals. His collection Waiting for the Storm was published by Bloodaxe in 1990. ","links":[]},{"id":10143,"type":0,"title":"Jack Mapanje","text":"Jack Mapanje is a poet, linguist, editor and human rights activist. He received the 1988 Rotterdam Poetry International Award for his first book of poems, Chameleons and Gods (1981) and the USA’s Fonlon-Nichols Award for his contribution to poetry and human rights. His latest collection, Beasts of Nalunga (Bloodaxe Books, 2007), was shortlisted for the Forward Prize for Best Collection. Jack Mapanje was head of the Department of English at the University of Malawi when the Malawi authorities arrested him in 1987 after his first book of poems had been banned, and he was released in 1991 after spending three years, seven months and sixteen days in prison, following an international outcry against his incarceration. He has since published four poetry books, The Chattering Wagtails of Mikuyu Prison (1993), Skipping Without Ropes (Bloodaxe, 1998), The Last of the Sweet Bananas: New & Selected Poems (Bloodaxe, 2004) and Beasts of Nalunga (Bloodaxe, 2007), as well as three anthologies, Oral Poetry from Africa (1983), Summer Fires: New Poetry of Africa (1983) and The African Writers’ Handbook (1999); and he edited the acclaimed Gathering Seaweed: African Prison Writing (2002). His latest book is his prison memoir And Crocodiles Are Hungry at Night (Ayebia Clarke Publishing, 2011). Mapanje has held residences in the Netherlands, the Republic of Ireland and throughout Britain, including two years with the Wordsworth Trust at Dove Cottage in Cumbria. He lives in exile in York with his family, and is currently a visiting professor in the faculty of art at York St John University. ","links":[]},{"id":10144,"type":0,"title":"Don Marquis","text":"Don Marquis was considered by many to be the successor to Mark Twain as America's foremost wit. He was a daily newspaper columnist for the New York Sun and, later, the Herald Tribune. He invented a great many characters to express his and their opinions on the issues of the day, partly in order to fulfillthe constant need for material to fill his column. Two of his most memorable and much-loved characters are Archy the Cockroach and Mehitabel the Alley Cat (the pair who, together, make up the Bloodaxe titles Archyology i and ii), who now, over half a century after Marquis' death, are still able to endure. ","links":[]},{"id":10145,"type":0,"title":"William Martin","text":"William Martin (1925-2010) was born in New Silksworth, Co. Durham. During the Second World War, he was a radio technician in the RAF, based near Karachi, where he was inspired by the Eastern religious and philosophical traditions. After being demobbed he became a gas fitter and later served in the Audiology Department of Sunderland Royal Infirmary, retiring as Head of Department. He lived in Sunderland since the 1950s.He was an active member of CND for many years, taking part in the ritual boarding of nuclear submarines in Holy Loch, Scotland in 1961. He became an artist and had work purchased and exhibited by Sunderland Art Gallery. However, oil paints and a young family were not an easy combination, and poetry became his medium from the mid 1960s onwards.For some years he wrote without any recognition, but in 1971 he had a book of poetry published to commemorate the Wearmouth 1300 Festival (Tidings of our Bairnsea). This was later followed by Cracknrigg (1983) and Hinny Beata (1987) with Taxus, and Marra Familia (1993) and Lammas Alanna (2000) with Bloodaxe. ","links":[]},{"id":10146,"type":0,"title":"Harry Martinson","text":"Harry Martinson was born at Jämshög, Sweden, in 1904. He was left an orphan at an early age, and after a chequered childhood, in which the children's homes and institutions were as numerous as the escapes, he went to sea at the age of 16, spending six years of his life on board various ships and as a workman in foreign countries.It was from these travels and years of work in environments of all kinds that he later drew material and inspiration for his literary efforts - a couple of books of prose with glimpses, views and memories of the world of coal-heated ships during the 1920s.These accounts were followed a few years later by one or two books with an autobiographical strain and fictional recollections of a boarded-out child's existence, especially the child's own way of perceiving and trying to understand life and the people in it.Side by side with this psychological cognition of the childhood land of memory, there appeared some collections of poetry which were continued by degrees in a series of nature studies in prose, in which words and observation are combined in what the author has called 'thinking out in the meadow'.In a later work, the novel Vägen till Klockrike, the description of the human side is devoted entirely to the relationship between the settled and the itinerant man within ourselves. A world of journeying in a still wider sense emerges in Aniara, an epic work about an imagined space flight with a perspective in depth towards our own time. In it, jostling for room in our consciousness, are our fears and our questions as to where we are heading, together with the planet that our generation is treating as it does.Harry Martinson died in 1978.The above biographical note is reprinted from Nobel Lectures, Literature 1968-1980, Editor-in-Charge Tore Frängsmyr, Editor Sture Allén, World Scientific Publishing Co., Singapore, 1993. Harry Martinson's Chickweed Wintergreen: Selected Poems, translated by Robin Fulton with an introduction by Staffan Söderblom, is published by Bloodaxe Books in 2010. ","links":[]},{"id":10147,"type":0,"title":"Jill Maughan","text":"Born in Newcastle in 1958 grew up in Chester-le-Street going to scholl at Polam Hall in Darlington. worked in Journalism and social work did a degree in communication studies at Sunderland Polytechnic and then worked as a publicity officer at Castle Chare Community Arts Centre in Durham City. She was the joint winner of the first Newcastle Evening Chronicle poetry competition in 1984.","links":[]},{"id":10148,"type":0,"title":"Glyn Maxwell","text":"Glyn Maxwell was born in 1962 in Welwyn Garden City, where he grew up. He studied English at Oxford and poetry at Boston University. As well as his four poetry books, he has published a novel, Blue Burneau (Chatto, 1994), shortlisted for the Whitbread First Novel Prize, and three verse plays in Gnyss the Magnificent (Chatto, 1993). He currently teaches poetry at Amherst College in Massachusetts, where he lives with his wife and daughter. ","links":[]},{"id":10149,"type":0,"title":"Medbh McGuckian","text":"Medbh McGuckian was born in 1950 in Belfast where she lives with her family. Her previous books were published by Oxford University Press: The Flower Master (1982), Venus and the Rain (1984) and On Ballycastle Beach (1988). She won first prize in the National Poetry Competition in 1979, and her poems have since been published in all the major anthologies of British and Irish poetry. ","links":[]},{"id":10150,"type":0,"title":"W. S. Merwin","text":"W.S. Merwin is Poet Laureate of the United States for 2010-11. He has been awarded most of the principal prizes in American poetry, including the Pulitzer Prize (twice), the Bollingen Prize and the Tanning Prize and a Lannan Lifetime Achievement Award. Bloodaxe published his Selected Poems in 2007, prior to which his poetry had been unavailable in Britain for over 35 years. As well as being an internationally renowned poet, W.S. Merwin is the author of many classic translations, including editions of Neruda, Dante, The Song of Roland, The Poem of the Cid, and (from Bloodaxe) Sir Gawain and the Green Knight. His latest titles from Bloodaxe are Selected Poems (2007) and The Shadow of Sirius (2009), which won him his second Pulitzer Prize and was a Poetry Book Society Recommendation. Neil Astley's anthology Bloodaxe Poetry Introductions: 3 (2007) includes a selection of his poems with extracts from interviews and other prose. Born in New Jersey City in 1927, he taught at several universities, and now lives on the Pacific island of Maui, where he tends to his writing and to his garden of rare and endangered palm trees. ","links":[]},{"id":10151,"type":0,"title":"Adrian Mitchell","text":"Adrian Mitchell (1932-2008) was a prolific poet, playwright and children’s writer. His poetry’s simplicity, clarity, passion and humour show his allegiance to a vital, popular tradition embracing William Blake as well as the Border Ballads and the blues. His most nakedly political poems – about nuclear war, Vietnam, prisons and racism – became part of the folklore of the Left, sung and recited at demonstrations and mass rallies. After Allison & Busby stopped publishing poetry, he brought his work to Bloodaxe. Adrian Mitchell’s Greatest Hits: His 40 Golden Greats (1991) was followed by Heart on the Left: Poems 1953-1984 (1997), Blue Coffee: Poems 1985-1996 (1996), All Shook Up: Poems 1997-2000 (2000), The Shadow Knows: Poems 2000-2004 (2004) and the posthumous Tell Me Lies: Poems 2005-2008 (2009), and then by his retrospective Come On Everybody: Poems 1953-2008 (2012). His collected poems for children, Umpteen Pockets (Orchard Books), and Shapeshifters, his versions of Ovid’s Metamorphoses, illustrated by Alan Lee (Frances Lincoln), were both published in 2009. Born in London in 1932, Adrian Mitchell worked as a journalist from 1955 to 1966, when he became a full-time writer. He gave many hundreds of readings throughout the world in theatres, colleges, pubs, prisons, streets, public transport, rallies, cellars, clubs and schools of all kinds. Many of his plays and stage adaptations were performed at the National Theatre as well as by the Royal Shakespeare Company and other theatre companies. In 2002, the socialist magazine Red Pepper dubbed him Shadow Poet Laureate and asked him to write regular republican poems for their columns. In a National Poetry Day poll in 2005, his poem ‘Human Beings’ was voted the poem that most people would like to see launched into space. ","links":[]},{"id":10152,"type":0,"title":"John Montague","text":"John Montague (born 28 February 1929) is an Irish poet. He was born in New York and brought up in Tyrone. He has published a number of volumes of poetry, two collections of short stories and two volumes of memoir. He is one of the best known Irish contemporary poets. In 1998 he became the first occupant of the Ireland Chair of Poetry(virtually Ireland's Poet laureate.)","links":[]},{"id":10153,"type":0,"title":"Esther Morgan ","text":"Esther Morgan was born in Kidderminster, Worcestershire. She first started writing poetry while working as a volunteer at the Wordsworth Trust in Grasmere, Cumbria. After completing an MA in Creative Writing at the University of East Anglia in 1997, she taught on UEA's undergraduate creative writing course and for the Department of Continuing Education. After a teaching exchange to Edith Cowan University in Perth, Australia, Morgan returned to UEA where she edited four editions of the poetry anthology Reactions. She was awarded an Eric Gregory Award in 1998 and her first collection, Beyond Calling Distance, was published by Bloodaxe in 2001. It won the Aldeburgh First Collection Prize and was shortlisted for the John Llewellyn Rhys Prize. Her second collection, The Silence Living in Houses (Bloodaxe Books, 2005), was largely inspired by her time caretaking a run-down Edwardian house in Goring-on-Thames, Oxfordshire. In 2010 she won the Bridport Poetry Prize for her poem 'This Morning', included in her third collection Grace (Bloodaxe Books, 2011), a Poetry Book Society Recommendation, which is shortlisted for the T.S. Eliot Prize. As well as freelance teaching and editing work, Esther Morgan is currently Historic Recordings Manager for the Poetry Archive, the world's largest online collection of poets reading their own work: www.poetryarchive.org. After four years in Oxfordshire, she moved back to East Anglia, and now lives in Suffolk. ","links":[]},{"id":10154,"type":0,"title":"Vincent Morrison","text":"Vincent Morrison was born in Sunderland in 1952.","links":[]},{"id":10155,"type":0,"title":"Richard Murphy","text":"Born in 1927 at Milford, near Kilmaine, County Mayo, Richard Murphy spent part of his childhood in Ceylon, where his father was the last British Mayor of Colombo. From the age of eight, he attended boarding schools in Ireland and England, winning a scholarship to Oxford at seventeen. After years of displacement, marriage and divorce, he returned to Inishbofin in 1959 and settled for twenty years at Cleggan, writing there and on Omey and alone on High Island. He moved to Dublin in 1980, detaching himself from the beloved country of his past the better to reach it in poetry. Living since 2007 near Kandy in Sri Lanka, he finished this book while building a clay-tiled Octagon on a hill-top, for writing, meditation and yoga.Richard Murphy won the Æ Memorial Award for his poetry in 1951. His lyric ‘Years Later’, which concludes the narrative of ‘The Cleggan Disaster’, won first prize in the Guinness Awards at the Cheltenham Literary Festival of 1962. The poem was submitted with a pseudonym and the judges were George Hartley, founder of the Marvell Press, Sylvia Plath, and the critic John Press.His collection Sailing to an Island (Faber) was the Poetry Book Society Spring Choice in 1963. The Battle of Aughrim followed from Faber, and from Knopf in the US, in 1968.He received an Arts Council Award in Britain 1967 and received the Marten Toonder Award from the Arts Council of Ireland in 1980. He became a Fellow of the Royal Society of Literature in 1969 and a Member of Aosdána in 1982, and received the American Irish Foundation Literary Award in 1983. He received the Society of Authors Foundation Award in 2002.The Price of Stone (Faber, 1985) was a Poetry Book Society Recommendation. The Mirror Wall (Bloodaxe Books, 1989) received the Poetry Book Society Translation Award. His Collected Poems (Gallery Press, Ireland, and Wake Forest University Press, USA, 2000) was shortlisted for the Irish Times Poetry Prize. The Kick: a Memoir (Granta Books, 2002) was shortlisted for the J.R. Ackerley Prize in 2002.His retrospective The Pleasure Ground: Poems 1952-2012 is published by Bloodaxe Books in Britain and by Lilliput Press - under the title Poems 1952-2012 - in Ireland in 2013, and is a Poetry Book Society Special Commendation. ","links":[]},{"id":10156,"type":0,"title":"Grace Nichols","text":"Born in Guyana, Grace Nichols has lived in Britain since 1977. Her first collection, I is a Long Memoried Woman (1983) won the Commonwealth Poetry Prize. Her later poetry collections – published by Virago – include The Fat Black Woman’s Poems (1984), Lazy Thoughts of a Lazy Woman (1989), Sunris (1996), winner of the Guyana Prize, and Startling the Flying Fish (2006), poems which tell the story of the Caribbean, along with numerous poetry books for younger readers, including Come on into My Tropical Garden (1988), Give Yourself a Hug (1994) and Everybody Got a Gift (2005). She has published two books with Bloodaxe, her latest collection, Picasso, I Want My Face Back (2009), and I Have Crossed an Ocean: Selected Poems (2010), published on the occasion of her 60th birthday. She lives in Sussex with the poet John Agard and their family. ","links":[]},{"id":10157,"type":0,"title":"Stephanie Norgate","text":"Stephanie Norgate is a playwright and poet. She lives in Sussex with her husband and two children, and runs the MA in Creative Writing at the University of Chichester. Her plays have been produced on the London Fringe and her radio plays broadcast on BBC Radio 4. Fireclay, a Poetry Business prize-winning pamphlet appeared in 1998, followed by a selection of poems in Oxford Poets 2000. Her two collections with Bloodaxe are Hidden River (2008), which was shortlisted for both the Forward Prize for Best First Collection and the Jerwood Aldeburgh First Collection Prize, and The Blue Den (2012). She is currently editing a book of international essays on poetry and voice. ","links":[]},{"id":10158,"type":0,"title":"Henry Normal","text":"Henry Normal (real name Pete Carroll; born 15 August 1956) is an English comedian, television producer, poet and writer. He is Managing Director of Baby Cow Productions Ltd which he set up with Steve Coogan.","links":[]},{"id":10159,"type":0,"title":"Alden Nowlan","text":"Alden Nowlan (1933-83) is Canada's most popular modern poet, a figure comparable in the public’s affections to Stevie Smith or Betjeman in Britain. Born in the Nova Scotia backwoods, Alden Nowlan left school at 12 and worked in a sawmill before becoming a local newspaper reporter. While working at the Observer, a newspaper in Hartland, New Brunswick, he began writing books of poetry. In 1967, he was awarded a Guggenheim Fellowship, and his collection Bread, Wine and Salt was awarded the Governor General's Award for Poetry. In 1966, he was diagnosed with throat cancer. His health forced him to give up his newspaper job, but at the same time the University of New Brunswick in Fredericton offered him the position of Writer-in-Residence. He remained in the position until his death on 27 June 1983.The appearance of his work in the Bloodaxe anthology Staying Alive helped to spread his popularity beyond Canada – to a British and Irish readership following the publication of the 2002 edition and then in 2003 to an American readership with Miramax's publication of the US edition. In 2004 Bloodaxe published Between Laughter and Tears as the first title in its Bloodaxe World Poets series.There have been two notable biographies of Alden Nowlan published in Canada, Patrick Toner's If I Could Turn and Meet Myself: The Life of Alden Nowlan (Goose Lane Editions, 2000) and Gregory M. Cook's One Heart, One Way: Alden Nowlan, A Writer's Life (Pottersfield Press, 2003). In 2006 Guernica editions published Alden Nowlan: Essays on His Works, edited by Gregory M. Cook. In 2009, Goose Lane Editions reissued his posthumously published autobiographical first novel, The Wanton Troopers (1988). ","links":[]},{"id":10160,"type":0,"title":"Naomi Shihab Nye","text":"Naomi Shihab Nye has published over 20 books, including poetry, essays, picture books, novels and anthologies for younger readers. Her latest book of essays is I’ll Ask You Three Times, Are You Okay? Tales of Driving and Being Driven (2007). She has received many literary awards, and has been a Lannan Fellow, a Guggenheim Fellow, and a Witter Bynner Fellow (Library of Congress). Her work has been presented on National Public Radio on A Prairie Home Companion and The Writer’s Almanac, and she has been featured on two of Bill Moyers’ PBS poetry specials on American television networks. She lives in Austin, Texas. Tender Spot: Selected Poems (Bloodaxe Books, 2008) is her first UK publication.","links":[]},{"id":10161,"type":0,"title":"Sean O'Brien","text":"Sean O'Brien has published seven books of poems, including November (Picador 2011, PBS Choice) and The Drowned Book (Picador, 2007), winner of the T.S. Eliot and Forward Prizes, followed by Collected Poems (Picador, 2012). Bloodaxe published his first two collections, The Indoor Park (1983) and The Frighteners (1987), as well as his essays, The Deregulated Muse (1998), and most recently, his Newcastle-Bloodaxe Poetry Lectures, Journeys to the Interior: Ideas of England in contemporary poetry (2012). His translation of the Inferno appeared in 2006, his short story collection The Silence Room in 2008, and his novel Afterlife in 2009. A Fellow of the Royal Society of Literature, he lives in Newcastle upon Tyne and is Professor of Creative Writing at Newcastle University. ","links":[]},{"id":10162,"type":0,"title":"Julie O’Callaghan ","text":"Born in Chicago in 1954, Julie O'Callaghan has lived in Ireland since 1974. Her collections of poetry include Edible Anecdotes (Dolmen Press, 1983), a Poetry Book Society Recommendation; What's What (Bloodaxe Books, 1991); a Poetry Book Society Choice; No Can Do (Bloodaxe Books, 2000), a Poetry Book Society Recommendation; and Tell Me This Is Normal: New & Selected Poems (Bloodaxe Books, 2008), a Poetry Book Society Recommendation. Her books of poetry for older children include Taking My Pen for a Walk (Orchard Books, 1988), Two Barks (Bloodaxe Books, 1998) and The Book of Whispers (Faber & Faber, 2006). She has received the Michael Hartnett Award for poetry and is a member of the Irish academy of arts, Aosdána. ","links":[]},{"id":10163,"type":0,"title":"Caitríona O’Reilly","text":"Catríona O'Reilly was born Dublin in 1973, grew up in Wicklow and Dublin, and now lives in Lincoln. She studied archaeology and English at Trinity College Dublin, where she wrote a doctoral thesis on American literature; she has also held the Harper-Wood Studentship from St John's College, Cambridge. Her first collection The Nowhere Birds was shortlisted for the Forward Prize for Best First Collection in 2001, and won the Rooney Prize for Irish Literature in 2002 (given to the best new book by any Irish writer). Her second collection, The Sea Cabinet (Bloodaxe Books, 2006), was a Poetry Book Society Recommendation and was shortlisted for the Irish Times Poetry Now Award in 2007. She is a freelance writer and critic, has written for BBC Radio 4, translated from the Galician of María do Cebreiro, and published some fiction. She has collaborated with artist Isabel Nolan, was a contributing editor of the Irish poetry journal Metre, and has been editor of recent issues of Poetry Ireland Review. ","links":[]},{"id":10164,"type":0,"title":"Micheal O’Siadhail","text":" Micheal O'Siadhail [pronounced Mee-hall Oh Sheel] is a prolific Irish poet whose work sets the intensities of a life against the background of worlds shaken by change. His Collected Poems (2013) draws on thirteen previous collections, nine of these published by Bloodaxe, including Hail! Madam Jazz: New and Selected Poems (1992), Our Double Time (1998), Poems 1975-1995 (1999), The Gossamer Wall: poems in witness to the Holocaust (2002), Love Life (2005), Globe (2007) and Tongues (2010).He constantly seeks new dimensions through his poetry: examining the passions of friendship, marriage, trust and betrayal in an urban culture, tracing the intricacies of music and science as he tries to shape an understanding of the shifts and transformations of late modernity. In Musics of Belonging: The Poetry of Micheal O'Siadhail (Carysfort Press, 2007), the book's co-editor David F. Ford lists O'Siadhail's characteristic themes as 'despair, women, love, friendship, language, school, vocation, music, city life, science and other cultures and histories. There is a wrestle for meaning, with no easy resolution - both the form and the content are hard-won.' Jazz is leitmotiv throughout his work.Born in 1947, he was educated at Clongowes Wood College, Trinity College Dublin and the University of Oslo. He has been a lecturer at Trinity College Dublin and a professor at the Dublin Institute for Advanced Studies. Among his many academic works are Learning Irish (Yale University Press, 1988) and Modern Irish (Cambridge University Press, 1989). He is a fluent speaker of a surprising number and range of languages, including Norwegian, Icelandic, German, Welsh and Japanese. As well as some of the great English-language writers (Donne, Milton, Yeats, Kavanagh), his main influences include much literature in other languages, read and assimilated in the original (Irish monastic and folk poetry, Dante, Rilke, Paul Valéry, Karin Boye, the Eddas and the Sagas).In 1987 he resigned his professorship order to write poetry full-time, supported by giving numerous readings in many parts of the world. He won the Marten Toonder Prize for Literature in 1998. He lives in Booterstown, on the edge of Dublin Bay. ","links":[]},{"id":10165,"type":0,"title":"Leanne O' Sullivan","text":"Leanne O'Sullivan was born in 1983, and comes from the Beara peninsula in West Cork. She received an MA in English from University College, Cork in 2006. The winner of several of Ireland's poetry competitions in her early 20s (including the Seacat, Davoren Hanna and RTE Rattlebag Poetry Slam), she has published three collections, all from Bloodaxe, Waiting for My Clothes (2004), Cailleach: The Hag of Beara (2009), winner of the Rooney Prize for Irish Literature in 2010, and The Mining Road (2013). She was given the Ireland Chair of Poetry Bursary Award in 2009 and the Lawrence O’Shaughnessy Award for Irish Poetry in 2011, and received a UCC Alumni Award in 2012. Her work has been included in various anthologies, including Selina Guinness's The New Irish Poets (Bloodaxe Books, 2004) and Billy Collins's Poetry 180: A Turning Back to Poetry (Random House, 2003). Residencies and festival readings have taken her to France, India, China and America, amongst other locations. ","links":[]},{"id":10166,"type":0,"title":"John Oldham","text":"John Oldham was an English satirical poet and translator.","links":[]},{"id":10167,"type":0,"title":"Douglas Oliver","text":"Douglas Oliver has published several other books of petry. His Paladin selection of petry and prose, Three Variations on the Theme of Harm (1990), includes his much-praised satire on Modern Britain, The Infant and the Pearl. Born in Hampshire of Scottish Stock, he has spent many years working in Europe and America, and now lives in Paris. ","links":[]},{"id":10168,"type":0,"title":"Mary Oliver","text":"Mary Oliver was born in Maple Heights, Ohio in 1935. Her first collection American Primitive (1983) won a Pulitzer Prize. It was followed by books including Dream Work (1986), House of Light (1990), New and Selected Poems (1992), White Pine (1994), West Wind (1997), Winter Hours (1999), The Leaf and the Cloud (2000), What Do We Know (2002), Owls and Other Fantasies (2003), Why I Wake Early (2004), Blue Iris (2004), New and Selected Poems: volume two (2005), and a CD recording, At Blackwater Pond: Mary Oliver reads Mary Oliver (2005). Bloodaxe published her first UK selection, Wild Geese: Selected Poems, in 2004, followed by her later collections, Thirst (2007), Red Bird (2008), Evidence (2009) and Swan (2011). Mary Oliver is America's biggest selling contemporary poet. She holds the Catherine Osgood Foster Chair at Bennington College, Vermont, and divides her time between Provincetown, Massachusetts, and Florida. ","links":[]},{"id":10169,"type":0,"title":"Ottó Orbán","text":"Born in 1936, Otto Orban saw his father taken off to prison in 1944, and was sent to an institute a year later, where he made his name as a child-prodigy poet. By the 1970s he had changed from the 'wunderkid' to the 'enfant terrible' of Hungarian poetry. Having translated Allen Ginsberg's Howl, Orban was regarded for a while as Hungarian's own Beat poet, but he has in his long career also translated Chaucer, Auden, Dylan Thomsd snf Robert Lowell into Hungarian, and is an acknowledged master craftsman.","links":[]},{"id":10170,"type":0,"title":"Ruth Padel","text":"Ruth Padel has published seven poetry collections. Her latest, Darwin: A Life in Poems, is a biography through lyric poems of her great-great-grandfather Charles Darwin. Her non-fiction includes a study of rock music and Greek myth, two studies of Greek tragedy and the mind, and a nature book tracing her journeys in search of tigers in Bhutan, Nepal, Laos, Sumatra, Russia, China and India. Her books on reading modern poetry, 52 Ways of Looking at a Poem and The Poem and the Journey, came out of her weekly column in The Independent on Sunday. She gave the Newcastle\/Bloodaxe Poetry Lectures at Newcastle University in 2008, published as Silent Letters of the Alphabet (Bloodaxe Books, 2010). In 2009, drawing on her work in tropical conservation, she published her first novel, Where the Serpent Lives. ","links":[]},{"id":10171,"type":0,"title":"Heather Phillipson","text":"Heather Phillipson is an internationally exhibiting artist and award-winning poet. She received an Eric Gregory Award in 2008, a Donut Press mentoring award and a Faber New Poets award in 2009, and a Grants for the Arts Award from Arts Council England in 2011. Her pamphlet was published by Faber and Faber in 2009, and her text Not an Essay by Penned in the Margins in 2012. Her first book-length collection Instant-flex 718 (Bloodaxe Books, 2013) is shortlisted for the Fenton Aldeburgh First Collection Prize. Her poems have been published and broadcast widely, most recently in magazines and journals such as Manhattan Review, Poetry London and The Rialto, and anthologies including Jubilee Lines, edited by Carol Ann Duffy (Faber and Faber, 2012), London: a History in Verse, edited by Mark Ford (Harvard University Press, 2012), and Stop Sharpening Your Knives, vols. 3, 4 & 5 (Eggbox, 2009\/10\/12). Phillipson has also undertaken commissions for the British Film Institute, the Southbank Centre and Bloomberg New Contemporaries. Her poems have been featured on programmes including BBC Radio 3’s The Verb and Words and Music, and BBC2 Television’s The Culture Show. As an artist, Heather Phillipson works with moving image, sound, and live events. She regularly exhibits across the UK and abroad, with recent venues including the South London Gallery, the ICA (London), the Whitechapel Gallery (London), Flat Time House (London), the Serpentine Gallery (London), Baltic Centre for Contemporary Art (Gateshead), Kunsthalle Basel (Switzerland), and g39\/Halle 14 (Leipzig). ","links":[]},{"id":10172,"type":0,"title":"Tom Pickard","text":"Tom Pickard (born 1946, Newcastle upon Tyne, England) is a poet, and documentary film maker who was an important initiator of the movement known as the British Poetry Revival.","links":[]},{"id":10173,"type":0,"title":"Clare Pollard","text":"Clare Pollard was born in Bolton in 1978 and lives in London. She has published four collections with Bloodaxe: The Heavy-Petting Zoo (1998), which she wrote while still at school, Bedtime (2002), Look, Clare! Look! (2005) and Changeling, which is a Poetry Book Society Recommendation. Her translation Ovid's Heroines is published by Bloodaxe in 2013. Her first play The Weather (Faber, 2004) premièred at the Royal Court Theatre. She works as an editor, broadcaster and teacher. Her documentary for radio, My Male Muse (2007), was a Radio 4 Pick of the Year. She is co-editor, with James Byrne, of the anthology Voice Recognition: 21 poets for the 21st century (Bloodaxe Books, 2009). ","links":[]},{"id":10174,"type":0,"title":"Katrina Porteous","text":"Katrina Porteous was born in Aberdeen in 1960, grew up in Co. Durham, and has lived at Beadnell in Northumberland since 1987. She read History at Cambridge and afterwards studied in the USA on a Harkness Fellowship. Her work appeared in Carol Rumens' Bloodaxe anthology New Women Poets in 1990. In 1989 she won a Gregory Award, and in 1993 an Arts Council Bursary. Many of the poems in her first collection, The Lost Music (Bloodaxe Books, 1996), deal with the fishing community of the Northumberland coast. Katrina is actively involved in local history, recording reminiscences of older people in the community. She also writes in Northumbrian dialect, and has recorded her long poem, The Wund an' the Wetter, on CD with piper Chris Ormston (Iron Press, 1999). Her latest poems are published in Turning the Tide, a collection of photographs and paintings recording the regeneration of the black beaches of east Durham (District of Easington, 2001). Her second full-length collection from Bloodaxe, Two Countries, is forthcoming in 2014.She has been involved in many collaborations with other artists, including public art for Seaham, County Durham with sculptor Michael Johnson, and inscriptions for Easington Colliery Memorial Garden. In 2000 she worked with composer Alistair Anderson on the musical Tam Lin, and collaborated on a film-poem for Poetry International at the Royal Festival Hall. Katrina has many years' experience leading poetry workshops for adults and children. She has been writer-in-residence from Cornwall to the Shetland Islands, as well as in schools in the United States. ","links":[]},{"id":10175,"type":0,"title":"Jem Poster","text":"Jem Poster originally worked as an archaeologist, and now directs the creative writing diploma at Oxford University's Department for Continuing Education. His other publications include a selection of George Crabbe's poetry, a study of the poetry of the 1930s and articles on modern poetry and fiction. His pamphlet, By Some Other Route, was published by the Mandeville Press in 1993. Brought to Light is his first book-length collection. ","links":[]},{"id":10176,"type":0,"title":"Kate Potts","text":"Kate Potts was born in 1978 and grew up in London. She worked in music publishing before studying at Goldsmiths’ College, London, and has taught English and Creative Writing at colleges in London for several years. Her pamphlet Whichever Music (tall-lighthouse) was a Poetry Book Society Pamphlet Choice in 2008 and was shortlisted for a Michael Marks Award. Her work was featured in the Bloodaxe new poets anthology Voice Recognition in 2009. Pure Hustle (Bloodaxe Books, 2011) is her first book-length collection. ","links":[]},{"id":10177,"type":0,"title":"Tom Pow","text":"Tom Pow was born in Edinburgh in 1950. Primarily a poet, several of his collections have won awards and three of his poetry collections have been short-listed for Scottish Book of the Year. Most recently, Dear Alice – Narratives of Madness (Salt Publishing) won the poetry category in the Scottish Mortgage Investment Trust’s Scottish Book Awards in 2009. He has also written young adult novels, picture books, radio plays and a travel book about Peru. In The Becoming, Selected and New Poems (Polygon) has recently been published (June 2009).He has held various writing posts, including that of Scottish\/Canadian Writing Fellow, based at the University of Alberta in Edmonton, and Virtual Writer in Residence (Scotland’s first) for the Scottish Library Association’s Scottish Writers Project. He was the first ever Writer in Residence at the Edinburgh International Book Festival from 2001 to 2003.From 2000 to 2009, he worked for the University of Glasgow in Dumfries, latterly as Senior Lecturer in Creative Writing and Storytelling.He is currently Honorary Senior Research Fellow at Glasgow University Dumfries and a part-time lecturer on Lancaster University’s distance learning Masters in Creative Writing. ","links":[]},{"id":10178,"type":0,"title":"J. H. Prynne","text":"J.H. Prynne is Britain's leading late Modernist poet. His Poems (1982) collected all the work he wanted to keep in print, beginning with Kitchen Poems (1968). An expanded and updated version was published by Bloodaxe Books with Fremantle Arts Centre Press in 1999 as Poems, with a second, expanded edition in 2005. He has since published three limited editions, To Pollen (2006), STREAK---WILLING---ENTOURAGE ARTESIAN (2009) and SUB SONGS (2010).Prynne has published a wide range of critical and academic prose, including works on Saussure, Wordsworth, Shakespeare. His essay on New Songs from a Jade Terrace, an anthology of early Chinese love poetry, was included in the second edition of the book from Penguin 1982. He has written poetry in classical Chinese under the name Pu Ling-en.Prynne is a Life Fellow of Gonville and Caius College, Cambridge. In 2005 he retired from his posts teaching English Literature as a Lecturer and University Reader in English Poetry for the University of Cambridge and as Director of Studies in English for Gonville and Caius College; he retired as Librarian of the College in 2006. ","links":[]},{"id":10179,"type":0,"title":"Deborah Randall","text":"Deborah Randall's first collection, The Sin Eater (Bloodaxe, 1989) was a Poetry Book Society Recommendation, and wona Scottish Arts Council Book Award. In 1987 she won first prize in the Bloodaxe and Bridport poetry competitions. Born in 1957 in Hampshire, she now lvies in Ullapool in Scotland. ","links":[]},{"id":10180,"type":0,"title":"Sally Read","text":"Sally Read was born in Suffolk in 1971. She trained and worked as a psychiatric nurse in London while completing a BA with the Open University, and went on to earn her MA at the University of South Dakota, USA. She received an Eric Gregory Award in 2001. Her three poetry collections with Bloodaxe are The Point of Splitting (2005), which was shortlisted for the Jerwood-Aldeburgh First Collection Prize, Broken Sleep (2009) and The Day Hospital (2012). The Poetry Archive released her audio CD Sally Read reading from her poems in 2010.Her poems have appeared in several anthologies, including Roddy Lumsden’s Identity Parade (Bloodaxe Books, 2010), The Picador Book of Love Poems (2011), and Poems of the Decade (Forward Publishing, 2011). A selected poems in Italian, translated by Andrea Sirotti and Loredana Magazzeni, is nearing completion. She is a member of La Compagnia delle Poete, a theatrical Italian co-operative of poets.Sally Read is based in Santa Marinella, Rome, and in Bungay, Suffolk. She is currently poet in residence of the Hermitage of the Three Holy Hierarchs. ","links":[]},{"id":10181,"type":0,"title":"Peter Reading","text":" Peter Reading (1946-2011) was born in Liverpool. After studying painting at Liverpool College of Art, he worked as a schoolteacher in Liverpool (1967-68) and at Liverpool College of Art, where he taught Art History (1968-70). He then worked for 22 years as a weighbridge operator at an animal feedmill in Shropshire, a job which left him free to think, until he was sacked for refusing to wear a uniform introduced by new owners of the business. His only break was a two-year residency at Sunderland Polytechnic (1981-83). After leaving Liverpool, he lived for 40 years in various parts of Shropshire, in recent years in Ludlow.The benevolence of America’s Lannan Foundation rescued him from poverty. He was the first writer to hold the one-year Lannan writing residency in Marfa, Texas (in 1999), and is the only British poet to have won the Lannan Award for Poetry twice, in 1990 and 2004, as well as the only poet to read an entire life’s work for the Lannan Foundation’s DVD archive – his filmed readings for Lannan (made in 2001 and 2010) of 26 poetry collections make up the only archive of its kind. His other honours included the Cholmondeley Award, the Dylan Thomas Award for Diplopic (1983), and the Whitbread Prize for Poetry for Stet (1986). Work in Regress was shortlisted for the T.S. Eliot Prize in 1997.Peter Reading was one of the most original and controversial British poets of the post-war period: angry, uncompromising, gruesomely ironic, hilarious and heartbreaking – as funny as he is disconcerting. He was a prodigiously skilful and technically inventive poet, mixing the matter and speech of the gutter with highly sophisticated metrical and syllabic patterns to produce scathing and grotesque accounts of lives blighted by greed, meanness, ignorance, phony media flimflam, political ineptness and cultural impoverishment.All his poetry is published by Bloodaxe Books, along with Isabel Martin’s critical study Reading Peter Reading (2000). His first collection was Water and Waste (1970), published when he was 24, and his last, 26th collection, was Vendange Tardive, published forty years later in 2010. Each of his collections is self-contained, as carefully constructed and plotted as a novel, interweaving voices and narrative strands which can be seen to link the 24 books which make up his Collected Poems, published in three volumes: 1: Poems 1970-1984 (1995), 2: Poems 1985-1996 (1996) and 3: Poems 1997-2003 (2003). His later collections from Bloodaxe are -273-15 (2005) and Vendange Tardive (2010). ","links":[]},{"id":10182,"type":0,"title":"Anne Rouse","text":"Anne Rouse was born in Washington DC and grew up in Virginia. After reading History at the University of London, she worked as a nurse and the director of a mental health charity. Since becoming a freelance writer, she has had many residencies, including visiting fellowships in Glasgow and in autumn 2004 in Belfast. She lives in Hastings. Anne Rouse has published four books with Bloodaxe, the collections Sunset Grill (1993) and Timing (1997) – both Poetry Book Society Recommendations – and The School of Night (2004); and The Upshot: New & Selected Poems (2008), which includes a new collection, The Divided (2008), plus a selection from her first three collections. She reads a half-hour selection of poems on Poetry Quartets 9 (British Council\/Bloodaxe Books, 2004). ","links":[]},{"id":10183,"type":0,"title":"Carol Rumens","text":"Carol Rumens was born in 1944 in South London. Based in Belfast for some years, where she was Poet in Residence at Queen’s University, she has also held residencies in Cork, Canterbury and Stockholm. She was Northern Arts Literary Fellow at Newcastle and Durham, and is now Chair of Creative Writing at the University of Wales, Bangor.  In 2004, Bloodaxe published her Poems 1968-2004, drawing on eleven poetry books as well as pamphlets and new or uncollected work. Her latest collection is Blind Spots (Seren, 2008). Carol Rumens has also published a novel, Plato Park, and written two plays, Nearly Siberia and Suzanne Hecabe. She has edited two anthologies, Making for the Open and New Women Poets, and translated several Russian poets with her partner, Yuri Drobyshev. ","links":[]},{"id":10184,"type":0,"title":"Gig Ryan ","text":"Gig Ryan was born in 1956 and grew up in Melbourne. She has published six collections of poetry in Australia: The Division of Anger (1981); Manners of an Astronaut (1984); The Last Interior (1986); Excavation (1990); Pure and Applied (1998), which won the C.J. Dennis Prize for Poetry and the Victorian Premier’s Award for Poetry; and Heroic Money (2001).Ryan is also a freelance reviewer and a songwriter, performing and releasing three albums with Disband (1998) and Driving Past (1999, 2006). She lives in Melbourne, and has been poetry editor of the Melbourne Age since 1998.Her first UK publication, Selected Poems (Bloodaxe Books, 2012), was published in Australia in 2011 by Giramondo under the title New and Selected Poems. ","links":[]},{"id":10185,"type":0,"title":"Tracy Ryan","text":"Tracy Ryan was born in Western Australia, where she grew up. After reading English at Curtin University, she studied European languages at the University of Western Australia, and has translated many French writers, including Helene Cixous, Maryline Desboilles and Francoise Han. She now lives in Cambridge, where she has worked as a bookseller, tutor, editor and writer. She was Judith E. Wilson Junior Visiting Fellow at Robinson College, Cambridge in 1998 and now teaches Australian Literature and Film at the University of East Anglia. Her books include two collections, Killing Delilah (1994) and Bluebeard in Drag (1996) and a novel, Vamp (1997), all published in Australia by Fremantle Arts Centre Press. ","links":[]},{"id":10186,"type":0,"title":"Lawrence Sail ","text":"Lawrence Sail was born in London and brought up in Exeter. He studied French and German at Oxford University, then taught for some years in Kenya, before returning to teach in the UK. He is now a freelance writer and lives in Exeter.His retrospective Waking Dreams: New & Selected Poems (Bloodaxe Books, 2010), a Poetry Book Society Special Commendation, covers work written over four decades, drawing on poems from ten collections, from Opposite Views (1974) to the New Poems (2010) first collected in this volume. It includes poems from four books previously published by Bloodaxe, Out of Land: New & Selected Poems (1992), Building into Air (1995), The World Returning (2002), and Eye-Baby (2006).His other books include Cross-currents: essays (Enitharmon, 2005), a memoir of childhood, Sift (Impress Books, 2010), and Songs of the Darkness, a selection of his Christmas poems with illustrations by his daughter, Erica Sail (Enitharmon, 2010). He has edited a number of anthologies, including The New Exeter Book of Riddles (1999) and Light Unlocked: Christmas Card Poems (2005), both co-edited with Kevin Crossley-Holland for Enitharmon, and First and Always: Poems for Great Ormond Street Children's Hospital (Faber & Faber, 1988). He also edited South-West Review from 1980 to 1985.He was chairman of the Arvon Foundation from 1990 to 1994. In 1991 he was programme director of the Cheltenham Festival of Literature, and a judge for the Whitbread Book of the Year awards. He was awarded a Hawthornden Fellowship in 1992, and an Arts Council Writer’s Bursary the following year.In August 1993 he undertook a month-long tour of India for the British Council, for whom he has since worked as visiting writer and lecturer in various countries, including Bosnia, Colombia, Egypt, France, Luxembourg, Portugal, Spain and Ukraine. From 1994 to 1996 he was the British representative on the jury of the European Literature Prize, and from 2004 to 2007 a judge of the Eric Gregory Awards. In October 1999 he was a co-director of the 50th Anniversary Cheltenham Festival of Literature. In 2004 he received a Cholmondeley Award. He is a Fellow of the Royal Society of Literature. ","links":[]},{"id":10187,"type":0,"title":"Eva Salzman","text":"Eva Salzman was born in 1960 in New York City, and grew up in Brooklyn where – from the age of 10 until 22 – she was a dancer and later a choreographer. She was educated at Bennington College and Columbia University, moving to Britain in 1985. She now lives in London. Her eclectic background has led to work in cross-arts projects with artists, dancers and singers. Her teaching work – for children, teenagers and adults – has included projects in London’s East End and a residency at Springhill Prison as well as continuing work for the Poetry Society’s Poet in the City and Poetryclass projects and co-devising a Start Writing Poetry course for the Open University. ","links":[]},{"id":10188,"type":0,"title":"Jacob Sam-La Rose","text":"Jacob Sam-La Rose was born in London in 1976. He was managing director of a web development studio before becoming a freelance writer and editor. He is the Artistic Director of the London Teenage Poetry SLAM, Editor-in-Chief of Metaroar.com, and an editor for flipped eye press. He also facilitates a range of literature-in-education, creative writing and spoken word programmes through schools, arts centres and other institutions.His work has appeared in many anthologies and journals, including Identity Parade: New British & Irish Poets (Bloodaxe), Poems For Love (Penguin), I Have Found a Song (Enitharmon Press), Red (Peepal Tree), Learn Then Burn: The Ultimate Poetry Guide for the High School or College Classroom (Write Bloody) and Michael Rosen’s A-Z: The Best Children’s Poetry from Agard to Zephaniah (Puffin). His pamphlet Communion was a Poetry Book Society Pamphlet Choice in 2006. Breaking Silence (Bloodaxe Books, 2011), his first book-length collection, is shortlisted for both the Forward Prize for Best First Collection and the Fenton Aldeburgh First Collection Prize 2012. ","links":[]},{"id":10189,"type":0,"title":"Fiona Sampson","text":"Fiona Sampson was first a concert violinist, then studied at the Universities of Oxford, where she won the Newdigate Prize, and Nijmegen, where she received a PhD in the philosophy of language. This research arose from her pioneering residencies in health care. Her latest of her seventeen books is Rough Music, shortlisted for the 2010 Forward and T.S. Eliot Prizes. In 2009 she received a Cholmondeley Award and became an FRSL. She is editor of Poetry Review. She gave the Newcastle\/Bloodaxe Poetry Lectures at Newcastle University in 2010, published in 2011 as Music Lessons. ","links":[]},{"id":10190,"type":0,"title":"Ann Sansom","text":"Ann Sansom is a poet, playwright and tutor. She has published six collections of poetry, including two with Bloodaxe Books, Romance (1994) and In Praise of Men and other people (2003). She has had work published in several Forward\/Faber anthologies, Russian Vogue and a range of other publications and has written and directed plays for stage and radio. She is currently working with The British Film Institute on a series of commissioned film-related poems and is writing a screenplay for a further series of short films. Ann is a regular tutor for WEA, Poetry Society and Arvon Foundation and has taught at Oxford, Leeds and Sheffield Hallam universities. She regularly works in schools and tutors at school writing residentials, teaching children of all ages and abilities, and has run a weekly writers' workshop at Doncaster YWCA for twenty years. She is also a director of The Poetry Business, which publishes 'The North' magazine and Smith\/Doorstop books. She lives in Sheffield. ","links":[]},{"id":10191,"type":0,"title":"Carole Satyamurti","text":"Carole Satyamurti is a poet and sociologist, who lives and works in London. For many years she taught at the Tavistock Clinic, where her main academic interest was in the relevance of psychoanalytic ideas to an understanding of the stories people tell about themselves, whether in formal autobiography or in social encounters. She co-edited Acquainted with the Night: psychoanalysis and the poetic imagination (2003). She won the National Poetry Competition in 1986, and a Cholmondeley Award in 2000. Countdown (2011) is her first new collection since Stitching the Dark: New & Selected Poems (2005), which drew on five collections: Broken Moon (1987), Changing the Subject (1990), Striking Distance (1994), Love and Variations (2000), and Stitching the Dark (2005), two of these Poetry Book Society Recommendations. Her translation from the Mahabharata is forthcoming from Norton. ","links":[]},{"id":10192,"type":0,"title":"Gjertrud Schnackenberg","text":"Gjertrud Schnackenberg was born in 1953 in Tacoma, Washington. Her retrospective Supernatural Love: Poems 1976-2000 (Bloodaxe Books, 2001) includes her four collections, Portraits and Elegies (1982), The Lamplit Answer (1985), A Gilded Lapse of Time (1995), and The Throne of Labdacus (2000), winner of the Los Angeles Times Book Prize for Poetry. Her latest collection is Heavenly Questions, winner of the Griffin International Poetry Prize, published in hardback in the US by Farrar, Straus and Giroux in 2010 and in paperback by Bloodaxe in the UK in 2011.She has won many literary awards, including fellowships from the Guggenheim Foundation and the National Endowment for the Arts, the Rome Prize for Literature, and an Award in Literature from the American Academy for Arts and Letters. She has been a Christensen Visiting Fellow at St Catherine's College, Oxford, a Fellow of the American Academy in Berlin, and a visiting scholar at the Getty Research Institute for the History of Art and the Humanities. She divides her time between Tacoma and Boston, Massachusetts. ","links":[]},{"id":10193,"type":0,"title":"David Scott","text":"David Scott was born in 1947 in Cambridge. He was educated at Solihull School, and studied Theology at Durham and then at Cuddesdon College near Oxford. He spent two years as a curate in Harlow, and then became School Chaplain at Haberdashers’ Aske’s School, Elstree, where he taught religious education. He was vicar of Torpenhow and Allhallows in Cumbria for eleven years, and from 1991 until his recent retirement he was Rector of St Lawrence with St Swithun in Winchester, Warden of the Diocesan School of Spirituality and an Honorary Canon of Winchester Cathedral. He now lives in Kendal.In 1978 David Scott won the Sunday Times\/BBC national poetry competition with his poem ‘Kirkwall Auction Mart’. A Quiet Gathering, his first book of poems, was published by Bloodaxe Books in 1984, and won him the Geoffrey Faber Memorial Prize in 1986. His second collection, Playing for England (Bloodaxe Books, 1989) was a Poetry Book Society Recommendation. Both books were illustrated by Graham Arnold of the Brotherhood of Ruralists. The poems from the two collections were republished with new work in David Scott’s Selected Poems (Bloodaxe Books, 1998), and followed by Piecing Together in 2005. His latest book, Beyond the Drift (Bloodaxe Books, 2014), draws on his four previous Bloodaxe titles, with the addition of a whole collection of new poems.David Scott’s collection of poems for children, How Does It Feel? was published by Blackie in 1989. He has also written several plays for the National Youth Music Theatre with Jeremy James Taylor. These include Captain Stirrick, which was staged at the National Theatre’s Cottesloe Theatre in 1981; and Bendigo Boswell, which was commissioned by the BBC and screened in 1983. Jack Spratt VC was performed in the 1986 London International Opera Festival, and Les Petits Rats was performed at the Edinburgh International Festival and Sadlers Wells in 1988. He has written four religious books, Moments of Prayer (SPCK, 1997), Building Common Faith (Canterbury Press, 1997), Sacred Tongues (SPCK, 2001) and The Private Prayers of Lancelot Andrewes (SPCK, 2002). ","links":[]},{"id":10194,"type":0,"title":"John Sears","text":"John Sears lectures in English Literature at Manchester Metropolitan University. His recent essays address contemporary fiction and poetry by writers like Maggie Gee, Neil Bartlett and W.G. Sebald, and he has published essays and delivered papers on George Szirtes’ poetry at universities across Europe. He lives in Crewe. ","links":[]},{"id":10195,"type":0,"title":"Olive Senior","text":"Olive Senior was born and brought up in Jamaica. She has worked in journalism in Jamaica and Canada, and divides her time between the two countries. She is currently Visiting Professor of Creative Writing at St Lawrence University, USA. Her first book of poems, Talking of Trees, was published by Calabash in Jamaica.","links":[]},{"id":10196,"type":0,"title":"Jo Shapcott","text":"Jo Shapcott is one of Britain’s leading poets. She has twice won the National Poetry Competition, and won the Forward Prize in 1999. She was Northern Arts Literary Fellow at the universities of Newcastle and Durham in 1998-2000, and is Visiting Professor of Poetry at Newcastle University and at the University of the Arts, London; she also teaches on the MA in Creative Writing at Royal Holloway College. She is president of the Poetry Society. Her poetry books include Electroplating the Baby (Bloodaxe Books, 1988), Phrase Book (OUP, 1992), My Life Asleep (OUP, 1998), Her Book (Faber, 1999) and Tender Taxes, including her versions from Rilke’s French poems (Faber, 2001). She co-edited the anthology Emergency Kit: Poems for Strange Times (Faber, 1996) with Matthew Sweeney and Elizabeth Bishop: Poet of the Periphery (Bloodaxe \/ Newcastle University, 2002) with Linda Anderson. ","links":[]},{"id":10197,"type":0,"title":"Clare Shaw","text":"Clare Shaw was born in 1972 in Burnley, the youngest of six children, and moved to Liverpool at the age of 18 to study politics. Her years in the city were marked by frequent admissions to psychiatric wards, which motivated her to become involved in working to improve mental health services. In her work, postgraduate study, publications and activism, she has become a recognised voice on women's mental health issues. She lives in West Yorkshire, and works in a self-harm awareness training partnership with her sister. Described by Carol Ann Duffy as 'one of the best new young readers on the circuit', Clare is a popular and engaging reader of her own work. She has two collections from Bloodaxe, Straight Ahead (2006), which was shortlisted for the Glen Dimplex New Writers' Award for Poetry, and attracted a Forward Prize Highly Commended for Best Single Poem, and Head On (2012). ","links":[]},{"id":10198,"type":0,"title":"Penelope Shuttle","text":"Penelope Shuttle has lived in Cornwall since 1970, is the widow of the poet Peter Redgrove, and has a grown-up daughter Zoe, who works in the field of sustainable energy.Her first collection of poems, The Orchard Upstairs (1981) was followed by six other books from Oxford University Press, The Child-Stealer (1983), The Lion from Rio (1986), Adventures with My Horse (1988), Taxing the Rain (1994), Building a City for Jamie (1996) and Selected Poems 1980-1996 (1998), and then A Leaf Out of His Book (1999) from Oxford Poets\/Carcanet, and Redgrove’s Wife (2006) and Sandgrain and Hourglass (2010) from Bloodaxe Books. Redgrove’s Wife was shortlisted for both the Forward Prize and the T.S. Eliot Prize in 2006. Sandgrain and Hourglass is a Poetry Book Society Recommendation. Her latest book, Unsent: New & Selected Poems 1980-2012 (Bloodaxe Books, 2012), is drawn from ten collections published over three decades plus a new collection, Unsent.First published as a novelist, her fiction includes All the Usual Hours of Sleeping (1969), Wailing Monkey Embracing a Tree (1973) and Rainsplitter in the Zodiac Garden (1977).With Peter Redgrove, she is co-author of The Wise Wound: Menstruation and Everywoman (1978) and Alchemy for Women: Personal Transformation Through Dreams and the Female Cycle (1995), as well as a collection of poems, The Hermaphrodite Album (1973), and two novels, The Terrors of Dr Treviles: A Romance (1974) and The Glass Cottage: A Nautical Romance (1976).Shuttle’s work is widely anthologised and can be heard on The Poetry Archive Website. Her poetry has been broadcast on BBC Radio 3 and 4, and her poem ‘Outgrown’ was used recently in a radio and television commercial. She has been a judge for many poetry competitions, is a Hawthornden Fellow, and a tutor for the Poetry School. She is current Chair of the Falmouth Poetry Group, one of the longest-running poetry workshops in the country. ","links":[]},{"id":10199,"type":0,"title":"James Simmons","text":"He was born into a middle-class Protestant family in Derry in 1933 and attended Campbell College in Belfast before moving to the University of Leeds to read for a degree in English. He married Laura Stinson and returned to Northern Ireland to teach at Friends' School Lisburn for five years. His final foreign excursion was a position at Ahmadu Bello University in Nigeria, where he worked for three years. During this time they had five children: Rachel, Sarah, Adam, Helen and Penelope. He returned to Northern Ireland in 1968, accepting a position at the recently-opened New University of Ulster in Coleraine, where he remained until his retirement in 1984.During the early '70s - the bloodiest times of all in NI - he was the inspiration and leading light for The Resistance Cabaret, a satirical revue combining song, poetry and political comment on 'the troubles' and life in general, written and performed by Simmons and some of his students. Arguably, Simmons - whose passion for poetry was equalled only by his yearning to make it accessible to all the people - felt most at home in this setting, connecting with an audience that was moved to talk back.Near the end of his teaching career at the University of Ulster, Simmons and his first wife Laura divorced. He married Imelda Foley[citation needed], the sister of Derry poet and fiction writer Michael Foley, and had one child, Anna. After this marriage to Imelda ended, he had a son Ben with his third wife, fellow-poet Janice Fitzpatrick. Simmons and Fitzpatrick started The Poets' House, initially in Islandmagee in County Antrim, later in Falcarragh in County Donegal. ","links":[]},{"id":10200,"type":0,"title":"Matt Simpson","text":"Matt Simpson was born in Bootle. His books include An Elegy for the Galosherman: New & Selected Poems (Bloodaxe, 1990) in which he looks back at his Merseyside upbringing. He lives inm Liverpool. ","links":[]},{"id":10201,"type":0,"title":"Louis Simpson","text":"Louis Simpson (1923-2012) was born in Jamaica, West Indies, the son of a lawyer of Scottish descent and a Russian mother. He emigrated to the United States at the age of 17, studied at Columbia University, then served in the Second World War with the 101st Airborne Division on active duty in France, Holland, Belgium, and Germany. After the war he continued his studies at Columbia and at the University of Paris. While living in France he published his first book of poems, The Arrivistes (1949). He worked as an editor in a publishing house in New York, then earned a Ph.D. at Columbia and went on to teach at Columbia, the University of California at Berkeley, and the State University of New York at Stony Brook.In 1975 the publication of Three on the Tower, a study of Ezra Pound, T.S. Eliot and William Carlos Williams, brought Simpson wide acclaim as a literary critic. His other books of criticism include Ships Going Into the Blue: Essays and Notes on Poetry (1994), The Character of the Poet (1986), A Company of Poets (1981), and A Revolution in Taste: Studies of Dylan Thomas, Allen Ginsberg, Sylvia Plath, and Robert Lowell (1978).Louis Simpson has published numerous books of poetry, most recently The Owner of the House: New Collected Poems, 1940-2001 (BOA Editions, 2003), which was shortlisted for the Griffin Prize; a new collection, Struggling Times (BOA Editions, 2009); and his first UK edition for over 25 years, Selected Poems (Bloodaxe Books, 2010).His earlier books include In the Room We Share (1990), Collected Poems (1988), People Live Here: Selected Poems 1949-83 (1983), The Best Hour of the Night (1983), Caviare at the Funeral (1980), Armidale (1979), Searching for the Ox (1976), Adventures of the Letter I (1971), Selected Poems (1965), At the End of the Open Road (1963) and A Dream of Governors (1959). At the End of the Open Road won him a Pulitzer Prize. His other books include a memoir, The King My Father's Wreck (Story Line, 1995), Selected Prose (1989), and Modern Poets of France: A Bilingual Anthology (Story Line Press), winner of the Academy of American Poets' 1998 Harold Morton Landon Translation Award. Among his many other honours are the Prix de Rome, fellowships from the Guggenheim Foundation, and the Columbia Medal for Excellence. ","links":[]},{"id":10202,"type":0,"title":"Lemn Sissay","text":"Dr Lemn Sissay MBE is associate artist at Southbank Centre, patron of The Letterbox Club and The Reader Organisation, ambassador for The Children’s Reading Fund, trustee of Forward Arts Foundation and inaugural trustee of World Book Night. He has been a writer from birth and foremost a poet. ","links":[]},{"id":10203,"type":0,"title":"Ken Smith","text":"Ken Smith (1938-2003) was a major voice in world poetry, a writer whose work shifted territory with time, from land to city, from Yorkshire, America and London to war-ravaged Eastern Europe. He was called ‘the godfather of the new poetry’ because his politically edgy, cuttingly colloquial, muscular poetry influenced a whole generation of younger British poets, from Simon Armitage to Carol Ann Duffy. Ken Smith was born in Rudston, East Yorkshire, the son of an itinerant farm labourer. He worked in Britain and America as a teacher, freelance writer, barman, magazine editor, potato picker, BBC reader and creative writing fellow, and was writer-in-residence at Wormwood Scrubs prison in 1985-87. He received America’s highly prestigious Lannan Literary Award for Poetry in 1997, and a Cholmondeley Award in 1998. Ken Smith was the first poet to be published by Bloodaxe, with his pamphlet Tristan Crazy in 1978. Smith’s first book, The Pity, was published by Jonathan Cape in 1967, and his second, Work, distances\/poems, by Swallow Press, Chicago, in 1972. His early books span a transition from his preoccupation with land and myth (when he lived in Yorkshire, Devon and America) to his later engagement with urban Britain and the politics of radical disaffection (when he lived in East London). The Poet Reclining: Selected Poems 1962-1980 (Bloodaxe, 1982; reissued 1989) covers the first half of his writing career. In 1986 Ken Smith’s collection Terra was shortlisted for the Whitbread Award. In 1987 Bloodaxe published his collected prose, A Book of Chinese Whispers. Four of his collections, Terra (1986), Wormwood (1987), The heart, the border (1990) and Tender to the Queen of Spain (1993), were Poetry Book Society Recommendations. His last separate collection, Wild Root (1998), a Poetry Book Society Choice, was shortlisted for the T.S. Eliot Prize. All these collections are included in his second Bloodaxe compilation, Shed: Poems 1980-2001 (2002), the sequel to The Poet Reclining.In 1989 Harrap published Inside Time, Ken Smith’s book about imprisonment, about Wormwood Scrubs and the men he met there. This was published in paperback by Mandarin in 1990. Ken Smith was working in Berlin when the Wall came down, writing a book about East and West Berlin: this turned into Berlin: Coming in from the Cold (Hamish Hamilton, 1990; Penguin paperback, 1991. He edited Klaonica: poems for Bosnia (Bloodaxe Books, 1993) with Judi Benson, and with Matthew Sweeney co-edited Beyond Bedlam (Anvil Press Poetry, 1997), a book of poems by mentally ill people.He died on 27 June 2003 from a hospital infection caught while being treated for Legionnaires’ Disease, which he had contracted months earlier in Cuba. His last poems are published in You Again: last poems & other words (Bloodaxe Books, 2004) along with other uncollected work, tributes from other poets, photographs, a biographical portrait and interviews covering the whole range of his life and work. ","links":[]},{"id":10204,"type":0,"title":"Esta Spalding","text":"Esta Spalding was born in Boston, and raised in Hawaii and Toronto. She now lives in Vancouver, where she writes for film and television. She has published four books of poetry in Canada, edited The Griffin Poetry Prize Anthology (Anansi, 2002) and is co-editor of Brick: A Literary Journal, as well as of Lost Classics (Bloomsbury 2000). Her novel, Mere, written with Linda Spalding, it due out ih 2002. ","links":[]},{"id":10205,"type":0,"title":"Bernard Spencer","text":"Charles Bernard Spencer was born in Madras, India, in November 1909. He came to England at the age of two and was brought up by relatives and guardians. He attended Marlborough School, where he met Louis MacNeice and John Betjeman. After graduating in 1932 from Corpus Christi College, Oxford, with a degree in Greats, he worked in a number of teaching and other jobs before joining the British Council in 1940.In August 1936, he married Nora Gibbs, but they were to be separated between 1940 and 1945, she in London, he in Greece and then Cairo, thanks to the vicissitudes of war. Together on his posting to Palermo, Sicily, in 1946, she developed TB and died in Rome the following June. Spencer himself then underwent a painful cure for the same disease in Switzerland. There followed postings to Turin, Madrid, Athens, Ankara, Madrid again, and finally Vienna. He married Anne Marjoribanks in September 1961 and their son Piers was born in February 1963. His second collection With Luck Lasting was a Poetry Book Society Recommendation that summer.While on holiday in Venice, Spencer began to suffer from an undiagnosed illness. Back in Vienna, feverish and with a high temperature, he walked out of the clinic where he was under observation and would be discovered with head injuries beside suburban railway lines in the early hours of 11 September 1963. The exact circumstances of his death have never been fully explained.Roger Bowen's edition of Spencer's Collected Poems was published by OUP in 1981. His Complete Poetry, Translations and Selected Prose, edited by Peter Robinson, was published by Bloodaxe Books in 2011. ","links":[]},{"id":10206,"type":0,"title":"Pauline Stainer","text":"Pauline Stainer is a freelance writer and tutor. After many years in rural Essex and then on the Orkney island of Rousay, she now lives at Hadleigh in Suffolk. Her Bloodaxe titles include The Lady & the Hare: New & Selected Poems (2003), which draws on five previous books, as well as a new collection, A Litany of High Waters, and two later collections, Crossing the Snowline (2008) and Tiger Facing the Mist (2013). Along with The Lady & the Hare, her collections The Honeycomb, Sighting the Slave Ship and The Ice-Pilot Speaks were all Poetry Book Society Recommendations. Her fourth collection The Wound-dresser’s Dream was shortlisted for the Whitbread Poetry Award in 1996. Pauline Stainer received a 2009 Cholmondeley award for her poetry. ","links":[]},{"id":10207,"type":0,"title":"Anne Stevenson","text":"Anne Stevenson was born in Cambridge, England, in 1933, of American parents, and grew up in New England and Michigan. She studied music, European literature and history at the University of Michigan, returning later to read English and publishing the first critical study of Elizabeth Bishop. After several transatlantic switches, she settled in Britain in 1964, and has since lived in Cambridge, Scotland, Oxford, the Welsh Borders and latterly in North Wales and Durham.She has held many literary fellowships, and was the inaugural winner of Britain’s biggest literary prize, the Northern Rock Foundation Writer’s Award, in 2002. In 2007 she was awarded three major prizes in her native USA: the $200,000 Lannan Lifetime Achievement Award for Poetry by the Lannan Foundation of Santa Fe, a Neglected Masters Award from the Poetry Foundation of Chicago and The Aiken Taylor Award in Modern American Poetry from The Sewanee Review in Tennessee. In 2008, The Library of America published Anne Stevenson: Selected Poems, edited by Andrew Motion, in conjunction with the Neglected Masters Award. This series is exclusively devoted to the greatest figures in American literature.As well as her numerous collections of poetry, Anne Stevenson has published a biography of Sylvia Plath (1989), a book of essays, Between the Iceberg and the Ship (1998), and two critical studies of Elizabeth Bishop’s work, most recently Five Looks at Elizabeth Bishop (Bloodaxe Books, 2006). Her latest poetry books are Poems 1955-2005 (2005), Stone Milk (2007) and Astonishment (2012), all from Bloodaxe. ","links":[]},{"id":10208,"type":0,"title":"Ruth Stone","text":"Ruth Stone was born in Virginia in 1915, and lived in rural Vermont for much of her life. In 1959, after her husband committed suicide, she had to raise three daughters alone, all the time writing what she called her ‘love poems, all written to a dead man’ who forced her to ‘reside in limbo’ with her daughters. For 20 years she travelled the US, teaching creative writing at many universities. A greatly loved teacher, she was still working into her 80s. She won many awards and honours, including the National Book Award, the National Book Critics Circle Award, the Eric Mathieu King Award from the Academy of American Poets, a Whiting Award (with which she bought plumbing for her house), two Guggenheim Fellowships (one of which roofed the house), the Delmore Schwartz Award, the Cerf Lifetime Achievement Award from the state of Vermont, and the Shelley Memorial Award. Her retrospective What Love Comes To: New & Selected Poems was published in 2008 in the US by Copper Canyon and in the UK by Bloodaxe Books and was a Poetry Book Society Recommendation. She died in 2011, aged 96. ","links":[]},{"id":10209,"type":0,"title":"Arundhathi Subramaniam ","text":"Arundhathi Subramaniam lives in Bombay (a city she is perennially on the verge of leaving) where she works as writer, editor and curator. She has published two books of poetry in India with Allied Publishers, On Cleaning Bookshelves and Where I Live, and in Britain, Where I Live: New & Selected Poems (Bloodaxe Books, 2009), which combines selections of work from her two Indian collections with new poems. She has also written The Book of Buddha (Penguin, 2005) and Sadhguru: More Than a Life (Penguin, 2010), co-edited Confronting Love (Penguin, 2005), an anthology of Indian love poems in English, and edited Pilgrim's India: An Anthology (Penguin, 2011). In 2006 she appeared at London’s Poetry International festival and gave readings throughout Britain on a tour organised by the Poetry Society. ","links":[]},{"id":10210,"type":0,"title":"Matthew Sweeney","text":"Matthew Sweeney was born in Lifford, Co. Donegal, Ireland in 1952. He moved to London in 1973 and studied at the Polytechnic of North London and the University of Freiburg. After living in Berlin and Timisoara for some years, he returned to Ireland and now lives in Cork.His poetry collections include A Dream of Maps (Raven Arts Press, 1981), A Round House (Raven Arts Press, 1983), The Lame Waltzer (Raven Arts Press, 1985), Blue Shoes (Secker & Warburg, 1989), Cacti (Secker & Warburg, 1992), The Bridal Suite (Jonathan Cape, 1997) and A Smell of Fish (Jonathan Cape, 2000), Selected Poems (Jonathan Cape, 2002), Sanctuary (Jonathan Cape, 2004), Black Moon (Jonathan Cape, 2007), The Night Post: A Selection (Salt, 2010) and Horse Music (Bloodaxe Books, 2013). Black Moon was shortlisted for the T.S. Eliot Prize and for the Irish Times Poetry Now Award. Horse Music is a Poetry Book Society Recommendation. He has also published editions of selected poems in Canada (Picnic on Ice, Vehicule Press, 2002) and in Germany (Rosa Milch, bilingual trs. Jan Wagner, Berlin Verlag, 2008).He won a Cholmondeley Award in 1987 and an Arts Council Writers' Award in 1999. He has also published poetry for children, with collections including The Flying Spring Onion (1992), Fatso in the Red Suit (1995) and Up on the Roof: New and Selected Poems (2001). His novels for children include The Snow Vulture (1992) and Fox (2002). He edited The New Faber Book of Children's Poems (2003) and Walter De la Mare: Poems (2006) for Faber; co-edited Emergency Kit: Poems for Strange Times (Faber, 1996) with Jo Shapcott; and co-wrote Writing Poetry (Teach Yourself series, Hodder, 1997) with John Hartley Williams.Matthew Sweeney has held residencies at the University of East Anglia and the South Bank Centre in London, and was Poet in Residence at the National Library for the Blind as part of the Poetry Places scheme run by the Poetry Society in London. He is a member of Aosdána. ","links":[]},{"id":10211,"type":0,"title":"George Szirtes","text":"George Szirtes was born in Budapest in 1948, and came to England with his family after the 1956 Hungarian Uprising. He was educated in England, training as a painter, and has always written in English. In recent years he has worked as a translator of Hungarian literature, producing editions of such writers as Ottó Orbán, Zsuzsa Rakovszky and Ágnes Nemes Nagy. He co-edited Bloodaxe’s Hungarian anthology The Colonnade of Teeth. His Bloodaxe poetry books are The Budapest File (2000); An English Apocalypse (2001); Reel (2004), winner of the T.S. Eliot Prize; New & Collected Poems (2008) and The Burning of the Books and other poems (2009), shortlisted for the T.S. Eliot Prize 2009. His most recent collection, Bad Machine (2013), is a Poetry Book Society Choice and is shortlisted for the T.S. Eliot Prize 2013. Bloodaxe has also published John Sears’ critical study Reading George Szirtes (2008). Szirtes lives in Norfolk and teaches at the University of East Anglia. ","links":[]},{"id":10212,"type":0,"title":"A. S. J. Tessimond","text":"Arthur Seymour John Tessimond (1902-1962) was born in Birkenhead. He was sent to study at Charterhouse but ran away from school at 16. After taking a degree at Liverpool University, he tried his hand at teaching but only lasted two terms, whereupon he broke off his engagement and moved to London, working there in bookshops for two years before becoming an advertising copywriter. At the beginning of the Second World War, he gave up his job and flat and went on the run to avoid conscription, having decided he would be 'intensively miserable' as a soldier as well as 'useless and dangerous to others'. When he finally submitted himself to an army medical, he was declared unfit for service.One friend from his time in advertising was the Welsh painter Ceri Richards who, with his artist-wife Frances, remained close from 1928 till the end of his life, and she has written how three days before his death she had to take food and money to his Chelsea flat because he had given everything away to his latest girlfriend.Tessimond has been described as an eccentric, a night-lifer, loner and flâneur. He loved women, was always falling in love, but never married. His friend and literary executor, the poet and novelist Hubert Nicholson (1908-96), editor of his posthumous Collected Poems, wrote of his later circumstances: 'Tessimond's father left him about four thousand pounds, a sum not to be sneezed at, in 1945. He spent half of it on his nightclub hostesses, striptease girls and models, and the other half on \"four or five successive psychoanalysts\", for by the onset of middle age he had become gravely manic depressive. In the depth of his depression he often contemplated and talked of suicide, but never actually attempted it.'In the final phase of his life he underwent electric shock therapy at ever-shortening intervals. This had a deleterious effect on his memory, though not on his intellect. It temporarily raised his spirits to a rather hectic pitch, and may or may not have staved off self-destruction. Perhaps it may also have shortened his life.'On May 15, 1962, he was found dead in his flat in Chelsea, from natural causes, a brain haemorrhage, some two months before his sixtieth birthday. He had apparently been dead for two days before his body was discovered. Old age, which he had always feared, was never to be his.'Tessimond published three books of poetry in his lifetime: The walls of glass (Methuen, 1934), Voices in a giant city (Heinemann, 1947), and Selection (Putnam, 1958). Hubert Nicholson edited two posthumous selections, Not love perhaps… (Autolycus Publications, 1978) and Morning meeting (Autolycus Publications, 1980), before bringing together all Tessimond's work that had appeared in book form along with 27 uncollected poems and 25 previously unpublished or uncollected translations in The Collected Poems of A.S.J. Tessimond, with translations from the French of Jacques Prévert (Whiteknight Press, University of Reading, 1985). The latter volume is republished by Bloodaxe Books with Whiteknights Press in 2010. ","links":[]},{"id":10213,"type":0,"title":"D. M. Thomas","text":"Donald Michael Thomas, known as D. M. Thomas (born 27 January 1935), is a Cornish novelist, poet, playwright and translator.Thomas was born in Redruth, Cornwall, UK. He attended Trewirgie Primary School and Redruth Grammar School before graduating with First Class Honours in English from New College, Oxford in 1959. He lived and worked in Australia and the United States before returning to his native Cornwall.He published poetry and some prose in the British Science fiction magazine New Worlds (from 1968). The work that made him famous is his erotic and somewhat fantastical novel The White Hotel (1981), the story of a woman undergoing psychoanalysis, which has proved very popular in continental Europe and the United States. It was short-listed for the Booker Prize in 1981, coming a close second, in the view of some, to the winner, Salman Rushdie's Midnight's Children. It has also elicited considerable controversy, as some of its passages are taken from Anatoly Kuznetsov's Babi Yar, a novel about the Holocaust. In general, however, Thomas's use of such \"composite material\" (material taken from other sources and imitations of other writers) is seen as more postmodern than plagiarist. In the 1950s, at height of the Cold War, Thomas studied Russian during his National Service. He retained a lifelong interest in Russian culture and literature. This culminated in a series of well-received translations of Russian poetry in the 1980s. ","links":[]},{"id":10214,"type":0,"title":"Edward Thomas","text":"Edward Thomas (1878–1917) called himself ‘mainly Welsh’. He grew up in London, but developed a passion for Nature. Hating the economic forces that had destroyed agricultural communities and expanded cities, Thomas absorbed, as his poetry shows, the literary and folk traditions of the English countryside.After studying history at Oxford, he lived in rural southern England, particularly Steep in Hampshire. He supported his family by writing reviews, country books, biography and criticism. Overwork caused (sometimes suicidal) depression and creative despair. This self-styled ‘hurried & harried prose man’ could not find a ‘form that suits me’. Yet books such as The South Country (1909) and In Pursuit of Spring (1914) fertilised the poetry which – prompted by Robert Frost – Thomas began to write in December 1914. An influential poetry-reviewer, Thomas had praised Frost’s North of Boston as ‘revolutionary’. And its ‘absolute fidelity to the postures which the voice assumes in the most expressive intimate speech’ clarified his own artistic direction. Thomas's poem ‘The sun used to shine’ celebrates the poets’ friendship, but also suggests Thomas’s darker inspiration – the Great War. Although over-age, he enlisted in the Artists’ Rifles (July 1915). He was killed at Arras (April 1917) before his first collection, Poems, appeared. Edna Longley's edition of his poetry, The Annotated Collected Poems (Bloodaxe Books, 2008), has established the most authoritative text of his work, and has the most comprehensive notes and critical apparatus of any edition. ","links":[]},{"id":10215,"type":0,"title":"R. S. Thomas","text":"R.S. Thomas (1913-2000) is a major writer of our time, one of the finest religious poets in the English language and one of Wales’s greatest poets. He published over 50 books of poetry and prose. Most of his poems from his first 50 years of writing are in Collected Poems 1945-1990 (Phoenix Press), while the poems from his last five collections are included in Collected Later Poems (2004) from Bloodaxe. His Penguin Selected Poems is a curious selection drawing on both his Collecteds. His Uncollected Poems, edited by Tony Brown and Jason Walford Davies (Bloodaxe Books, 2013), selects previously published but uncollected poems included in none of his other published books.Born in Cardiff, the son of a sea captain, he moved with his family in 1918 to Holyhead on Anglesey. He was awarded a bursary in 1932 to study at the University College of North Wales, Bangor, where he read Classics. In 1936, having completed his theological training at St. Michael's College, Llandaff, he was ordained as a priest in the Church in Wales. From 1936 to 1940 he was the curate of Chirk, Denbighshire, where he met his future wife, Mildred (Elsi) Eldridge, an English artist. He subsequently became curate at Tallarn Green, Flintshire. They married in 1940 and remained together until her death in 1991. He married his second wife Betty in 1996.From 1942 to 1954 Thomas was rector at Manafon, in rural Montgomeryshire. It was during his time at Manafon that he first began to study Welsh and that he published his first three volumes of poetry. He learnt the Welsh language at the age of 30, too late in life, he said, to be able to write poetry in it, although he did write and publish memoirs in Welsh. In his later years he worked in predominantly Welsh-speaking communities at Eglwys-fach and Aberdaron. He retired from the Church in 1978, and afterwards lived on Anglesey and on Llyn.He won several awards, including the Queen's Gold Medal for Poetry in 1964. In 1996 he won the Lannan Lifetime Achievement Award for Poetry and the Horst Bienek Prize for Poetry. He was also nominated for the 1996 Nobel Prize in Literature (awarded to Seamus Heaney). ","links":[]},{"id":10216,"type":0,"title":"Brian Turner","text":"Brian Turner served for seven years in the US Army. He was an infantry team leader for a year in Iraq from November 2003 with the 3rd Stryker Brigade Combat Team, 2nd Infantry Division. In 1999-2000 he was deployed to Bosnia-Herzegovina with the 10th Mountain Division. Born in 1967, he received an MFA from the University of Oregon and lived abroad in South Korea for a year before joining the army.His poetry was included in the Voices in Wartime Anthology published in conjunction with a feature-length documentary film. His collection Here, Bullet (Bloodaxe Books, 2007) was first published in the US by Alice James Books in 2005, where it has earned Turner nine major literary awards, including a 2006 Lannan Literary Fellowship and a 2007 NEA Literature Fellowship in Poetry. In 2009 he was given an Amy Lowell Traveling Fellowship. His second collection, Phantom Noise is published by Alice James Books in the US and by Bloodaxe Books in the UK in 2010. It has been shortlisted for the 2010 T S Eliot Prize. ","links":[]},{"id":10217,"type":0,"title":"Chase Twichell","text":"Chase Twichell was born in 1950 in New Haven, Connecticut, and educated at Trinity College (Hartford) and the University of Iowa. She lives in the Keene Valley in the Adirondacks, where she spent many summers and vacations during her childhood and where her father's family had gone for many generations. The two greatest influences on her life and work have been this early intimacy with wilderness followed by her years as a Zen Buddhist student of John Daido Loori at Zen Mountain Monastery in the Catskills.Her poetry books include Northern Spy (University of Pittsburgh Press, 1981), The Odds (University of Pittsburgh Press, 1986), Perdido (Farrar, Straus & Giroux, USA, 1991; Faber & Faber, UK, 1992, Poetry Book Society Choice), The Ghost of Eden (Ontario Review Press, USA, 1995; Faber & Faber, UK, 1996, Poetry Book Society Recommendation), The Snow Watcher (Ontario Review Press, USA, 1998; Bloodaxe Books, UK, 1999); Dog Language (Copper Canyon Press, USA, 2005; Bloodaxe Books, UK, 2006, Poetry Book Society Recommendation); and Horses Where the Answers Should Have Been: New & Selected Poems (Copper Canyon Press, USA, 2010; Bloodaxe Books, UK, 2010). The Lover of God (by Rabindranath Tagore, co-translated with Tony K. Stewart) was published by Copper Canyon Press in 2003. She also co-edited The Practice of Poetry: Writing Exercises from Poets Who Teach with Robin Behn (HarperCollins, 1992).She has received fellowships from the National Endowment for the Arts, the Artists Foundation, the John Simon Guggenheim Memorial Foundation, the New Jersey State Council on the Arts, and a Literature Award from the American Academy of Arts and Letters. In 1997 she won the Alice Fay DiCastagnola Award from the Poetry Society of America for The Snow Watcher. She received a Smart Family Foundation Award in 2004.From 1976 to 1984 she worked at Pennyroyal Press, and from 1986 to 1988 she co-edited the Alabama Poetry Series, published by University of Alabama Press. After teaching for many years (at Hampshire College, the University of Alabama, Goddard College, Warren Wilson College, and Princeton University), she resigned in 1999 to start Ausable Press, a non-profit, independent literary press that she operated until it was acquired by Copper Canyon Press in 2009. ","links":[]},{"id":10218,"type":0,"title":"Priscila Uppal","text":"Priscila Uppal is a Canadian poet and fiction writer of South Asian descent. Born in Ottawa in 1974, she lives in Toronto. She has a PhD in English Literature and is a professor of Humanities and English at York University in Toronto. Her first UK poetry selection Successful Tragedies: Poems 1998-2010 (Bloodaxe Books, 2010) draws on six collections of poetry published in Canada: How to Draw Blood From a Stone (1998), Confessions of a Fertility Expert (1999), Pretending to Die (2001), Live Coverage (2003), Holocaust Dream (with photographs by Daniel Ehrenworth, 2005), Ontological Necessities (2006) and Traumatology (2009). Her other books include the novels The Divine Economy of Salvation (2002) and To Whom It May Concern (2009), and the critical study We Are What We Mourn: The Contemporary English-Canadian Elegy (2009). She also edited the multilingual Exile Book of Poetry in Translation: 20 Canadian Poets Take On the World (2009). Her works have been translated into Croatian, Dutch, Greek, Korean, Latvian, and Italian, and Ontological Necessities was shortlisted for the prestigious $50,000 Griffin Prize for Excellence in Poetry. ","links":[]},{"id":10219,"type":0,"title":"Fred Voss","text":"Fred Voss has been a machinist for 30 years, picking up the pen and the wrench to chronicle what goes on between tin walls. He has published three books of poems with Bloodaxe, Goodstone (1991), Carnegie Hall with Tin Walls (1998) and Hammers and Hearts of the Gods (2009). His work has been featured prominently by the magazines Bête Noire in Britain and the Wormwood Review in the States, and he won the 1988 Wormwood Award. Love Birds, a collaboration with his poet wife Joan Jobe Smith, won the 1996 Chiron Prize. He lives in Long Beach, California, and works in a nearby factory. ","links":[]},{"id":10220,"type":0,"title":"Sarah Wardle","text":"Sarah Wardle was born in London in 1969. She was educated at Cheltenham Ladies’ College; Oxford, where she read Classics; and Sussex, where she read English. She won Poetry Review’s new poet of the year award in 1999 and her first collection, Fields Away (Bloodaxe Books, 2003), was shortlisted for the Forward best first collection prize. Her second book, SCORE! (Bloodaxe Books, 2005), included some of the poems she broadcast while poet-in-residence for Tottenham Hotspur Football Club, as well as the script of a film-poem, ‘X: A Poetry Political Broadcast’. A Knowable World (Bloodaxe Books, 2009) followed her detainment in a Central London psychiatric hospital, and a new collection, Beyond, is due from Bloodaxe in 2014. She is a lecturer in poetry at Middlesex University and Morley College, and a FRSA. ","links":[]},{"id":10221,"type":0,"title":"Ahren Warner","text":"Ahren Warner was born in 1986 and grew up in Lincolnshire. He lived in Paris whilst writing his doctorate and now lives in London. His first collection, Confer (Bloodaxe Books, 2011), was a Poetry Book Society Recommendation and was shortlisted for both the Forward Prize for Best First Collection and the Michael Murphy Memorial Prize 2013. He was awarded an Eric Gregory Award in 2010 and an Arts Foundation Fellowship in 2012. His second collection, Pretty (Bloodaxe Books, 2013) is another Poetry Book Society Recommendation. He is poetry editor of Poetry London. ","links":[]},{"id":10222,"type":0,"title":"Alan Wearne","text":"Alan Wearne (born 1948) is an Australian poet.Alan Wearne was born and grew up in Melbourne. He studied history at Monash University where he met the poets Laurie Duggan and John A. Scott. After publishing two collections of poetry, he wrote a verse novel, The Nightmarkets, published in 1986 which won the Banjo Award and was adapted for performance.His next book in the same genre, The Lovemakers, won the Kenneth Slessor Prize for Poetry and the Arts Queensland Judith Wright Calanthe Award. The first half of the novel was published by Penguin, and its second by the ABC in 2004 as The Lovemakers: Book Two, Money and Nothing and co-won The Foundation for Australian Literary Studies’ Colin Roderick Award and the H. T. Priestly Medal. Despite this critical success neither book was promoted properly and both volumes ended up being pulped. Shearsman Press in the UK has since republished the book in a single volume.Alan Wearne's latest work, \"The Australian Popular Songbook\" was published in 2008 by Giramondo Publishing. He currently lectures in Creative Writing at the University of Wollongong. ","links":[]},{"id":10223,"type":0,"title":"Nigel Wells","text":"Nigel Wells is a poet and playwright. He was born in 1944 and brought up near Portsmouth. He spent four years in the RAF, then seven years working in a Ministry of Agriculture laboratory. After moving to Wales in 1972, he worked on farms, in forestry, and as a builder and a community worker, and studied at the University College of Wales, Aberystwyth. He now lives in Aberaeron and was the winner of Welsh Arts Council Prizes in 1980 and 1989.","links":[]},{"id":10224,"type":0,"title":"Christiana Whitehead","text":"Christiania Whitehead was born in 1969 in Newcastle, wher her poetry was first published by Bloodaxe in its Bossy Parrot (1987) anthology as a prizewinner of the Evening Chronicle Poetry Competition, and later in Carol Rumens' New Women Poets (1990). She studied English to postgraduate level at Magdalen College, Oxford, and now teaches at the University of Warwick. She is currently writing a book on medieval allegory. She won an Eric Gregory Award in 1998. Her first collection The Garden of Slender Trust (Bloodaxe Books, 1999) was shortlisted for the Forward Prize for Best First Collection. ","links":[]},{"id":10225,"type":0,"title":"Susan Wicks","text":"Susan Wicks has published three books of poetry with Bloodaxe Books: House of Tongues (2011), De-iced (2007), and Night Toad: New & Selected Poems (2003), which included a new collection with selections from three earlier books published by Faber: Singing Underwater, winner of the Aldeburgh Poetry Festival Prize; Open Diagnosis, which was one of the Poetry Society’s New Generation Poets titles; and The Clever Daughter, a Poetry Book Society Choice which was shortlisted for both T.S. Eliot and Forward Prizes. Both House of Tongues and Night Toad are Poetry Book Society Recommendations.She has also published two novels, The Key (Faber, 1997) and Little Thing (Faber, 1998), a short memoir, Driving My Father (Faber, 1995), and a collection of short fiction, Roll Up for the Arabian Derby (Bluechrome, 2008). Her translation of Valérie Rouzeau’s Cold Spring in Winter (Arc, 2009) won the Scott-Moncrieff Prize for French Translation, and was shortlisted for both the International Griffin Poetry Prize and the Oxford-Weidenfeld Prize.Born and raised in Kent, she lives in Tunbridge Wells, and is currently teaching at Goldsmiths’ College, London. ","links":[]},{"id":10226,"type":0,"title":"C. K. Williams","text":"C.K. Williams was born in New Jersey in 1936, and lives in Normandy, France, and Princteon, USA. He has published a dozen books in Britain with Bloodaxe, including New & Selected Poems (1995), The Vigil (1997), Repair (1999) and The Singing (2003) – all four of these were Poetry Book Society Recommendations – followed by Collected Poems (2006), Wait (2010) and Writers Writing Dying (Farrar, Straus & Giroux, USA, 2012; Bloodaxe Books, 2013), another Poetry Book Society Recommendation.Flesh and Blood won the National Book Critics Circle Prize in 1987, Repair was awarded the 2000 Pulitzer Prize, and The Singing won the National Book Award for 2003. He has also been awarded the Ruth Lilly Poetry Prize, the PEN Voelker Career Achievement Award in Poetry for 1998; a Guggenheim Fellowship, two NEA grants, the Berlin Prize of the American Academy in Berlin, a Lila Wallace Fellowship, and prizes from PEN and the American Academy of Arts and Letters.He published a memoir, Misgivings (Farrar, Straus & Giroux), in 2000, which was awarded the PEN Albrand Memoir Award, and translations of Sophocles’ Women of Trachis, Euripides’ Bacchae, and poems of Francis Ponge, among others. He has published two books of essays, Poetry and Consciousness (University of Michigan Press, 1998), and In Time: Poets, Poems, and the Rest (University of Chicago Press, 2012), and his book on Walt Whitman, On Whitman, was published by Princeton University Press in 2010.He teaches in the Creative Writing Program at Princeton University, is a member of the American Academy of Arts and Letters, and is currently a chancellor of the American Academy of Poets. ","links":[]},{"id":10227,"type":0,"title":"John Hartley Williams","text":"John Hartley Williams teaches at the Free University of Berlin. His second book, Bright River Yonder (Bloodaxe, 1987), a Poetry Book Society Recommendation, is a baroque Wild West poetry adventure. Its centrepiece, the lnog poem Ephraim Destiny's Perfectly Utter Darkness, won first prize in the Arvon poetry compeetition. ","links":[]},{"id":10228,"type":0,"title":"Heidi Williamson","text":"Born in Norfolk in 1971, Heidi Williamson has lived in Stirling, Brussels and Salisbury. She now lives in Wymondham, Norfolk. In 2008-09 she was poet-in-residence at the London Science Museum’s Dana Centre, and she is currently poet-in-residence at the John Jarrold Printing Museum in Norwich. In 2008 she received an Arts Council award to complete her first collection, Electric Shadow (Bloodaxe Books, 2011), a Poetry Book Society Recommendation, which was shortlisted for the Seamus Heaney Centre for Poetry Prize. Her work has been used to inspire poetry and science discussions in schools and adult creative writing groups, and has featured in NHS waiting rooms, cafés, and at festivals.","links":[]},{"id":10229,"type":0,"title":"C. D. Wright","text":" C.D. Wright has published more than fifteen books of poetry and prose, including two book-length poems, Deepstep Come Shining (1998) and Just Whistle (1993); Cooling Time (2005), a book comprised of poetry, memoir and essay; and One with Others (Copper Canyon Press, USA, 2010; Bloodaxe Books, UK, 2013), both a book-length poem and a work of investigative journalism.Her first UK retrospective, Like Something Flying Backwards: New & Selected Poems (Bloodaxe Books, 2007), was expanded from Steal Away: Selected and New Poems (Copper Canyon Press, 2003), including a substantial number of the poems from her Griffin International Prize-winning collection Rising, Falling, Hovering (Copper Canyon Press, 2008). Her many honours include a Lannan Literary Award, a $500,000 MacArthur Fellowship and the $50,000 2009 Griffin International Poetry Prize for Rising, Falling, Hovering (Copper Canyon Press, 2008). She is a professor of English at Brown University, and edited Lost Roads Publishers for 30 years with her husband, poet Forrest Gander. She has collaborated on many projects with photographer Deborah Luster, most recently One Big Self: Prisoners of Louisiana (2003\/2007). She was State Poet of Rhode Island from 1995 to 1999. ","links":[]},{"id":10230,"type":0,"title":"James Wright","text":"James Arlington Wright was born in Martins Ferry, Ohio, in 1927. His father worked for 50 years at a glass factory, and his mother left school at 14 to work in a laundry; neither attended school beyond the eighth grade. While in high school in 1943 Wright suffered a nervous breakdown and missed a year of school. When he graduated in 1946, a year late, he joined the army and was stationed in Japan during the American occupation. He then attended Kenyon College on the G.I. Bill, and studied under John Crowe Ransom. He graduated in 1952, then married another Martins Ferry native, Liberty Kardules. The two travelled to Austria, where, on a Fulbright Fellowship, Wright studied the works of Theodor Storm and Georg Trakl at the University of Vienna. He returned to the US, studying with Theodore Roethke and Stanley Kunitz at the University of Washington, and went on to teach at The University of Minnesota, Macalester College, and New York City's Hunter College.The poverty and human suffering Wright witnessed as a child profoundly influenced his writing and he used his poetry as a mode to discuss his political and social concerns. He modelled his work after Thomas Hardy and Robert Frost, whose engagement with profound human issues and emotions he admired. The subjects of Wright's earlier books, The Green Wall (winner of the Yale Series of Younger Poets award, 1957) and Saint Judas (1959), include men and women who have lost love or have been marginalised from society for such reasons as poverty and sexual orientation, and they invite the reader to step in and experience the pain of their isolation. Wright possessed the ability to reinvent his writing style at will, moving easily from stage to stage. His earlier work adheres to conventional systems of meter and stanza, while his later work exhibits more open, looser forms, as with The Branch Will Not Break (1963).James Wright was elected a fellow of The Academy of American Poets in 1971, and the following year his Collected Poems received the Pulitzer Prize in poetry. He died in New York City in 1980. Above the River: Complete Poems was published in the US in 1990 and then in the UK by Bloodaxe Books in 1992. ","links":[]},{"id":10231,"type":0,"title":"Robert Wrigley","text":"Robert Wrigley was born in 1951 in East St Louis, Illinois. He was drafted in 1971, but later discharged as a conscientious objector. The first in his family to graduate from college, and the first male for generations to escape work in a coal mine, Wrigley earned his MFA from the University of Montana. He has been awarded fellowships from the National Endowment for the Arts, the Rockefeller Foundation, the Guggenheim Foundation, and the Idaho Commission on the Arts. He has taught at Lewis-Clark State College, Warren Wilson College, the University of Oregon and the University of Montana, and now teaches on the MFA program at the University of Idaho. He lives in the woods on Moscow Mountain, Idaho, with his wife, writer Kim Barnes.His first book to be published in the UK, The Church of Omnivorous Light: Selected Poems (Bloodaxe Books, 2013), draws on several collections published in the US, including Beautiful Country (2010); Earthly Meditations: New and Selected Poems (2006); Lives of the Animals (2003), winner of the Poets Prize; Reign of Snakes (1999), winner of the Kingsley Tufts Award; and In the Bank of Beautiful Sins (1995), winner of the San Francisco Poetry Center Book Award and finalist for the Lenore Marshall Award from the Academy of American Poets. Wrigley has also won the J. Howard and Barbara M.J. Wood Prize, Poetry magazine’s Frederick Bock Prize, the Poetry Society of America’s Celia B. Wagner Award, Poetry Northwest’s Theodore Roethke Award, and six Pushcart Prizes. ","links":[]},{"id":10232,"type":0,"title":"Benjamin Zephaniah","text":"Benjamin Zephaniah is an oral poet, novelist, playwright, children’s writer and reggae artist. Born in 1958 in Birmingham, he grew up in Handsworth, where he was sent to an approved school for being uncontrollable, rebellious and ‘a born failure’, ending up in jail for burglary and affray.After prison he turned from crime to music and poetry. In 1989 he was nominated for Oxford Professor of Poetry, and has since received honorary doctorates from several English universities, but famously refused to accept a nomination for an OBE in 2003. He was voted Britain's third favourite poet of all time (after T.S. Eliot and John Donne) in a BBC poll in 2009. In 2011 he was poet-in-residence at Keats House in 2011, and then made a radical career change by taking up his first ever academic position as a chair in Creative Writing at Brunel University in West London.He has appeared in a number of television programmes, including Eastenders, The Bill, Live and Kicking, Blue Peter and Wise Up, and played Gower in a BBC Radio 3 production of Shakespeare’s Pericles in 2005.Best known for his performance poetry with a political edge for adults – and his poetry with attitude for children – he has his own rap\/reggae band. He has produced numerous recordings, including Dub Ranting (1982), Rasta (1983), Us and Dem (1990), Back to Roots (1995), Belly of de Beast (1996) and Naked (2004). He was the first person to record with the Wailers after the death of Bob Marley, in a musical tribute to Nelson Mandela, which Mandela heard while in prison on Robben Island. Their later meetings led to Zephaniah working with children in South African townships and hosting the President’s Two Nations Concert at the Royal Albert Hall in 1996.His first book of poems, Pen Rhythm, was produced in 1980 by a small East London publishing cooperative, Page One Books. His second collection, The Dread Affair, was published by Hutchinson’s short-lived Arena imprint in 1985. He has since published three collections with Bloodaxe, City Psalms (1992), Propa Propaganda (1996) and Too Black Too Strong (2001), the latter including poems written while working with Michael Mansfield QC and other Tooks barristers on the Stephen Lawrence case. His DVD-book To Do Wid Me: Benjamin Zephaniah live and direct (filmed by Pamela Robertson-Pearce) is out from Bloodaxe Books in 2013.His other titles include his poetry books for children, Talking Turkeys (1994), Funky Chickens (1996) and Wicked World (2000), all from Puffin\/Penguin; his novels for teenagers, Face (1999), Refugee Boy (2001), Gangsta Rap (2004) and Teacher’s Dead (2007), all from Bloomsbury; The Bloomsbury Book of Love Poems (1999); Schools Out: Poems Not for School (1997) and The Little Book of Vegan Poems (2001) from AK Press; and We Are Britain (Frances Lincoln, 2003). ","links":[]}]